Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: The problem was likely caused by what is known as a 'circular import'. First, Python imported and started executing the code in file '{file}'. which imports module `{last_module}`. During this process, the code in another file, '{last_file}' was executed. However in this last file, an attempt was made to import the original module `{last_module}` a second time, before Python had completed the first import.
ru: Проблема, скорее всего, была вызвана тем, что известно как 'кольцевой импорт' Сначала Python импортировал и начал выполнять код в файле '{file}', который импортирует модуль `{last_module}`. Во время этого процесса код в другом файле, '{last_file}' был выполнен. Однако в этом последнем файле была предпринята попытка импортировать исходный модуль `{last_module}` во второй раз, прежде чем Python завершил первый импорт.
ta: 'வட்ட இறக்குமதி' என்று அழைக்கப்படுவதால் இந்தச் சிக்கல் ஏற்பட்டிருக்கலாம். முதலில், பைதான் '{file}' கோப்பில் குறியீட்டை இறக்குமதி செய்து செயல்படுத்தத் தொடங்கியது. இது `{last_module}` தொகுதியை இறக்குமதி செய்கிறது. இந்தச் செயல்பாட்டின் போது, மற்றொரு கோப்பில் உள்ள குறியீடு, '{last_file}' செயல்படுத்தப்பட்டது. இருப்பினும் இந்த கடைசி கோப்பில், பைதான் முதல் இறக்குமதியை முடிப்பதற்கு முன், அசல் தொகுதி `{last_module}` இரண்டாவது முறையாக இறக்குமதி செய்ய முயற்சி செய்யப்பட்டது.

source: You have tried to assign a value to an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
ru: Вы попытались присвоить значение элементу объекта типа `{obj_type}`, который я не могу определить. Указанный вами индекс не является допустимым значением.
ta: என்னால் அடையாளம் காண முடியாத வகை `{obj_type}` பொருளின் ஒரு பொருளுக்கு மதிப்பை ஒதுக்க முயற்சித்தீர்கள். நீங்கள் கொடுத்த குறியீடு அனுமதிக்கப்பட்ட மதிப்பு அல்ல.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} of length `{length}`.
ru: Вы попытались присвоить значение индексу `{index}` из `{name}`, {obj_type} длины `{length}`.
ta: `{name}` இன் குறியீட்டு `{index}`, {obj_type} நீளம் `{length}`க்கு மதிப்பை ஒதுக்க முயற்சித்தீர்கள்.

source: The valid index values of `{name}` are integers ranging from `{min}` to `{max}`.
ru: Допустимыми значениями индекса `{name}` являются целые числа в диапазоне от `{min}` до `{max}`.
ta: `{name}` இன் செல்லுபடியாகும் குறியீட்டு மதிப்புகள் `{min}` முதல் `{max}` வரையிலான முழு எண்களாகும்.

source: Remember: the first item of {obj_type} is not at index 1 but at index 0.
ru: Помните: первый элемент {obj_type} имеет индекс не 1, а 0.
ta: நினைவில் கொள்ளுங்கள்: {obj_type} இன் முதல் உருப்படி குறியீட்டு 1 இல் இல்லை, ஆனால் குறியீட்டு 0 இல் உள்ளது.

source: `{name}` contains no item.
ru: `{name}` не содержит ни одного элемента.
ta: `{name}` இல் உருப்படி இல்லை.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} which contains no item.
ru: Вы попытались присвоить значение индексу `{index}` из `{name}`, {obj_type}, который не содержит ни одного элемента.
ta: `{name}` இன் `{index}` குறியீட்டுக்கு மதிப்பை ஒதுக்க முயற்சித்தீர்கள், {obj_type} இதில் உருப்படி இல்லை.

source: You have tried to get an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
ru: Вы пытались получить элемент объекта типа `{obj_type}`, который невозможно определить. Указанный вами индекс не является допустимым значением.
ta: என்னால் அடையாளம் காண முடியாத வகை `{obj_type}` பொருளைப் பெற முயற்சித்தீர்கள். நீங்கள் கொடுத்த குறியீடு அனுமதிக்கப்பட்ட மதிப்பு அல்ல.

source: You have tried to get an item from `{name}`, {obj_type} of length `{length}`, by using a value for the index that I cannot determine but which is not allowed.
ru: Вы пытались получить элемент из `{name}`, {obj_type} длиной `{length}`, используя значение для индекса которое я не могу определить, но которое не разрешено.
ta: `{name}` இலிருந்து உருப்படியைப் பெற முயற்சித்தீர்கள், {obj_type} நீளம் `{length}`, குறியீட்டிற்கான மதிப்பைப் பயன்படுத்துவதன் மூலம், என்னால் தீர்மானிக்க முடியாது, ஆனால் இது அனுமதிக்கப்படவில்லை.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} of length `{length}`.
ru: Вы пытались получить элемент с индексом `{index}` из `{name}`, {obj_type} длиной `{length}`.
ta: `{name}` இன் குறியீட்டு `{index}` உடன் உருப்படியைப் பெற முயற்சித்தீர்கள், {obj_type} நீளம் `{length}`.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} which contains no item.
ru: Вы пытались получить элемент с индексом `{index}` из `{name}`, {obj_type}, который не содержит ни одного элемента.
ta: `{name}` இன் குறியீட்டு `{index}` உடன் உருப்படியைப் பெற முயற்சித்தீர்கள், {obj_type} இதில் உருப்படி இல்லை.

source: You tried to retrieve an item from an empty `dict` or a similar object which I cannot identify.
ru: Вы пытались получить элемент из пустого словаря `dict` или похожего объекта, который я не могу идентифицировать.
ta: நான் அடையாளம் காண முடியாத வெற்று `dict` அல்லது அதுபோன்ற பொருளில் இருந்து ஒரு பொருளை மீட்டெடுக்க முயற்சித்தீர்கள்.

source: `{name}` is an empty `dict`.
ru: `{name}` -- пустой словарь `dict`.
ta: `{name}` என்பது வெற்று `dict`.

source: You tried to retrieve an item from `{name}` which is an empty `dict`.
ru: Вы попытались получить элемент из `{name}`, который является пустым словарём `dict`.
ta: `{name}` இலிருந்து ஒரு உருப்படியை மீட்டெடுக்க முயற்சித்தீர்கள், அது வெற்று `dict` ஆகும்.

source: You tried to retrieve an item from an empty ChainMap or similar object which I cannot identify.
ru: Вы пытались получить элемент из пустого ChainMap или подобного объекта, который я не могу идентифицировать.
ta: நான் அடையாளம் காண முடியாத வெற்று சங்கிலிவரைபடம் அல்லது அதைப் போன்ற பொருளில் இருந்து ஒரு பொருளை மீட்டெடுக்க முயற்சித்தீர்கள்.

source: `{name}` is an empty `ChainMap`.
ru: `{name}` -- это пустой `ChainMap`.
ta: `{name}` என்பது வெற்று `ChainMap`.

source: You tried to retrieve an item from `{name}` which is an empty `ChainMap`.
ru: Вы попытались получить элемент из `{name}`, который является пустым `ChainMap`.
ta: `{name}` இலிருந்து ஒரு உருப்படியை மீட்டெடுக்க முயற்சித்தீர்கள், அது காலியான `ChainMap` ஆகும்.

source: Missing key `{key}` in a `ChainMap` or in a similar object.
ru: Отсутствие ключа `{key}` в `ChainMap` или подобном объекте.
ta: `ChainMap` அல்லது அதைப் போன்ற பொருளில் `{key}` திறவுகோல் இல்லை.

source: A `dict` or a similar object which I cannot identify does not have `{key}` as a key.
ru: `dict` или подобный объект, который я не могу идентифицировать. не содержит `{key}` в качестве ключа.
ta: ஒரு `dict` அல்லது என்னால் அடையாளம் காண முடியாத ஒத்த பொருளுக்கு `{key}` திறவுகோல் இல்லை.

source: The key `{key}` cannot be found in the dict `{name}`.
ru: В словаре `{name}` не найден ключ `{key}`.
ta: `{key}` திறவுகோலை `{name}` இல் காண முடியாது.

source: The key `{key}` cannot be found in `{name}`, an object of type `{obj_type}`.
ru: Ключ `{key}` не найден в `{name}`, объекте типа `{obj_type}`.
ta: `{obj_type}` வகைப் பொருளான `{name}` இல் `{key}` திறவுகோலைக் காண முடியவில்லை.

source: `{name}` contains a string key which is identical to `str({key})`. Perhaps you forgot to convert the key into a string.
ru: `{name}` содержит строковый ключ, который идентичен `str({key})`. Возможно, вы забыли преобразовать ключ в строку.
ta: `{name}` இல் `str({key})` க்கு ஒத்த சரம் விசை உள்ளது. ஒருவேளை நீங்கள் திறவுகோலை சரமாக மாற்ற மறந்துவிட்டீர்கள்.

source: Did you forget to convert `{key}` into a string?
ru: Вы забыли преобразовать `{key}` в строку?
ta: `{key}` ஐ சரமாக மாற்ற மறந்துவிட்டீர்களா?

source: `{key}` is a string. There is a key of `{name}` whose string representation is identical to `{key}`.
ru: `{key}` -- это строка. Существует ключ `{name}`, строковое представление которого идентично `{key}`.
ta: `{key}` என்பது ஒரு சரம். `{name}` இன் திறவுகோல் உள்ளது, அதன் சரம் பிரதிநிதித்துவம் `{key}` ஐ ஒத்ததாக இருக்கும்.

source: Did you convert `{key}` into a string by mistake?
ru: Вы ошибочно преобразовали `{key}` в строку.
ta: தவறுதலாக `{key}` ஐ சரமாக மாற்றிவிட்டீர்களா?

source: `{name}` is a key of `{dict_}` which is similar to `{key}`.
ru: `{name}` является ключом `{dict_}`, который аналогичен `{key}`.
ta: `{name}` என்பது `{dict_}` இன் திறவுகோல், இது `{key}` போன்றது.

source: `{name}` has some keys similar to `{key}` including: `{names}`.
ru: `{name}` имеет несколько ключей, похожих на `{key}`, включая: `{names}`.
ta: `{name}` என்பது `{key}` போன்ற சில திறவுகோலைகளைக் கொண்டுள்ளது: `{names}`.

source: No additional information available since `{name}` cannot be imported.
ru: Дополнительная информация недоступна, поскольку `{name}` не может быть импортирован.
ta: `{name}` இறக்குமதி செய்ய முடியாததால் கூடுதல் தகவல்கள் எதுவும் கிடைக்கவில்லை.

source: Did you mean `from {name} import {rest}`?
ru: Вы имели в виду `from {name} import {rest}`?
ta: `from {name} import {rest}` எனக் குறிப்பிடுகிறீர்களா?

source: `{rest}` is not a separate module but an object that is part of `{name}`.
ru: `{rest}` -- это не отдельный модуль, а объект, который является частью `{name}`.
ta: `{rest}` என்பது ஒரு தனி தொகுதி அல்ல, ஆனால் `{name}` இன் ஒரு பகுதியாகும்.

source: Did you mean `import {name}.{attr}`?
ru: Вы имели в виду `import {name}.{attr}`?
ta: நீங்கள் குறிப்பிடுவது `import {name}.{attr}`?

source: Perhaps you meant `import {name}.{attr}`. `{attr}` is a name similar to `{rest}` and is a module that can be imported from `{name}`.
ru: Возможно, вы имели в виду `import {name}.{attr}`. `{attr}` -- это имя, похожее на `{rest}`, и это модуль, который может быть импортирован из `{name}`.
ta: ஒருவேளை நீங்கள் `import {name}.{attr}` எனக் குறிப்பிட்டிருக்கலாம். `{attr}` என்பது `{rest}` என்பதற்கு ஒத்த பெயராகும், மேலும் இது `{name}` இலிருந்து இறக்குமதி செய்யக்கூடிய ஒரு தொகுதியாகும்.

source: Did you mean `from {name} import {attr}`?
ru: Вы имели в виду `from {name} import {attr}`?
ta: `from {name} import {attr}` எனக் குறிப்பிடுகிறீர்களா?

source: Perhaps you meant `from {name} import {attr}`. `{attr}` is a name similar to `{rest}` and is an object that can be imported from `{name}`.
ru: Возможно, вы имели в виду `from {name} import {attr}`. `{attr}` -- это имя, похожее на `{rest}` и являющееся объектом, который может быть импортирован из `{name}`.
ta: ஒருவேளை நீங்கள் `from {name} import {attr}` எனக் கூறியிருக்கலாம். `{attr}` என்பது `{rest}` போன்ற பெயராகும், மேலும் இது `{name}` இலிருந்து இறக்குமதி செய்யக்கூடிய ஒரு பொருளாகும்.

source: Other objects with similar names that are part of `{name}` include `{others}`.
ru: Другие объекты с похожими именами, которые являются частью `{name}`, включают `{others}`.
ta: `{name}` இன் பகுதியாக உள்ள ஒத்த பெயர்களைக் கொண்ட பிற பொருள்களில் `{others}` அடங்கும்.

source: `{rest}` cannot be imported from `{name}`.
ru: `{rest}` не может быть импортирован из `{name}`.
ta: `{rest}` ஐ `{name}` இலிருந்து இறக்குமதி செய்ய முடியாது.

source: The curses module is rarely installed with Python on Windows.
ru: Модуль curses редко устанавливается вместе с Python в Windows.
ta: Windows இல் பைத்தானுடன் curses தொகுதி அரிதாகவே நிறுவப்பட்டுள்ளது.

source: The curses module is often not installed with Python.
ru: Модуль curses часто не поставляется вместе с Python.
ta: curses தொகுதி பெரும்பாலும் பைத்தானுடன் நிறுவப்படுவதில்லை.

source: You have tried to import the curses module.
ru: Вы попытались импортировать модуль curses.
ta: நீங்கள் curses தொகுதியை இறக்குமதி செய்ய முயற்சித்தீர்கள்.

source: No module named `{name}` can be imported. Perhaps you need to install it.
ru: Модуль с именем `{name}` не может быть импортирован. Возможно, вам необходимо установить его.
ta: `{name}` என்ற பெயருடைய எந்தத் தொகுதியையும் இறக்குமதி செய்ய முடியாது. ஒருவேளை நீங்கள் அதை நிறுவ வேண்டும்.

source: The following existing modules have names that are similar to the module you tried to import: `{names}`
ru: Следующие существующие модули имеют имена, похожие на тот модуль, который вы пытались импортировать: `{names}`
ta: பின்வரும் தொகுதிகள் நீங்கள் இறக்குமதி செய்ய முயற்சித்த தொகுதிக்கு ஒத்த பெயர்களைக் கொண்டுள்ளன: `{names}`

source: `{name}` is an existing module that has a similar name.
ru: `{name}` -- существующий модуль с похожим именем.
ta: `{name}` என்பது ஒரே மாதிரியான பெயரைக் கொண்ட ஏற்கனவே உள்ள தொகுதி.

source: You are already using Python!
ru: Вы уже используете Python!
ta: நீங்கள் ஏற்கனவே பைத்தானைப் பயன்படுத்துகிறீர்கள்!

source: `{name}` is a name found in module `{mod}`. Perhaps you forgot to write from {mod} import {name}
ru: `{name}` -- это имя, найденное в модуле `{mod}`. Возможно, вы забыли написать from {mod} import {name}
ta: `{name}` என்பது தொகுதி `{mod}` இல் காணப்படும் பெயர். ஒருவேளை நீங்கள் எழுத மறந்துவிட்டீர்கள் from {mod} import {name}

source: `{name}` is a name found in the following modules from the standard library: {modules}. Perhaps you forgot to import `{name}` from one of these modules.
ru: `{name}` - это имя, встречающееся в следующих модулях из стандартной библиотеки: {modules}. Возможно, вы забыли импортировать `{name}` из одного из этих модулей.
ta: `{name}` என்பது நிலையான நூலகத்திலிருந்து பின்வரும் தொகுதிகளில் காணப்படும் பெயர்: {modules}. இந்த தொகுதிகளில் ஒன்றிலிருந்து `{name}` ஐ இறக்குமதி செய்ய மறந்துவிட்டீர்கள்.

source: In your program, `{var_name}` is an unknown name that exists in an enclosing scope, but has not yet been assigned a value.
ru: В вашей программе `{var_name}` -- это неизвестное имя, которому еще не присвоено значение.
ta: உங்கள் திட்டத்தில், `{var_name}` என்பது அறியப்படாத பெயராகும், இது ஒரு மூடிய நோக்கத்தில் உள்ளது, ஆனால் இன்னும் மதிப்பு ஒதுக்கப்படவில்லை.

source: In your program, no object with the name `{var_name}` exists.
ru: В вашей программе не существует объекта с именем `{var_name}`.
ta: உங்கள் திட்டத்தில், `{var_name}` என்ற பெயரில் எந்தப் பொருளும் இல்லை.

source: Did you use a colon instead of an equal sign?
ru: Вы использовали двоеточие вместо знака равенства?
ta: சம அடையாளத்திற்குப் பதிலாக முக்காற்புள்ளியைப் பயன்படுத்தினீர்களா?

source: Did you mean `1j`?
ru: Вы имеете в виду `1j`?
ta: `1j` என்று சொன்னீர்களா?

source: However, sometimes `{name}` is intended to represent the square root of `-1` which is written as `1j` in Python.
ru: Однако иногда `{name}` предназначена для обозначения квадратного корня из `-1`, который в Python записывается как `1j`.
ta: இருப்பினும், சில நேரங்களில் `{name}` என்பது பைத்தானில் `1j` என எழுதப்பட்ட `-1` இன் வர்க்க மூலத்தைக் குறிக்கும்.

source: Did you mean `{word}`?
ru: Вы имели в виду `{word}`?

source: I suspect you meant to write the keyword `{word}` and made a typo.
ru: Подозреваю, что ключевое слово `{word}` вы написали по ошибке.

source: `__debug__` is a constant.
ru: `__debug__` является константой.
ta: `__debug__` என்பது மாறிலி.

source: `__debug__` is a constant that cannot be deleted. In future Python versions, attempting to delete it will be a SyntaxError.
ru: `__debug__` является константой, которую нельзя удалить. В будущих версиях Python попытка удалить ее вызовет SyntaxError.
ta: `__debug__` என்பது நீக்க முடியாத மாறிலி. எதிர்கால பைதான் பதிப்புகளில், அதை நீக்க முயற்சிப்பது தொடரியல் பிழையாக இருக்கும்.

source: You must be a fan of PyConAu!
ru: Вы, должно быть, поклонник PyConAu!
ta: நீங்கள் PyConAu இன் ரசிகராக இருக்க வேண்டும்!

source: I am guessing that you tried to use (one of) the flipfloperators shown during the second Lightning Talk session of PyConAu 2018, but that you forgot to install the module from PyPI. #### Note that it is still a bad idea.
ru: Предполагаю, что вы пытались использовать (один из) flipfloperators показанный во время второй сессии Lightning Talk на PyConAu 2018, но забыли установить модуль из PyPI. #### Обратите внимание, что это по-прежнему плохая идея.
ta: PyConAu 2018 இன் இரண்டாவது மின்னல் பேச்சு அமர்வின் போது காட்டப்பட்ட புரட்டல்இயக்கிகளைப் (ஒன்றைப்) பயன்படுத்த முயற்சித்தீர்கள் என்று நான் நினைக்கிறேன், ஆனால் PyPI இலிருந்து தொகுதியை நிறுவ மறந்துவிட்டீர்கள். #### இது இன்னும் மோசமான எண்ணம் என்பதை நினைவில் கொள்க.

source: Did you forget to import `{name}`?
ru: Вы забыли импортировать `{name}`?
ta: `{name}` இறக்குமதி செய்ய மறந்துவிட்டீர்களா?

source: The name `{name}` is not defined in your program. Perhaps you forgot to import `{lowercase}` which is found in Python's standard library.
ru: Имя `{name}` не определено в вашей программе. Возможно, вы забыли импортировать `{lowercase}`, которое находится в стандартной библиотеке Python.
ta: உங்கள் திட்டத்தில் `{name}` என்ற பெயர் வரையறுக்கப்படவில்லை. பைத்தானின் நிலையான நூலகத்தில் காணப்படும் `{lowercase}` ஐ இறக்குமதி செய்ய மறந்துவிட்டீர்கள்.

source: Note that the name of the module is `{lowercase}` and not `{name}`.
ru: Обратите внимание, что именем модуля является `{lowercase}`, а не `{name}`.
ta: தொகுதியின் பெயர் `{lowercase}` மற்றும் `{name}` அல்ல என்பதை நினைவில் கொள்ளவும்.

source: The similar name `{name}` was found in the local scope.
ru: В локальной области видимости найдено похожее имя `{name}`.
ta: இதேபோன்ற பெயர் `{name}` உள்ளூர் நோக்கத்தில் காணப்பட்டது.

source: The similar name `{name}` was found in the global scope.
ru: Похожее имя `{name}` было найдено в глобальной области видимости.
ta: இதேபோன்ற பெயர் `{name}` உலகளாவிய நோக்கத்தில் காணப்பட்டது.

source: The Python builtin `{name}` has a similar name.
ru: Встроенная функция Python `{name}` имеет аналогичное название.
ta: பைதான் உள்ளமைக்கப்பட்ட `{name}` இதே பெயரைக் கொண்டுள்ளது.

source: Instead of writing `{name}`, perhaps you meant one of the following:
ru: Вместо того, чтобы написать `{name}`, возможно, вы имели в виду следующее:
ta: `{name}` என்று எழுதுவதற்குப் பதிலாக, நீங்கள் பின்வருவனவற்றில் ஒன்றைக் குறிப்பிட்டிருக்கலாம்:

source: * Local scope:
ru: * Локальная область видимости:
ta: * உள்ளூர் நோக்கம்:

source: * Global scope:
ru: * Глобальная область видимости:
ta: * உலகளாவிய நோக்கம்:

source: * Python builtins:
ru: * Встроенные модули Python:
ta: * பைதான் உள்ளமைக்கப்பட்டவைகள்:

source: Did you write `self` at the wrong place?
ru: Вы написали `self` не в том месте?
ta: நீங்கள் தவறான இடத்தில் `self` என்று எழுதினீர்களா?

source: The {scope} object `{obj}` has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}(...` instead of `{unknown_name}(self, ...`.
ru: Объект {scope} `{obj}` имеет атрибут с именем `{unknown_name}`. Возможно, вам следовало написать `self.{unknown_name}(...` вместо `{unknown_name}(self, ...`.
ta: {scope} பொருள் `{obj}` ஆனது `{unknown_name}` என்ற பண்புக்கூறைக் கொண்டுள்ளது. நீங்கள் `{unknown_name}(self, ...` என்பதற்குப் பதிலாக `self.{unknown_name}(...` என்று எழுதியிருக்கலாம்.

source: Did you forget to add `self.`?
ru: Вы забыли добавить `self.`?
ta: `self.` சேர்க்க மறந்துவிட்டீர்களா?

source: A {scope} object, `{obj}`, has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}` instead of `{unknown_name}`.
ru: Объект {scope}, `{obj}`, имеет атрибут с именем `{unknown_name}`. Возможно, вам следовало написать `self.{unknown_name}` вместо `{unknown_name}`.
ta: ஒரு {scope} பொருள், `{obj}`, `{unknown_name}` என்ற பண்புக்கூறைக் கொண்டுள்ளது. ஒருவேளை நீங்கள் `{unknown_name}` என்பதற்குப் பதிலாக `self.{unknown_name}` என்று எழுதியிருக்க வேண்டும்.

source: Did you forget to add `{name}.`?
ru: Вы забыли добавить `{name}.`?
ta: `{name}.` சேர்க்க மறந்துவிட்டீர்களா?

source: The {scope} object `{name}` has an attribute named `{unknown_name}`. Perhaps you should have written `{name}.{unknown_name}` instead of `{unknown_name}`.
ru: Объект {scope} `{name}` имеет атрибут с именем `{unknown_name}`. Возможно, вам следовало написать `{name}.{unknown_name}` вместо `{unknown_name}`.
ta: {scope} பொருள் `{name}` ஆனது `{unknown_name}` என்ற பண்புக்கூறைக் கொண்டுள்ளது. ஒருவேளை நீங்கள் `{unknown_name}` என்பதற்குப் பதிலாக `{name}.{unknown_name}` என்று எழுதியிருக்க வேண்டும்.

source: I suspect that you are trying to connect to a server and that a connection cannot be made. If that is the case, check for typos in the URL and check your internet connectivity.
ru: Предполагаю, что вы пытаетесь подключиться к серверу и что соединение не может быть установлено. Если это так, проверьте, нет ли опечаток в URL-адресе и проверьте подключение к Интернету.
ta: நீங்கள் ஒரு சேவையகத்துடன் இணைக்க முயற்சிக்கிறீர்கள் மற்றும் இணைப்பை உருவாக்க முடியாது என்று நான் சந்தேகிக்கிறேன். அப்படியானால், URL இல் எழுத்துப் பிழைகளைச் சரிபார்த்து, உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும்.

source: Perhaps you need to double the backslash characters.
ru: Возможно, вам нужно удвоить символы обратной косой черты.
ta: ஒருவேளை நீங்கள் பின்சாய்வு எழுத்துகளை இரட்டிப்பாக்க வேண்டும்.

source: I suspect that you wrote a filename or path that contains at least one backslash character, `\`. Python likely interpreted this as indicating the beginning of what is known as an escape sequence. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the filename or path, or replace all single backslash characters, `\`, by double ones: `\\`.
ru: Предполагаю, что вы написали имя файла или путь, который содержит по крайней мере один символ обратной косой черты, `\`. Python, вероятно, интерпретировал это как начало того, что известно как последовательность экранирования. Чтобы решить эту проблему, либо напишите так называемую 'необработанную строку', добавив букву `r` в качестве префикса перед именем файла или путем, либо замените все одинарные символы обратной косой черты `\` на двойные: `\\`.
ta: குறைந்தது ஒரு பின்சாய்வு எழுத்து, `\` உள்ள கோப்புப் பெயர் அல்லது பாதையை நீங்கள் எழுதியிருக்கிறீர்கள் என்று நான் சந்தேகிக்கிறேன். தப்பிக்கும் வரிசை என அறியப்படுவதன் தொடக்கத்தைக் குறிப்பதாக பைதான் இதை விளக்கியிருக்கலாம். சிக்கலைத் தீர்க்க, கோப்புப் பெயர் அல்லது பாதையின் முன் முன்னொட்டாக `r` என்ற எழுத்தைச் சேர்ப்பதன் மூலம் 'மூல சரம்' என அழைக்கப்படுவதை எழுதுங்கள் அல்லது அனைத்து ஒற்றை பின்சாய்வு எழுத்துகளான `\`, இரட்டை எழுத்துக்களால் மாற்றவும்: `\\`.

source: While you were iterating over the items of `{name}` ({container_type}) in a `{for_while}` loop, you either tried to add or remove items from it. Suggestion: start by making a copy of `{name}` and iterate over the items of that copy if you want to change `{name}` inside a loop. You might want to do this as follows: my_{name} = {name}.copy() for item in my_{name}: # Change {name}
ru: Пока вы перебирали элементы `{name}` ({container_type}) в цикле `{for_while}`, вы пытались добавить или удалить элементы из него. Предложение: начните с создания копии `{name}` и выполняйте итерации по элементам этой копии, если вы хотите изменить `{name}` внутри цикла. Возможно, вы захотите сделать это следующим образом: my_{name} = {name}.copy() for item in my_{name}: # Изменить {name}
ta: `{for_while}` சுழலில் `{name}` ({container_type}) உருப்படிகளை மீண்டும் மீண்டும் செய்துகொண்டிருந்தீர்கள், அதிலிருந்து உருப்படிகளைச் சேர்க்க அல்லது அகற்ற முயற்சித்தீர்கள். பரிந்துரை: `{name}` இன் நகலை உருவாக்கி, சுழலில் `{name}` ஐ மாற்ற விரும்பினால், அந்த நகலின் உருப்படிகளை மீண்டும் செய்யவும். இதை நீங்கள் பின்வருமாறு செய்ய விரும்பலாம்: எனது_{name} = {name}.copy() for item in எனது_{name}: # {name} இதனை மாற்றவும்
