Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: While you were iterating over the items of a container ({container_type}) in a `{for_while}` loop, you either tried to add or remove items from it. Suggestion: start by making a copy of the container and iterate over the items of that copy if you want to change that container inside a loop.
ru: Во время перебора элементов контейнера ({container_type}) в цикле `{for_while}`, вы пытались либо добавить, либо удалить элементы из него. Предложение: начните с создания копии контейнера и выполняйте итерации над элементами этой копии, если вы хотите изменить контейнер внутри цикла.
ta: `{for_while}` சுழலில் உள்ள ஒரு கொள்கலனின் ({container_type}) உருப்படிகளை மீண்டும் மீண்டும் செய்துகொண்டிருந்தீர்கள், அதிலிருந்து உருப்படிகளைச் சேர்க்க அல்லது அகற்ற முயற்சித்தீர்கள். பரிந்துரை: கொள்கலனின் நகலை உருவாக்குவதன் மூலம் தொடங்கவும், அந்த கொள்கலனை ஒரு சுழலுகுள் மாற்ற விரும்பினால், அந்த நகலின் உருப்படிகளை மீண்டும் செய்யவும்.

source: Did you forget to convert the string `{name}` into {number_type}?
ru: Вы забыли преобразовать строку `{name}` в {number_type}?
ta: `{name}` சரத்தை {number_type} ஆக மாற்ற மறந்துவிட்டீர்களா?

source: Perhaps you forgot to convert the string `{name}` into {number_type}.
ru: Возможно, вы забыли преобразовать строку `{name}` в {number_type}.
ta: ஒருவேளை நீங்கள் `{name}` சரத்தை {number_type} ஆக மாற்ற மறந்துவிட்டீர்கள்.

source: The arguments of `divmod` must be integers (`int`) or real (`float`) numbers.
ru: Аргументы `divmod` должны быть целыми (`int`) или вещественными (`float`) числами.

source: At least one of the arguments was a complex number.
ru: По крайней мере один из аргументов был комплексным числом.

source: The second argument of the function `getattr()` must be a string.
ru: Второй аргумент функции `getattr()` должен быть строкой.
ta: `getattr()` செயல்பாட்டின் இரண்டாவது வாதம் ஒரு சரமாக இருக்க வேண்டும்.

source: The second argument of the function `hasattr()` must be a string.
ru: Второй аргумент функции `hasattr()` должен быть строкой.
ta: `hasattr()` செயல்பாட்டின் இரண்டாவது வாதம் ஒரு சரமாக இருக்க வேண்டும்.

source: You tried to concatenate (add) two different types of objects: {first} and {second}.
ru: Вы попытались обьединить (сложить) два разных типа объектов: {first} и {second}.
ta: நீங்கள் இரண்டு வெவ்வேறு வகையான பொருட்களை இணைக்க (சேர்க்க) முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to add two incompatible types of objects: {first} and {second}.
ru: Вы попытались сложить два несовместимых типа объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைச் சேர்க்க முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to subtract two incompatible types of objects: {first} and {second}.
ru: Вы попытались вычесть два несовместимых типа объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருள்களைக் கழிக்க முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to multiply two incompatible types of objects: {first} and {second}.
ru: Вы попытались перемножить два несовместимых типа объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைப் பெருக்க முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to divide two incompatible types of objects: {first} and {second}.
ru: Вы попытались разделить два несовместимых типа объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைப் வகுக்க முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to perform the bitwise operation {operator} on two incompatible types of objects: {first} and {second}.
ru: Вы попытались выполнить побитовую операцию {operator} над двумя несовместимыми типами объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைப் இருமஇலக்கபடி செயல்பாட்டை {operator} செய்ய முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: Did you mean `{line}`?
ru: Вы имели в виду `{line}`?
ta: `{line}` என்று சொன்னீர்களா?

source: Outside of Python, `^` is often used to indicate exponentiation.
ru: Вне Python `^` часто используется для обозначения возведения в степень.
ta: பைத்தானுக்கு வெளியே, `^` என்பது அடிக்கடி அதிவேகத்தைக் குறிக்கப் பயன்படுகிறது.

source: Perhaps you meant `{line}`.
ru: Возможно, вы имели в виду `{line}`.
ta: ஒருவேளை நீங்கள் `{line}` என்று சொன்னீர்களா.

source: You tried to perform the bit shifting operation {operator} on two incompatible types of objects: {first} and {second}.
ru: Вы попытались выполнить операцию сдвига битов {operator} на двух несовместимых типах объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருள்களில் இருமிலக்க நகர்த்தி இயக்கி {operator} செய்ய முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to exponentiate (raise to a power) using two incompatible types of objects: {first} and {second}.
ru: Вы попытались экспоненцировать (возвести в степень) используя два несовместимых типа объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைப் பயன்படுத்தி, அடுக்குக்கு விரிவுபடுத்த (ஒரு அடுக்குக்கு உயர்த்த) முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: You tried to use the operator {operator} using two incompatible types of objects: {first} and {second}. This operator is normally used only for multiplication of matrices.
ru: Вы попытались использовать оператор {operator} используя два несовместимых типа объектов: {first} и {second}. Этот оператор обычно используется только для умножения матриц.
ta: பொருந்தாத இரண்டு வகையான பொருட்களைப் பயன்படுத்தி இயக்கியை {operator} பயன்படுத்த முயற்சித்தீர்கள்: {first} மற்றும் {second}. இந்த இயக்கி பொதுவாக அணிகளை பெருக்க மட்டுமே பயன்படுத்தப்படுகிறது.

source: Complex numbers cannot be ordered.
ru: Комплексные числа не могут быть упорядочены.
ta: சிக்கலெண்களை வரிசையாக அடுக்க முடியாது.

source: You tried to do an order comparison ({operator}) between two complex numbers.
ru: Вы попытались выполнить порядковое сравнение ({operator}) двух комплексных чисел.
ta: இரண்டு சிக்கலெண்களுக்கு இடையே வரிசை ஒப்பீடு ({operator}) செய்ய முயற்சித்தீர்கள்.

source: You tried to do an order comparison ({operator}) between two incompatible types of objects: {first} and {second}.
ru: Вы попытались выполнить порядковое сравнение ({operator}) двух несовместимых типов объектов: {first} и {second}.
ta: பொருந்தாத இரண்டு வகையான பொருள்களுக்கு இடையே ({operator}) வரிசை ஒப்பீடு செய்ய முயற்சித்தீர்கள்: {first} மற்றும் {second}.

source: Perhaps you meant to write `{operator}=` instead of `={operator}`
ru: Возможно, вы хотели написать `{operator}=` вместо `={operator}`
ta: ஒருவேளை நீங்கள் `={operator}` என்பதற்குப் பதிலாக `{operator}=` என்று எழுத நினைத்திருக்கலாம்

source: You tried to use the unary operator '{operator}' with the following type of object: {obj}. This operation is not defined for this type of object.
ru: Вы попытались использовать унарный оператор '{operator}' со следующим типом объекта: {obj}. Эта операция не определена для данного типа объекта.
ta: பின்வரும் வகை பொருளுடன் '{operator}' unary இயக்கியைப் பயன்படுத்த முயற்சித்தீர்கள்: {obj}. இந்த வகையான பொருளுக்கு இந்த செயல்பாடு வரையறுக்கப்படவில்லை.

source: In Python, some objects are known as immutable: once defined, their value cannot be changed. You tried change part of such an immutable object: {obj}, most likely by using an indexing operation.
ru: В Python некоторые объекты известны как неизменяемые, после определения их значение не может быть изменено. Вы можете изменить часть такого неизменяемого объекта: {obj}, скорее всего, с помощью операции индексирования
ta: பைத்தானில், சில பொருள்கள் மாறாதவை என்று அறியப்படுகின்றன: ஒருமுறை வரையறுக்கப்பட்டால், அவற்றின் மதிப்பை மாற்ற முடியாது. அத்தகைய ஒரு மாறாத பொருளின் பகுதியை மாற்ற முயற்சித்தீர்கள்: {obj}, பெரும்பாலும் அட்டவணைப்படுத்தல் செயல்பாட்டைப் பயன்படுத்தி.

source: Did you mean to use a list?
ru: Вы хотели использовать список?
ta: பட்டியலைப் பயன்படுத்த விரும்புகிறீர்களா?

source: Perhaps you meant to use a list instead.
ru: Возможно, вы хотели использовать список.
ta: அதற்குப் பதிலாகப் பட்டியலைப் பயன்படுத்த நினைத்திருக்கலாம்.

source: In Python 3, exceptions must be derived from BaseException.
ru: В Python 3 исключения должны быть производными от BaseException.
ta: பைதான் 3 இல், விதிவிலக்குகள் BaseException இலிருந்து பெறப்பட வேண்டும்.

source: You apparently have called the function `{fn_name}` with {nb_given} positional argument(s) while it requires {nb_required} such positional argument(s).
ru: Вы, очевидно, вызвали функцию `{fn_name}` с {nb_given} позиционным аргументом(ами), в то время как она требует позиционный(е) аргумент(ы) {nb_required}
ta: நீங்கள் {nb_given} நிலை வாதம்(கள்) உடன் `{fn_name}` செயல்பாட்டை அழைத்திருக்கிறீர்கள் அதற்கு {nb_required} போன்ற நிலை வாதம்(கள்) தேவைப்படும்.

source: Perhaps you forgot `self` when defining `{fn_name}`.
ru: Возможно, вы забыли `self` при обьявлении `{fn_name}`.
ta: `{fn_name}` என்பதை வரையறுக்கும்போது `self` என்பதை மறந்துவிட்டீர்கள்.

source: You apparently have called the function '{fn_name}' with fewer positional arguments than it requires ({nb_required} missing).
ru: Видимо, вы вызвали функцию '{fn_name}' с меньшим количеством позиционных аргументов, чем требуется ({nb_required} missing).
ta: '{fn_name}' செயல்பாட்டிற்குத் தேவையானதை விட குறைவான நிலை வாதங்களுடன் ({nb_required} இல்லை) என்று நீங்கள் அழைத்திருக்கிறீர்கள்.

source: Note: `NoneType` means that the object has a value of `None`.
ru: Примечание: `NoneType` означает, что объект имеет значение `None`.
ta: குறிப்பு: `NoneType` என்பது பொருளுக்கு `None` என்ற மதிப்பு உள்ளது.

source: Python indicates that you have an object of type `{obj_type}`, followed by something surrounded by parentheses, `(...)`, which Python took as an indication of a function call. Either the object of type `{obj_type}` was meant to be a function, or you forgot a comma before `(...)`.
ru: Python указывает, что у вас есть объект типа `{obj_type}`, за которым следует нечто, окруженное круглыми скобками, `(...)`, что Python воспринял как указание на вызов функции. Либо объект типа `{obj_type}` должен был быть функцией, либо вы забыли поставить запятую перед `(...)`.
ta: நீங்கள் `{obj_type}` வகைப் பொருளை வைத்திருப்பதை பைதான் குறிக்கிறது, அதைத் தொடர்ந்து அடைப்புக்குறிகளால் சூழப்பட்டது `(...)`, இது ஒரு செயல்பாட்டு அழைப்பின் அடையாளமாக பைதான் எடுத்தது. வகையின் பொருள் `{obj_type}` ஒரு செயல்பாடாக இருக்க வேண்டும் அல்லது `(...)` க்கு முன் காற்புள்ளியை மறந்துவிட்டீர்கள்.

source: The parenthesis `()` following `{obj_name}` are interpreted by Python as a function call for `{obj_name}`. However, `{obj_name}` is not a function but an object of type `{obj_type}`.
ru: Круглые скобки `()`, следующие за `{obj_name}`, интерпретируются Python как вызов функции для `{obj_name}`. Однако `{obj_name}` -- это не функция, а объект типа `{obj_type}`.
ta: `{obj_name}` என்பதற்குப் பின் வரும் `()` அடைப்புக்குறியானது `{obj_name}`க்கான செயல்பாட்டு அழைப்பாக பைத்தானால் விளக்கப்படுகிறது. இருப்பினும், `{obj_name}` என்பது ஒரு செயல்பாடு அல்ல, மாறாக `{obj_type}` வகையின் பொருள்.

source: Because of the surrounding parenthesis, `{fn_call}` is interpreted by Python as indicating a function call for `{obj_name}`, which is an object of type `{obj_type}` which cannot be called.
ru: Из-за окружающих скобок, `{fn_call}` интерпретируется Python как вызов функции для `{obj_name}`, которая является объектом типа `{obj_type}` который не может быть вызван.
ta: சுற்றியுள்ள அடைப்புக்குறியின் காரணமாக, `{fn_call}` என்பது `{obj_name}` க்கான செயல்பாட்டு அழைப்பைக் குறிக்கும் என பைத்தானால் விளக்கப்படுகிறது, இது `{obj_type}` வகையின் ஒரு பொருளாகும், இது அழைக்கப்பட முடியாது.

source: However, `{fn_call}` is a `tuple`. Either the object `{obj_name}` was meant to be a function or you have a missing comma between the object `{obj_name}` and the tuple `{fn_call}` and meant to write `{obj_name}, {fn_call}`.
ru: `{fn_call}` -- это `tuple`. Либо объект `{obj_name}` должен был быть функцией либо пропущена запятая между объектом `{obj_name}` и кортежем `{fn_call}` и вы хотели написать `{obj_name}, {fn_call}`.
ta: இருப்பினும், `{fn_call}` என்பது `மடங்கு`. பொருள் `{obj_name}` ஒரு செயல்பாடாக இருக்க வேண்டும் அல்லது `{obj_name}` மற்றும் மடங்குக்கும் `{fn_call}` ஆகியவற்றுக்கு இடையே ஒரு காற்புள்ளி விடுபட்டுள்ளது மற்றும் இவ்வாறு எழுத நினைத்தீர்களா `{obj_name}, {fn_call}`.

source: Did you forget a comma between `{obj_name}` and `{fn_call}`?
ru: Вы забыли запятую между `{obj_name}` и `{fn_call}`?
ta: `{obj_name}` மற்றும் `{fn_call}` இடையே உள்ள காற்புள்ளியை மறந்துவிட்டீர்களா?

source: However, `{obj_name}` is a sequence. Perhaps you meant to use `[]` instead of `()` and write `{obj_name}[{slice}]`
ru: `{obj_name}` -- это последовательность. Возможно, вы хотели использовать `[]` вместо `()` и написать `{obj_name}[{slice}]`
ta: இருப்பினும், `{obj_name}` என்பது ஒரு வரிசை. ஒருவேளை நீங்கள் `()` என்பதற்குப் பதிலாக `[]` ஐப் பயன்படுத்தி `{obj_name}[{slice}]` என்று எழுதலாம்

source: Did you mean `{obj_name}[{slice}]`?
ru: Вы имели в виду `{obj_name}[{slice}]`?
ta: `{obj_name}[{slice}]` என்பதை நீங்கள் குறிப்பிடுகிறீர்களா?

source: However, both `{obj_name}` and `{fn_call}` are numbers. Perhaps you forgot a multiplication operator, `*`, and meant to write `{obj_name} * {fn_call}`.
ru: `{obj_name}`, и `{fn_call}` являются числами. Возможно, вы забыли оператор умножения `*` и хотели написать `{obj_name} * {fn_call}`.
ta: இருப்பினும், `{obj_name}` மற்றும் `{fn_call}` இரண்டும் எண்கள். ஒருவேளை நீங்கள் பெருக்கல் இயக்கியான `*` ஐ மறந்துவிட்டீர்கள், மேலும் `{obj_name} * {fn_call}` என்று எழுத நினைத்திருக்கலாம்.

source: Did you mean `{obj_name} * {fn_call}`?
ru: Вы имели в виду `{obj_name} * {fn_call}`?
ta: `{obj_name} * {fn_call}` எனக் குறிப்பிடுகிறீர்களா?

source: Did you forget to convert `{name}` into an integer?
ru: Вы забыли преобразовать `{name}` в целое число?
ta: `{name}`ஐ முழு எண்ணாக மாற்ற மறந்துவிட்டீர்களா?

source: Perhaps you forgot to convert `{name}` into an integer.
ru: Возможно, вы забыли преобразовать `{name}` в целое число.
ta: ஒருவேளை நீங்கள் `{name}` ஐ முழு எண்ணாக மாற்ற மறந்துவிட்டீர்கள்.

source: You can only multiply sequences, such as list, tuples, strings, etc., by integers.
ru: Вы можете умножать только последовательности, такие как список, кортежи, строки и т.д., на целые числа.
ta: பட்டியல், மடங்குகள், சரங்கள், போன்ற., தொடர்களை மட்டுமே முழு எண்களால் பெருக்க முடியும்.

source: Did you forget to convert `{name1}` and `{name2}` into integers?
ru: Вы забыли преобразовать `{name1}` и `{name2}` в целые числа?
ta: `{name1}` மற்றும் `{name2}` ஆகியவற்றை முழு எண்களாக மாற்ற மறந்துவிட்டீர்களா?

source: Perhaps you forgot to convert `{name1}` and `{name2}` into integers.
ru: Возможно вы забыли преобразовать `{name1}` и `{name2}` в целые числа.
ta: ஒருவேளை நீங்கள் `{name1}` மற்றும் `{name2}` ஐ முழு எண்களாக மாற்ற மறந்து இருக்கலாம்.

source: You wrote an object whose value is `None` where an integer was expected.
ru: Вы записали объект, значение которого `None`, а ожидалось целое число.
ta: ஒரு முழு எண் எதிர்பார்க்கப்படும் இடத்தில் `None` என்ற பொருளை நீங்கள் எழுதியுள்ளீர்கள்.

source: You wrote an object of type `{obj}` where an integer was expected.
ru: Вы записали объект типа `{obj}`, где ожидалось целочисленное значение.
ta: முழு எண் எதிர்பார்க்கப்படும் `{obj}` வகைப் பொருளை நீங்கள் எழுதியுள்ளீர்கள்.

source: Did you forget to convert `{names}` into integers?
ru: Вы забыли преобразовать `{names}` в целые числа?
ta: `{names}` முழு எண்களாக மாற்ற மறந்துவிட்டீர்களா?

source: Perhaps you forgot to convert `{names}` into integers.
ru: Возможно, вы забыли преобразовать `{names}` в целые числа.
ta: ஒருவேளை நீங்கள் `{names}` ஐ முழு எண்களாக மாற்ற மறந்துவிட்டீர்கள்.

source: In the expression `{line}` what is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
ru: В выражении `{line}` то, что включено между квадратными скобками, `[...]`, должно быть либо целым числом, либо фрагментом (`start:stop` или `start:stop:step`) а вы вместо этого использовали {obj_type}.
ta: `{line}` வெளிப்பாட்டில், சதுர அடைப்புக்குறிகளுக்கு இடையே உள்ளவை, `[...]`, ஒரு முழு எண் அல்லது துண்டாக இருக்க வேண்டும் (`தொடக்கம்:நிறுத்து` அல்லது `தொடக்கம்:நிறுத்தம்:படி`) மற்றும் உங்களிடம் உள்ளது அதற்குப் பதிலாக {obj_type} பயன்படுத்தப்பட்டது.

source: Note: sometimes this exception is raised because what Python interprets as indices was meant to be a separate list, and a comma should have been written before the opening `[` of that list.
ru: Примечание: иногда это исключение возникает потому, что то, что Python интерпретирует как индексы, должно было быть отдельным списком, и запятая должна была быть поставлена перед открывающей `[` этого списка.
ta: குறிப்பு: சில நேரங்களில் இந்த விதிவிலக்கு எழுப்பப்படுகிறது, ஏனெனில் பைதான் குறியீடுகளாக விளக்குவது ஒரு தனி பட்டியலாக இருக்க வேண்டும், மேலும் அந்த பட்டியலின் `[` திறப்பதற்கு முன் காற்புள்ளி எழுதப்பட்டிருக்க வேண்டும்.

source: Did you forget a comma?
ru: Вы забыли поставить запятую?
ta: காற்புள்ளியை மறந்துவிட்டீர்களா?

source: Perhaps you have forgotten a comma between two identical lists `{container}`. The second list had been interpreted as the indexation of the first one by the index `{new_index}`
ru: Возможно, вы забыли поставить запятую между двумя одинаковыми списками `{container}`. Второй список был интерпретирован как индексация первого по индексу `{new_index}`.
ta: ஒரே மாதிரியான இரண்டு பட்டியல்களுக்கு இடையே உள்ள காற்புள்ளியை நீங்கள் மறந்துவிட்டீர்கள் `{container}`. இரண்டாவது பட்டியல் `{new_index}` குறியீட்டின் மூலம் முதல் ஒன்றின் அட்டவணையாக விளக்கப்பட்டது

source: Perhaps you have forgotten a comma between the object `{container}` and the list `{index}`. The list `{index}` had been interpreted as the indexation of object `{container}` by the index `{new_index}`
ru: Возможно, вы забыли разделить запятой обьекты `{container}` и список `{index}`.Список `{index}` был интерпретирован как индексация объекта `{container}` по индексу `{new_index}`.
ta: ஒருவேளை நீங்கள் பொருள் `{container}` மற்றும் பட்டியலான `{index}` இடையே ஒரு காற்புள்ளியை மறந்துவிட்டீர்கள். `{index}` என்ற பட்டியல், பொருளின் `{container}` குறியீட்டின் `{new_index}` குறியீட்டால் விளக்கப்பட்டது

source: Did you forget a comma before `{index}`?
ru: Вы забыли поставить запятую перед `{index}`?
ta: `{index}`க்கு முன் காற்புள்ளியை மறந்துவிட்டீர்களா?

source: When using a slice to extract a range of elements from a sequence, that is something like `[start:stop]` or `[start:stop:step]` each of `start`, `stop`, `step` must be either an integer, `None`, or possibly some other object having an `__index__` method.
ru: При использовании среза для извлечения диапазона элементов из последовательности, то есть что-то вроде `[start:stop]` или `[start:stop:step]`. каждый из `start`, `stop`, `step` должен быть либо целым числом, либо `None`, либо каким-то другим объектом, имеющим метод `__index__`.
ta: ஒரு வரிசையிலிருந்து உறுப்புகளின் வரம்பைப் பிரித்தெடுக்க ஒரு துண்டைப் பயன்படுத்தும்போது, அது `[தொடக்கம்:நிறுத்து]` அல்லது `[தொடக்கம்:நிறுத்தம்:படி]` ஒவ்வொரு `தொடக்கம்`, `நிறுத்தம்`, `படி` போன்றவை ஒரு முழு எண்ணாக இருக்க வேண்டும், `None` அல்லது `__index__` முறையைக் கொண்ட வேறு ஏதேனும் பொருள் இருக்கலாம்.

source: Only hashable objects can be used as elements of `set` or keys of `dict`. Hashable objects are objects that do not change value once they have been created.
ru: Только хешируемые объекты могут быть использованы в качестве элементов `set` или ключей `dict`. Хешируемые объекты - это объекты, которые не меняют своего значения после их создания.
ta: புலபடகூடிய பொருட்களை மட்டுமே `தொகுப்பு` இன் உறுப்புகளாக அல்லது `அகராதி` இன் திறவுகோல்களாகப் பயன்படுத்த முடியும். புலபடகூடிய பொருள்கள், அவை உருவாக்கப்பட்டவுடன் மதிப்பை மாற்றாத பொருள்கள்.

source: Instead of using {original}, consider using {replacement}.
ru: Вместо {original} используйте {replacement}.
ta: {original} ஐப் பயன்படுத்துவதற்குப் பதிலாக, {replacement} ஐப் பயன்படுத்தவும்.

source: Subscriptable objects are typically containers from which you can retrieve item using the notation `[...]`.
ru: Subscriptable objects обычно являются контейнерами, из которых вы можете получить элемент, используя нотацию `[...]`.
ta: சந்தா பெறக்கூடிய பொருள்கள் பொதுவாக கொள்கலன்களாகும், அதில் இருந்து நீங்கள் `[...]` குறியீட்டைப் பயன்படுத்தி உருப்படியை மீட்டெடுக்கலாம்.

source: Using this notation, you attempted to retrieve an item from an object of type `{obj_type}` which is not allowed.
ru: Используя эту нотацию, вы попытались получить элемент из объекта типа `{obj_type}`, что недопустимо.
ta: இந்தக் குறியீட்டைப் பயன்படுத்தி, அனுமதிக்கப்படாத `{obj_type}` வகைப் பொருளிலிருந்து ஒரு பொருளை மீட்டெடுக்க முயற்சித்தீர்கள்.

source: Perhaps you meant to write `{line}`.
ru: Возможно, вы хотели написать `{line}`.
ta: ஒருவேளை நீங்கள் `{line}` என்று எழுத நினைத்திருக்கலாம்.

source: Using this notation, you attempted to retrieve an item from `{name}`, an object of type `{obj_type}`. This is not allowed.
ru: Используя эту нотацию, вы попытались получить элемент из `{name}`, объекта типа `{obj_type}`. Это недопустимо.
ta: இந்தக் குறியீட்டைப் பயன்படுத்தி, `{obj_type}` வகைப் பொருளான `{name}` இலிருந்து ஒரு பொருளை மீட்டெடுக்க முயற்சித்தீர்கள். இதற்கு அனுமதி இல்லை.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. '{obj_name}' is not a container. A container is required here.
ru: Итерабельность - это объект, способный возвращать свои члены по одному за раз. Контейнеры Python (`list, tuple, dict` и т.д.) являются итерабельными. '{obj_name}' не является контейнером. Здесь требуется контейнер.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. An iterable is required here.
ru: Итерабельным является обьект, способный возвращать свои элементы по одному за раз. Контейнеры Python (`list, tuple, dict` и т.д.) являются итерабельными.
ta: மறுசெய்யக்கூடியவை என்பது அதன் உறுப்பினர்களை ஒரு நேரத்தில் திருப்பி அனுப்பும் திறன் கொண்ட ஒரு பொருள். பைதான் கொள்கலன்கள் (`பட்டியல், மடங்கு, அகராதி`, முதலியன.) மறுசெய்யக்கூடியவை. இங்கே ஒரு மறுசெய்யக்கூடியவை தேவைப்படுகிறது.

source: Unpacking is a convenient way to assign a name, to each item of an iterable.
ru: Распаковка является удобным способом присвоить имя каждому элементу итерирумого обьекта.
ta: கட்டவிழ் என்பது, மறுசெய்யக்கூடிய ஒவ்வொரு பொருளுக்கும் ஒரு பெயரை ஒதுக்க ஒரு வசதியான வழியாகும்.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables, but not objects of type `{obj_type}`.
ru: Итерабельным является объект, способный возвращать свои элементы по одному за раз. Контейнеры Python (`list, tuple, dict` и т.д.) являются итерабельными, но не объекты типа `{obj_type}`.
ta: மறுசெய்யக்கூடியவை என்பது அதன் உறுப்பினர்களை ஒரு நேரத்தில் திருப்பி அனுப்பும் திறன் கொண்ட ஒரு பொருள். பைதான் கொள்கலன்கள் (`பட்டியல், மடங்கு, அகராதி`, முதலியன.) மறுசெய்யக்கூடியவை, ஆனால் `{obj_type}` வகைப் பொருள்கள் அல்ல.

source: {function} does not accept a sequence as an argument. Instead of writing `{line}` perhaps you should use the `dict.fromkeys()` method: `{new_line}`.
ru: {function} не принимает последовательность в качестве аргумента. Вместо того, чтобы писать `{line}` возможно, следует использовать метод `dict.fromkeys()`: `{new_line}`.
ta: {function} ஒரு வரிசையை ஒரு வாதமாக ஏற்கவில்லை. `{line}` என்று எழுதுவதற்குப் பதிலாக நீங்கள் `dict.fromkeys()` முறையைப் பயன்படுத்த வேண்டும்: `{new_line}`.

source: Perhaps you need to use the `dict.fromkeys()` method.
ru: Возможно, вам следует использовать метод `dict.fromkeys()`.
ta: ஒருவேளை நீங்கள் `dict.fromkeys()` முறையைப் பயன்படுத்த வேண்டும்.

source: Did you forget to call `{name}`?
ru: Вы забыли вызвать `{name}`?
ta: `{name}` என்பதை அழைக்க மறந்துவிட்டீர்களா?
