Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: The file {filename} does not exist.
ru: Файл {filename} не найден.
ta: கோப்பு {filename} வட்டில் இல்லை.

source: Warning issued on line `{line}` of code block {filename}.
ru: Исключение возникло в строке `{line}` блока кода {filename}.

source: Warning issued on line `{line}` of file '{filename}'.
ru: Исключение возникло в строке `{line}` файла '{filename}'.

source: I have no suggestion to offer.
ru: Не могу ничего предложить.
ta: நான் வழங்க எந்த பரிந்துரையும் இல்லை.

source: I have no suggestion to offer; try `why()`.
ru: У меня нет предложений, попробуйте `why()`.
ta: நான் வழங்க எந்த ஆலோசனையும் இல்லை; `why()` முயற்சிக்கவும்.

source: Are you using a regular Python console instead of a Friendly console? If so, to continue, try: `start_console(local_vars=locals())`. You will need to import `start_console` if you have not already done so.
ru: Вы используете консоль интерпретатора Python вместо консоли Friendly? Если да, то для продолжения попробуйте: start_console(local_vars=locals())`. Вам нужно будет импортировать `start_console`, если вы еще этого не сделали.
ta: நீங்கள் நட்பு பணியகத்துக்குப் பதிலாக வழக்கமான பைதான் பணியகத்தைப் பயன்படுத்துகிறீர்களா? அப்படியானால், தொடர, முயற்சிக்கவும்: `start_console(local_vars=locals())`. நீங்கள் ஏற்கனவே அவ்வாறு செய்யவில்லை என்றால், `start_console` ஐ இறக்குமதி செய்ய வேண்டும்.

source: Nothing to show: no exception recorded.
ru: Показать нечего: исключений не зарегистрировано.
ta: காட்ட எதுவும் இல்லை: விதிவிலக்கு பதிவு செய்யப்படவில்லை.

source: An exception occurred before friendly-traceback was imported. Some information is available.
ru: Исключение произошло до того, как friendly-traceback был импортирован. Некоторая информация всё же имеется.
ta: friendly-traceback இறக்குமதி செய்யப்படுவதற்கு முன்பு ஒரு விதிவிலக்கு ஏற்பட்டது. சில தகவல்கள் கிடைக்கின்றன.

source: Nothing to go back to: no exception recorded.
ru: Возвращаться не к чему: исключений не зарегистрировано.
ta: திரும்பிச் செல்வதற்கு எதுவும் இல்லை: விதிவிலக்கு பதிவு செய்யப்படவில்லை.

source: {exception} is not an exception.
ru: {exception} не является исключением.
ta: {exception} என்பது விதிவிலக்கல்ல.

source: Invalid argument for `www()`. Valid arguments include `None` or one of `{sites}`.
ru: Недопустимый аргумент для `www()`. Допустимые аргументы включают `None` или один из `{sites}`.
ta: `www()` க்கான தவறான மதிப்புரு. செல்லுபடியாகும் வாதங்களில் `None` அல்லது `{sites}`இல் ஒன்று அடங்கும்.

source: The default web browser cannot be used for searching.
ru: Веб-браузер по умолчанию не может быть использован для поиска.
ta: தேடலுக்கு இயல்புநிலை இணைய உலாவியைப் பயன்படுத்த முடியாது.

source: The following methods of the Friendly object should also be available as functions.
ru: Следующие методы объекта Friendly также должны быть доступны как функции.
ta: நட்பு பொருளின் பின்வரும் முறைகள் செயல்பாடுகளாகவும் இருக்க வேண்டும்.

source: More lines not shown.
ru: Другие строки не показаны.
ta: மேலும் வரிகள் காட்டப்படவில்லை.

source: Python exception:
ru: Исключение Python:
ta: பைதான் விதிவிலக்கு:

source: Warning: improperly formed exception. I suspect that a custom exception has been raised with a non-string value used as a message. This can occur if a `__repr__` or a `__str__` method raises an exception or does not return a string.
ru: Warning: некорректно сформированное исключение. Полагаю, что было вызвано пользовательское исключение в котором в качестве сообщения используется нестроковое значение. Это может произойти, если метод `__repr__` или `__str__` вызывает исключение или не возвращает строку.
ta: முன்னறிவிப்பு: முறையற்ற விதிவிலக்கு. ஒரு சரம் அல்லாத மதிப்பை செய்தியாகப் பயன்படுத்தி ஒரு தனிப்பயன் விதிவிலக்கு எழுப்பப்பட்டதாக நான் சந்தேகிக்கிறேன். `__repr__` அல்லது `__str__` முறை விதிவிலக்கை எழுப்பினால் அல்லது சரத்தை வழங்கவில்லை என்றால் இது நிகழலாம்.

source: The encoding of the file was not valid.
ru: Кодировка файла некорректна.
ta: கோப்பின் குறியாக்கம் தவறானது.

source: {filename} is not a regular Python file whose contents can be analyzed.
ru: {filename} не является стандартным файлом Python, содержимое которого можно проанализировать.
ta: {filename} என்பது வழக்கமான பைதான் கோப்பு அல்ல, அதன் உள்ளடக்கங்களை பகுப்பாய்வு செய்யலாம்.

source: Exception raised on line `{linenumber}` of code block {filename}.
ru: Исключение возникло в строке `{linenumber}` блока кода {filename}.

source: Exception raised on line `{linenumber}` of file '{filename}'.
ru: Исключение возникло в строке `{linenumber}` файла '{filename}'.

source: Execution stopped on line `{linenumber}` of code block {filename}.
ru: Выполнение остановлено на строке `{linenumber}` блока кода '{filename}'.

source: Execution stopped on line `{linenumber}` of file '{filename}'.
ru: Выполнение остановлено на строке `{linenumber}` файла '{filename}'.

source: Code block {filename}, line `{line}`
ru: Блок кода {filename}, строка `{line}`

source: File '{filename}', line `{line}`
ru: Файл '{filename}', строка `{line}`

source: The entire content of `{filename}` is not available.
ru: Содержимое файла `{filename}` недоступно.
ta: `{filename}` இன் முழு உள்ளடக்கமும் கிடைக்கவில்லை.

source: Python could not understand the code in the code block {filename}
ru: Python не смог понять блок кода {filename}
ta: {filename} குறியீட்டுப் பகுதியில் உள்ள குறியீட்டை பைத்தானால் புரிந்து கொள்ள முடியவில்லை

source: Python could not understand the code in the file '{filename}'
ru: Python не смог понять код в файле '{filename}'
ta: '{filename}' கோப்பில் உள்ள குறியீட்டைப் பைத்தானால் புரிந்து கொள்ள முடியவில்லை

source: at the location indicated.
ru: в указанном ^ месте.

source: Unfortunately, no additional information is available: the content of file '<stdin>' is not accessible.
ru: К сожалению, никакой дополнительной информации нет: содержимое файла '<stdin>' недоступно.
ta: எதிர்பாராதவிதமாக, கூடுதல் தகவல்கள் எதுவும் கிடைக்கவில்லை: '<stdin>' ​​கோப்பின் உள்ளடக்கத்தை அணுக முடியாது.

source: Fatal error - aborting
ru: Фатальная ошибка - завершение работы
ta: கொடிய பிழை - கலைக்கிறது

source: Please report this issue.
ru: Пожалуйста, сообщите об этой проблеме.
ta: இந்தச் சிக்கலைப் புகாரளிக்கவும்.

source: Problem: source of `{filename}` is not available
ru: Проблема: источник `{filename}` недоступен
ta: சிக்கல்: `{filename}` இன் ஆதாரம் கிடைக்கவில்லை

source: Type 'Friendly' for help on special functions/methods.
ru: Напечатайте 'Friendly' для получения помощи по специальным функциям/методам.
ta: சிறப்பு செயல்பாடுகள்/முறைகள் பற்றிய உதவிக்கு 'Friendly' என தட்டச்சு செய்யவும்.

source: Please report this example to https://github.com/friendly-traceback/friendly-traceback/issues/new If you are using a REPL, use `www('bug')` to do so.
ru: Пожалуйста, сообщите об этом примере по адресу https://github.com/friendly-traceback/friendly-traceback/issues/new Если вы используете REPL, используйте для этого `www('bug')`.
ta: தயவுசெய்து இந்த உதாரணத்தைப் புகாரளிக்கவும் https://github.com/friendly-traceback/friendly-traceback/issues/new நீங்கள் REPL ஐப் பயன்படுத்தினால், அவ்வாறு செய்ய `www('bug')` ஐப் பயன்படுத்தவும்.

source: Friendly-traceback does not know the cause of this error.
ru: Friendly-traceback не определил причину возникновения этой ошибки.
ta: நட்பு-மீண்டும்கண்டுபிடிக்க Friendly-tracebackக்கு இந்த பிழைக்கான காரணம் தெரியவில்லை.

source: No information is known about this exception.
ru: По этому исключению информации нет.
ta: இந்த விதிவிலக்கு பற்றி எந்த தகவலும் தெரியவில்லை.

source: If you are using the Friendly console, use `www()` to do an Internet search for this particular case.
ru: Если вы используете консоль Friendly, используйте `www()`, чтобы выполнить поиск в Интернете для этого конкретного случая.
ta: நீங்கள் நட்பு பணியகத்தை பயன்படுத்துகிறீர்கள் என்றால், அதற்கு `www()` ஐப் பயன்படுத்தி இந்த குறிப்பிட்ட வழக்கை இணையத்தில் தேடுங்கள்.

source: Internal error for Friendly.
ru: Внутренняя ошибка Friendly.
ta: நட்புக்கு உள் பிழை.

source: Removes the last recorded traceback item.
ru: Удаляет последний записанный элемент трассировки.
ta: கடைசியாகப் பதிவுசெய்யப்பட்ட மீண்டும்கண்டுபிடிக்கும் உருப்படியை நீக்குகிறது.

source: Shows all the information about the last traceback.
ru: Показывает всю информацию по последней трассировке.
ta: கடைசி மீண்டும்கண்டுபிடிப்பு பற்றிய அனைத்து தகவல்களையும் காட்டுகிறது.

source: Shows a list of recorded traceback messages.
ru: Показывает список записанных сообщений трассировки.
ta: பதிவுசெய்யப்பட்ட மீண்டும்கண்டுபிடிக்கும் செய்திகளின் பட்டியலைக் காட்டுகிறது.

source: Sets the language to be used.
ru: Устанавливает используемую локализацию.
ta: பயன்படுத்த வேண்டிய மொழியை அமைக்கிறது.

source: Shows the paths corresponding to synonyms used.
ru: Показывает пути, соответствующие используемым синонимам.
ta: பயன்படுத்தப்படும் ஒத்த சொற்களுடன் தொடர்புடைய பாதைகளைக் காட்டுகிறது.

source: Changes the prompt style to be used in the Friendly console.
ru: Устанавливает стиль подсказки, который будет использоваться в консоли.

source: Shows the generic meaning of a given exception.
ru: Показывает общий смысл данного исключения.
ta: கொடுக்கப்பட்ட விதிவிலக்கின் பொதுவான பொருளைக் காட்டுகிறது.

source: Shows where an exception was raised.
ru: Показывает где возникло исключение.
ta: விதிவிலக்கு எங்கு எழுப்பப்பட்டது என்பதைக் காட்டுகிறது.

source: Shows the likely cause of the exception.
ru: Показывает вероятную причину возникновения исключения.
ta: விதிவிலக்கான சாத்தியமான காரணத்தைக் காட்டுகிறது.

source: Opens a web browser at a useful location.
ru: Открывает веб-браузер на полезной странице.
ta: பயனுள்ள இடத்தில் இணைய உலாவியைத் திறக்கும்.

source: Suggestion sometimes added to a friendly traceback.
ru: Предложение иногда добавляется в трассировку Friendly.
ta: பரிந்துரை சில சமயங்களில் நட்பு மீண்டும்கண்டுபிடிப்பில் சேர்க்கப்படும்.

source: Shows a normal Python traceback.
ru: Показывает обычную трассировку Python.
ta: சாதாரண பைதான் மீண்டும்கண்டுபிடிப்பைக் காட்டுகிறது.

source: Shows a simplified Python traceback.
ru: Показывает упрощенную трассировку Python.
ta: எளிமைப்படுத்தப்பட்ட பைதான் மீண்டும்கண்டுபிடிப்பை காட்டுகிறது.

source: Returns the current value used for items to include by default.
ru: Возвращает текущее значение, используемое для элементов, включаемых по умолчанию.
ta: இயல்புநிலையில் சேர்க்கப்படும் உருப்படிகளுக்குப் பயன்படுத்தப்படும் தற்போதைய மதிப்பை வழங்கும்.

source: Sets the items to show by default when an exception is raised.
ru: Устанавливает элементы, которые будут отображаться по умолчанию при возникновении исключения.
ta: விதிவிலக்கு எழுப்பப்படும்போது, ​​இயல்புநிலையாகக் காண்பிக்க உருப்படிகளை அமைக்கிறது.

source: Returns the language currently used.
ru: Возвращает используемую в данный момент локализацию.
ta: தற்போது பயன்படுத்தப்படும் மொழியை வழங்குகிறது.

source: Sets the formatter to use for display.
ru: Устанавливает форматтер, который будет использоваться для отображения.
ta: காட்சிக்கு பயன்படுத்த வடிவமைப்பை அமைக்கிறது.

source: Use True (default) or False to enable debugging methods.
ru: Используйте True (по умолчанию) или False для включения методов отладки.

source: An exception of type `{name}` is a subclass of `{parent}`.
ru: Исключение типа `{name}` является наследником `{parent}`.
ta: `{name}` வகை விதிவிலக்கு என்பது `{parent}` இன் துணைப்பிரிவாகும்.

source: `ArithmeticError` is the base class for those built-in exceptions that are raised for various arithmetic errors. It is unusual that you are seeing this exception; normally, a more specific exception should have been raised.
ru: `ArithmeticError` является базовым классом для встроенных исключений, которые возникают при различных арифметических ошибках. Странно, что вы видите это исключение, обычно должно вызываться более конкретное исключение.
ta: எண்கணிதப்பிழை `ArithmeticError` என்பது உள்ளமைக்கப்பட்ட விதிவிலக்குகளுக்கான அடிப்படை வகுப்பாகும் பல்வேறு எண்கணிதப் பிழைகளுக்காக எழுப்பப்பட்டவை. இந்த விதிவிலக்கை நீங்கள் பார்ப்பது அசாதாரணமானது; பொதுவாக, ஒரு குறிப்பிட்ட விதிவிலக்கு எழுப்பப்பட்டிருக்க வேண்டும்.

source: In Python, the keyword `assert` is used in statements of the form `assert condition`, to confirm that `condition` is not `False`, nor equivalent to `False` such as an empty list, etc. If `condition` is `False` or equivalent, an `AssertionError` is raised.
ru: В Python ключевое слово `assert` используется в утверждениях типа `assert condition`, чтобы подтвердить, что `condition` не является `False`, или эквивалентно `False`, например, пустой список и т.д. Если `condition` равно `False` или эквивалентно ему, возникает `AssertionError`.
ta: பைத்தானில், நிபந்தனை `condition` என்பது தவறு `False` அல்ல, அல்லது வெற்றுப் பட்டியல் போன்ற தவறு `False` என்பதற்குச் சமமானதாக இல்லை என்பதை உறுதிப்படுத்த, உறுதிப்படுத்துதல் `assert` என்ற முக்கிய சொல் உறுதிப்படுத்தல் நிபந்தனை `assert condition` படிவத்தின் அறிக்கைகளில் பயன்படுத்தப்படுகிறது. நிபந்தனை `condition` என்பது தவறு `False` அல்லது அதற்கு சமமானதாக இருந்தால், உறுதிப்படுத்தல்பிழை `AssertionError` எழுப்பப்படும்.

source: An `AttributeError` occurs when the code contains something like `object.x` and `x` is not a method or attribute (variable) belonging to `object`.
ru: `AttributeError` возникает, когда код содержит что-то вроде `object.x` где `x` не является методом или атрибутом (переменной), принадлежащим `object`.
ta: பின்வரும் குறியீடு போல ஏதாவது இருந்தால் பண்புப்பிழை `AttributeError` ஏற்படுகிறது `object.x` மேலும் `x` என்பது `object`க்கு சொந்தமான ஒரு முறை அல்லது பண்புக்கூறு (மாறி) அல்ல.

source: An `EOFError` is raised when the `input()` function hits an end-of-file condition (EOF) without reading any data.
ru: `EOFError` возникает, когда функция `input()` достигает условия конца файла (EOF) без чтения каких-либо данных.
ta: `input()` செயல்பாடு எந்த தரவையும் படிக்காமல் ஒரு இறுதி கோப்பு நிலை (EOF) படிக்கும்போது இறுதிகோப்புநிலைபிழை `EOFError` எழுப்பப்படுகிறது.

source: A `FileNotFoundError` exception indicates that you are trying to open a file that cannot be found by Python. This could be because you misspelled the name of the file.
ru: `FileNotFoundError` указывает на то, что вы пытаетесь открыть файл, который не может быть найден Python. Это может быть связано с тем, что вы неправильно написали имя файла.
ta: கோப்புகிடைக்கவில்லைபிழை `FileNotFoundError` விதிவிலக்கு நீங்கள் பைத்தானால் கண்டுபிடிக்க முடியாத கோப்பைத் திறக்க முயற்சி செய்கிறார்கள் என்பதைக் குறிக்கிறது. நீங்கள் கோப்பின் பெயரை தவறாக எழுதியதால் இது நிகழலாம்.

source: An `ImportError` exception indicates that a certain object could not be imported from a module or package. Most often, this is because the name of the object is not spelled correctly.
ru: `ImportError` указывает на то, что определенный объект не может быть импортирован из модуля или пакета. Чаще всего это происходит из-за того, что имя объекта написано неправильно.
ta: ஒரு குறிப்பிட்ட பொருளை ஒரு தொகுதி அல்லது தொகுப்பிலிருந்து இறக்குமதி செய்ய முடியாது என்பதை இறக்குமதிப்பிழை `ImportError` விதிவிலக்கு குறிக்கிறது. பெரும்பாலும், பொருளின் பெயர் சரியாக எழுதப்படாததே இதற்குக் காரணம்.

source: An `IndentationError` occurs when a given line of code is not indented (aligned vertically with other lines) as expected.
ru: `IndentationError` возникает, когда данная строка кода не отступает (не выровнена по вертикали относительно других строк), как требуется.
ta: கொடுக்கப்பட்ட குறியீட்டு வரி எதிர்பார்த்தபடி உள்தள்ளப்படாமல் (பிற வரிகளுடன் செங்குத்தாக சீரமைக்கப்பட்டது) இருக்கும்பொழுது உள்தள்ளல்பிழை `IndentationError` ஏற்படுகிறது.

source: An `IndexError` occurs when you try to get an item from a list, a tuple, or a similar object (sequence), and use an index which does not exist; typically, this happens because the index you give is greater than the length of the sequence.
ru: `IndexError` возникает, когда вы пытаетесь получить элемент из списка, кортежа или аналогичного объекта (последовательности) и используете индекс, который не существует. Обычно это происходит потому, что указанный вами индекс больше, чем длина последовательности.
ta: பட்டியல், மடங்கு அல்லது ஒத்த பொருளிலிருந்து (வரிசை) ஒரு பொருளைப் பெற முயலும்போது, இல்லாத குறியீட்டைப் பயன்படுத்தும்போது குறியீட்டுபிழை `IndexError` ஏற்படுகிறது; பொதுவாக, நீங்கள் கொடுக்கும் குறியீட்டு வரிசையின் நீளத்தை விட அதிகமாக இருப்பதால் இது நிகழ்கிறது.

source: A `KeyError` is raised when a value is not found as a key in a Python dict or in a similar object.
ru: `KeyError` возникает, когда значение не найдено в качестве ключа в словаре или аналогичном объекте.
ta: பைதான் அகராதியிலோ அல்லது அதைப் போன்ற பொருளிலோ ஒரு மதிப்பு திறவுகோலாக காணப்படும்போது திறவுகோல்பிழை `KeyError` எழுப்பப்படுகிறது.

source: `LookupError` is the base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid. It can also be raised directly by codecs.lookup().
ru: `LookupError` является базовым классом для исключений, возникающих когда ключ или индекс, используемый в связке или последовательности, недействителен. Он также может быть вызван непосредственно функцией codecs.lookup().
ta: தேடல்பிழை `LookupError` என்பது அட்டவணை அல்லது வரிசைமுறையில் பயன்படுத்தப்படும் திறவுகோல் அல்லது குறியீட்டு தவறானதாக இருக்கும் போது எழுப்பப்படும் விதிவிலக்குகளுக்கான அடிப்படை வகுப்பாகும். இது codecs.lookup() மூலமாகவும் நேரடியாக எழுப்பப்படலாம்.

source: Like the name indicates, a `MemoryError` occurs when Python runs out of memory. This can happen if you create an object that is too big, like a list with too many items.
ru: `MemoryError` возникает когда Python исчерпывает доступную память. Это может произойти, если вы создадите объект слишком большого размера, например, список со слишком большим количеством элементов.
ta: பெயர் குறிப்பிடுவது போல, பைதான் நினைவகம் தீர்ந்துவிட்டால் நினைவகபிழை `MemoryError` ஏற்படுகிறது. பல உருப்படிகளைக் கொண்ட பட்டியல் போன்ற மிகப் பெரிய பொருளை நீங்கள் உருவாக்கினால் இது நிகழலாம்.

source: A `ModuleNotFoundError` exception indicates that you are trying to import a module that cannot be found by Python. This could be because you misspelled the name of the module or because it is not installed on your computer.
ru: `ModuleNotFoundError` указывает на то, что вы пытаетесь импортировать модуль, который не может быть найден Python. Это может быть связано с тем, что вы неправильно написали имя модуля или потому, что он не установлен на вашем компьютере.
ta: ஒரு தொகுதிகண்டறியப்படவில்லைபிழை `ModuleNotFoundError` விதிவிலக்கு, பைத்தானால் கண்டுபிடிக்க முடியாத ஒரு தொகுதியை நீங்கள் இறக்குமதி செய்ய முயற்சிக்கிறீர்கள் என்பதைக் குறிக்கிறது. நீங்கள் தொகுதியின் பெயரை தவறாக எழுதியதாலோ அல்லது உங்கள் கணினியில் நிறுவப்படாததாலோ இது நிகழலாம்.

source: A `NameError` exception indicates that a variable or function name is not known to Python. Most often, this is because there is a spelling mistake. However, sometimes it is because the name is used before being defined or given a value.
ru: `NameError` указывает на то, что переменная или имя переменной либо функции неизвестно Python. Чаще всего это происходит из-за орфографической ошибки. Однако иногда это происходит потому, что имя используется до того, как оно было обьявлено или инициализировано.
ta: ஒரு பெயர்ப்பிழை `NameError` விதிவிலக்கு என்பது ஒரு மாறி அல்லது செயல்பாட்டுப் பெயர் பைத்தானுக்குத் தெரியாது என்பதைக் குறிக்கிறது. பெரும்பாலும், எழுத்துப் பிழை இருப்பதே இதற்குக் காரணம். இருப்பினும், சில நேரங்களில் பெயர் வரையறுக்கப்படுவதற்கு முன்பு அல்லது மதிப்பைக் கொடுப்பதற்கு முன்பு பயன்படுத்தப்படுவதால் வருகிறது.

source: An `OSError` exception is usually raised by the Operating System to indicate that an operation is not allowed or that a resource is not available.
ru: `OSError` обычно вызывается операционной системой чтобы указать, что операция не разрешена или что ресурс недоступен.
ta: ஒரு முறைமைபிழை `OSError` விதிவிலக்கு பொதுவாக ஒரு செயல்பாடு அனுமதிக்கப்படவில்லை அல்லது ஆதாரம் இல்லை என்பதைக் குறிக்க இயக்க முறைமையால் எழுப்பப்படுகிறது.

source: An `OverflowError` is raised when the result of an arithmetic operation is too large to be handled by the computer's processor.
ru: `OverflowError` возникает, когда результат арифметической операции слишком велик для того, чтобы его мог обработать процессор компьютера.
ta: ஒரு எண்கணிதச் செயல்பாட்டின் விளைவு கணினியின் செயலியால் கையாள முடியாத அளவுக்குப் பெரிதாக இருக்கும்போது வழிதல்பிழை `OverflowError` எழுப்பப்படுகிறது.

source: A `RecursionError` is raised when a function calls itself, directly or indirectly, too many times. It almost always indicates that you made an error in your code and that your program would never stop.
ru: `RecursionError` возникает, когда функция вызывает сама себя прямо или косвенно, слишком много раз. Это почти всегда указывает на то, что вы допустили ошибку в своем коде и что ваша программа никогда не завершится.
ta: ஒரு செயல்பாடு நேரடியாகவோ அல்லது மறைமுகமாகவோ பல முறை தன்னை அழைக்கும் போது மறுநிகழ்வுபிழை `RecursionError` எழுப்பப்படுகிறது. உங்கள் குறியீட்டில் நீங்கள் பிழை செய்துள்ளீர்கள் என்பதையும் உங்கள் நிரல் ஒருபோதும் நிறுத்தப்படாது என்பதையும் இது எப்போதும் குறிக்கிறது.

source: A `RuntimeError` is raised when an error is detected that doesn't fall in any of the more specific exception types defined by Python.
ru: `RuntimeError` возникает при обнаружении ошибки, которая не попадает ни в один из из более специфичных типов исключений, определенных Python.
ta: பைத்தானால் வரையறுக்கப்பட்ட எந்த குறிப்பிட்ட விதிவிலக்கு வகைகளிலும் வராத பிழை கண்டறியப்பட்டால் இயக்கநேரப்பிழை`RuntimeError` எழுப்பப்படுகிறது.

source: `StopIteration` is raised to indicate that an iterator has no more item to provide when its `__next__` method is called by the `next()` builtin function.
ru: Исключение `StopIteration` выбрасывается, чтобы указать, что у итератора больше нет элемента для предоставления, когда его метод `__next__` вызывается встроенной функцией `next()`.
ta: `__next__` முறையானது `next()` உள்ளமைக்கப்பட்ட செயல்பாட்டின் மூலம் அழைக்கப்படும் போது, மறு செய்கைக்கு வழங்க வேண்டிய உருப்படி எதுவும் இல்லை என்பதைக் குறிக்க மறுசெய்கையைநிறுத்து `StopIteration` உயர்த்தப்பட்டது.

source: A `SyntaxError` occurs when Python cannot understand your code.
ru: `SyntaxError` возникает, когда Python не может понять ваш код.
ta: பைத்தானால் உங்கள் குறியீட்டைப் புரிந்து கொள்ள முடியாதபோது தொடரியல்பிழை `SyntaxError` ஏற்படுகிறது.

source: A `TabError` indicates that you have used both spaces and tab characters to indent your code. This is not allowed in Python. Indenting your code means to have block of codes aligned vertically by inserting either spaces or tab characters at the beginning of lines. Python's recommendation is to always use spaces to indent your code.
ru: `TabError` указывает на то, что вы использовали как пробелы, так и символы табуляции для отступов в коде. В Python это недопустимо. Отступ кода означает, что блок кода выравнивается по вертикали, вставляйте в начало строк либо пробелы, либо символы табуляции. Рекомендация Python: всегда используйте пробелы для отступа.
ta: ஒரு தாவல்பிழை `TabError` என்பது உங்கள் குறியீட்டை உள்தள்ளுவதற்கு இடைவெளிகள் மற்றும் தாவல் எழுத்துகள் இரண்டையும் பயன்படுத்தியுள்ளீர்கள் என்பதைக் குறிக்கிறது. பைத்தானில் இதற்கு அனுமதி இல்லை. உங்கள் குறியீட்டை உள்தள்ளுவது என்பது வரிகளின் தொடக்கத்தில் இடைவெளிகள் அல்லது தாவல் எழுத்துக்களைச் செருகுவதன் மூலம் செங்குத்தாக சீரமைக்கப்பட்ட குறியீடுகளின் தொகுதியைக் கொண்டிருப்பதாகும். உங்கள் குறியீட்டை உள்தள்ள எப்போதும் இடைவெளிகளைப் பயன்படுத்த வேண்டும் என்பதே பைத்தானின் பரிந்துரை.
