Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: I suspect that you forgot to add parentheses to call `{name}`. You might have meant to write: `{line}`
ru: Предполагаю, что вы забыли добавить круглые скобки для вызова `{name}`. Возможно, вы хотели написать: `{line}`.
ta: `{name}` என்பதை அழைக்க, அடைப்புக்குறிகளைச் சேர்க்க மறந்துவிட்டீர்கள் என்று சந்தேகிக்கிறேன். நீங்கள் இவ்வாறு எழுத நினைத்திருக்கலாம்: `{line}`

source: The function `vars` is used to list the content of the `__dict__` attribute of an object.
ru: Функция `vars` используется для перечисления содержимого атрибута `__dict__` объекта.
ta: ஒரு பொருளின் `__dict__` பண்புக்கூறின் உள்ளடக்கத்தை பட்டியலிட `vars` செயல்பாடு பயன்படுத்தப்படுகிறது.

source: Object `{name}` uses `__slots__` instead of `__dict__`.
ru: Объект `{name}` использует `__slots__` вместо `__dict__`.
ta: பொருள் `{name}` `__dict__` என்பதற்குப் பதிலாக `__slots__` ஐப் பயன்படுத்துகிறது.

source: `{name}`, the argument of `vars`, is an object without such an attribute.
ru: `{name}`, аргумент `vars`, является объектом без такого атрибута.
ta: `{name}`, `vars`ன் வாதம், அத்தகைய பண்பு இல்லாத ஒரு பொருள்.

source: You have specified the value of argument `{argument}` more than once when calling the function named `{function}`.
ru: Вы указали значение аргумента `{argument}` более одного раза при вызове функции с именем `{function}`.
ta: `{function}` என்ற செயல்பாட்டை அழைக்கும் போது வாதத்தின் மதிப்பை `{argument}` ஒன்றுக்கு மேற்பட்ட முறை குறிப்பிட்டுள்ளீர்கள்.

source: This function has only one argument: `{arguments}`
ru: Эта функция принимает только один аргумент: `{arguments}`.
ta: இந்தச் செயல்பாட்டிற்கு ஒரே ஒரு வாதம் உள்ளது: `{arguments}`

source: This function has the following arguments: `{arguments}`
ru: Эта функция принимает следующие аргументы: `{arguments}`
ta: இந்தச் செயல்பாட்டு பின்வரும் வாதங்களைக் கொண்டுள்ளது: `{arguments}`

source: You're trying to use the name `{name}` identified by Python as being in the local scope of a function before having assigned it a value.
ru: Вы пытаетесь использовать имя `{name}`, идентифицированное Python как находящееся в локальной области видимости функции, прежде чем присвоить ему значение.
ta: பைத்தானால் அடையாளம் காணப்பட்ட `{name}` என்ற பெயரைப் பயன்படுத்த முயல்கிறீர்கள், அதற்கு மதிப்பை வழங்குவதற்கு முன், செயல்பாட்டின் உள்ளூர் நோக்கத்தில் உள்ளது.

source: The name `{var_name}` exists in both the global and nonlocal scope. This can be rather confusing and is not recommended. Depending on which variable you wanted to refer to, you needed to add either global {var_name} or nonlocal {var_name} as the first line inside your function.
ru: Имя `{var_name}` существует как в глобальной, так и в нелокальной областях видимости. Это может привести к путанице и не рекомендуется. В зависимости от того, на какую переменную вы хотите сослаться, вам нужно добавить либо global {var_name} либо nonlocal {var_name} в качестве первой строки внутри вашей функции.
ta: `{var_name}` என்ற பெயர் உலகளாவிய மற்றும் உள்ளூர்அல்லாத இரண்டிலும் உள்ளது. இது மிகவும் குழப்பமானதாக இருக்கலாம் மற்றும் பரிந்துரைக்கப்படவில்லை. நீங்கள் எந்த மாறியைப் பார்க்க விரும்புகிறீர்கள் என்பதைப் பொறுத்து, உங்கள் செயல்பாட்டிற்குள் முதல் வரியாக global {var_name} அல்லது nonlocal {var_name} ஐச் சேர்க்க வேண்டும்.

source: Did you forget to add either `global {var_name}` or `nonlocal {var_name}`?
ru: Вы забыли добавить `global {var_name}` или `nonlocal {var_name}`?
ta: `global {var_name}` அல்லது `nonlocal {var_name}` ஒன்றைச் சேர்க்க மறந்துவிட்டீர்களா?

source: `{name}` is a Python builtin function. You have tried to assign a value to `{name}` inside a function while also using its original meaning in the function. Note that it is generally not a good idea to give a local variable the same name as a Python builtin function (like `{name}`).
ru: `{name}` -- это встроенная функция Python. Вы попытались присвоить значение `{name}` внутри функции при этом используя ее исходное значение в функции. Обратите внимание, что обычно не стоит давать локальной переменной то же имя, что и встроенной функции Python (например, `{name}`).
ta: `{name}` என்பது பைதான் உள்ளமைக்கப்பட்ட செயல்பாடு. செயல்பாட்டில் அதன் அசல் பொருளைப் பயன்படுத்தும் போது, ஒரு செயல்பாட்டிற்குள் `{name}` க்கு மதிப்பை ஒதுக்க முயற்சித்தீர்கள். பைதான் உள்ளமைக்கப்பட்ட செயல்பாட்டின் அதே பெயரை உள்ளூர் மாறிக்கு வழங்குவது பொதுவாக நல்ல யோசனையல்ல என்பதை நினைவில் கொள்க (`{name}` போன்றவை).

source: The name `{var_name}` exists in the {scope} scope. Perhaps the statement {scope} {var_name} should have been included as the first line inside your function.
ru: Имя `{var_name}` существует в области видимости {scope}. Возможно,обьявление {scope} {var_name} должно быть включено в качестве первой строки внутри вашей функции.
ta: `{var_name}` என்ற பெயர் {scope} நோக்கத்தில் உள்ளது. ஒருவேளை {scope} {var_name} என்ற கூற்று உங்கள் செயல்பாட்டிற்குள் முதல் வரியாக சேர்க்கப்பட்டிருக்க வேண்டும்.

source: Did you forget to add `{scope} {var_name}`?
ru: Вы забыли добавить `{scope} {var_name}`?
ta: `{scope} {var_name}` சேர்க்க மறந்துவிட்டீர்களா?

source: The similar name `{name}` was found in the local scope.
ru: В локальной области видимости найдено похожее имя `{name}`.
ta: இதேபோன்ற பெயர் `{name}` உள்ளூர் நோக்கத்தில் காணப்பட்டது.

source: In this instance, there are more names ({nb_names}) than {length}, the length of the iterable.
ru: В данном случае количество имен ({nb_names}) больше, чем {length}, итерируемого объекта.
ta: இந்த நிகழ்வில், {length} ஐ விட அதிகமான பெயர்கள் ({nb_names}) உள்ளன, இது திரும்பச் செய்யக்கூடியது.

source: In this instance, there are more names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
ru: В данном случае количество имен ({nb_names}) больше, чем длина итерируемого объекта, {iter_type} длиной {length}.
ta: இந்த நிகழ்வில், மறுசெய்யக்கூடிய நீளத்தை விட ({nb_names}) அதிக பெயர்கள் உள்ளன, {iter_type} நீளம் {length}.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable.
ru: В данном случае имен ({nb_names}) меньше, чем длина последовательности.
ta: இந்த நிகழ்வில், மறுசெய்யக்கூடிய நீளத்தை விட குறைவான பெயர்கள் ({nb_names}) உள்ளன.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
ru: В данном случае имен ({nb_names}) меньше, чем длина итерируемого объекта, {iter_type} длиной {length}.
ta: இந்த நிகழ்வில், மறுசெய்யக்கூடிய நீளத்தை விட ({nb_names}) குறைவான பெயர்கள் உள்ளன, {iter_type} நீளம் {length}.

source: `int()` expects an argument that looks like a number in base `{base}` but you gave it an empty string.
ru: `int()` ожидает аргумент, который выглядит как число в базе `{base}`, но вы передали ему пустую строку.
ta: `int()` ஆனது அடிப்படை `{base}` இல் எண்ணைப் போல் தோற்றமளிக்கும் ஒரு வாதத்தை எதிர்பார்க்கிறது ஆனால் நீங்கள் அதற்கு வெற்று சரத்தை வழங்கியுள்ளீர்கள்.

source: `{value}` is an invalid argument for `int()` in base `{base}`.
ru: `{value}` является недопустимым аргументом для `int()` в базе `{base}`.
ta: `{value}` என்பது அடிப்படை `{base}` இல் உள்ள `int()` க்கான தவறான மதிப்புரு.

source: The following characters are not allowed: `{invalid}`.
ru: Недопустимы следующие символы: `{invalid}`.
ta: பின்வரும் எழுத்துகள் அனுமதிக்கப்படாது: `{invalid}`.

source: When base `0` is specified, `int()` expects the argument to be an integer literal, written in base 2 (`0b...`), 8 (`0o...`), 10, or 16 (`0x...`).
ru: Когда указано основание `0`, `int()` ожидает, что аргумент является целочисленным литералом, записанным в формате основание 2 (`0b...`), 8 (`0o...`), 10 или 16 (`0x...`).
ta: அடிப்படை `0` குறிப்பிடப்பட்டால், `int()` வாதமானது அடிப்படை 2 (`0b...`), 8 (`0o...`), 10 அல்லது 16 (`0x...`) இல் எழுதப்பட்ட முழு எண்ணாக இருக்க வேண்டும் என்று எதிர்பார்க்கிறது.

source: In base `{base}`, `int()` is most often use to convert a string containing the digits `0` to `{max_n}` into an integer.
ru: В базе `{base}`, `int()` чаще всего используется для преобразования строки, содержащей цифры от `0` до `{max_n}` в целое число.
ta: அடிப்படை `{base}` இல், `int()` என்பது `0` லிருந்து `{max_n}` இலக்கங்களைக் கொண்ட சரத்தை முழு எண்ணாக மாற்றப் பயன்படுத்தப்படுகிறது.

source: In base `11`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letter `'a'` into an integer.
ru: В базе `11`, `int()` чаще всего используется для преобразования строки, содержащей цифры от `0` до `9` и букву `'a'`, в целое число.
ta: அடிப்படை `11` இல், `int()` என்பது இலக்கங்கள் `0` ஐ `9` ஆகவும், `'a'` எழுத்தை முழு எண்ணாகவும் மாற்றுவதற்குப் பயன்படுத்தப்படுகிறது.

source: In base `base`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letters from `'a'` to `'{max_n}'` into an integer.
ru: В базе `base`, `int()` чаще всего используется для преобразования строки содержащей цифры от `0` до `9` и буквы от `'a'` до `'{max_n}'`, в целое число.
ta: அடிப்படை `base` இல், `int()` என்பது இலக்கங்கள் `0` ஆகவும் `9` ஆகவும், `'a'` இலிருந்து `'{max_n}'` வரை உள்ள எழுத்துக்களையும் முழு எண்ணாக மாற்றப் பயன்படுத்தப்படுகிறது.

source: You need to convert `'{value}'` to a float first.
ru: Сначала нужно преобразовать `'{value}'` во float.
ta: நீங்கள் முதலில் `'{value}'` ஐ மிதவையாக மாற்ற வேண்டும்.

source: The string `'{value}'` needs to be first converted using `float()` before the result can be converted into an integer using `int()`.
ru: Строка `'{value}'` должна быть сначала преобразована с помощью `float()` прежде чем результат будет преобразован в целое число с помощью `int()`.
ta: முடிவை `int()` ஐப் பயன்படுத்தி முழு எண்ணாக மாற்றுவதற்கு முன், `'{value}'` சரத்தை முதலில் `float()` ஐப் பயன்படுத்தி மாற்ற வேண்டும்.

source: The argument `base` of `int()` must be either zero or any integer from 2 to 36.
ru: Аргумент `base` функции `int()` должен быть либо нулем или любым целым числом от 2 до 36.
ta: `int()` இன் வாதத்தின் `base` சுழியமாகவோ அல்லது 2 முதல் 36 வரையிலான முழு எண்ணாகவோ இருக்க வேண்டும்.

source: You wrote {base} which is not allowed.
ru: Вы написали {base}, что недопустимо.
ta: அனுமதிக்கப்படாத {base} என்று எழுதியுள்ளீர்கள்.

source: Did you specify an invalid month?
ru: Вы указали неправильный месяц?
ta: செல்லாத மாதத்தைக் குறிப்பிட்டீர்களா?

source: I am guessing that you specify an invalid value for a month in a `date` object. Valid values are integers, from 1 to 12.
ru: Предполагаю, что вы указали недопустимое значение для месяца в объекте `date`. Допустимыми значениями являются целые числа от 1 до 12.
ta: `தேதி` பொருளில் ஒரு மாதத்திற்கான தவறான மதிப்பை நீங்கள் குறிப்பிடுகிறீர்கள் என்று நினைக்கிறேன். சரியான மதிப்புகள் 1 முதல் 12 வரையிலான முழு எண்களாகும்.

source: The string `{string}` cannot be converted to a `float`.
ru: Строка `{string}` не может быть преобразована во `float`.
ta: `{string}` சரத்தை `float` ஆக மாற்ற முடியாது.

source: The name `{var}` is used both as the name of a class variable and as a string item in the class `__slots__`; this is not allowed.
ru: Имя `{var}` используется и как имя переменной класса, и как строковый элемент в классе `__slots__`. Это недопустимо.
ta: `{var}` என்ற பெயர் வகுப்பு மாறியின் பெயராகவும், `__slots__` வகுப்பில் சரம் உருப்படியாகவும் பயன்படுத்தப்படுகிறது; இது அனுமதிக்கப்படவில்லை.

source: The third argument of the function `pow()` cannot be zero.
ru: Третий аргумент функции `pow()` не может быть нулём.
ta: `pow()` செயல்பாட்டின் மூன்றாவது வாதம் சுழியமாக இருக்க முடியாது.

source: I do not recognize this error message. I am guessing that the problem is with the function `{name}`.
ru: Предполагаю, что проблема связана с функцией `{name}`.
ta: இந்த பிழைச் செய்தியை என்னால் அடையாளம் காண முடியவில்லை. `{name}` செயல்பாட்டில் சிக்கல் இருப்பதாக நான் நினைக்கிறேன்.

source: Its docstring is: {docstring}
ru: Его docstring выглядит так: {docstring}
ta: அதன் ஆவணசரம்: {docstring}

source: I have no more information.
ru: Дополнительной информации нет.
ta: எனக்கு மேலும் எந்த தகவலும் இல்லை.

source: The value you gave for the time is not in the format you specified. Make sure to use the same separator between items (for example, between day and month) and keep the order the same in both the data provided and the format you specified. The following table might be useful: https://docs.python.org/3/library/time.html#time.strftime The following site might also be useful: https://www.strfti.me/
ru: Значение, которое вы указали для времени, не соответствует указанному формату. Убедитесь, что между элементами используется одинаковый разделитель (например, между днем и месяцем) и соблюдайте одинаковый порядок как в предоставленных данных, так и в указанном вами формате. Следующая таблица может оказаться полезной: https://docs.python.org/3/library/time.html#time.strftime Следующий сайт также может быть полезен: https://www.strfti.me/
ta: நேரத்திற்கு நீங்கள் கொடுத்த மதிப்பு நீங்கள் குறிப்பிட்ட வடிவத்தில் இல்லை. உருப்படிகளுக்கு இடையில் ஒரே பிரிப்பானைப் பயன்படுத்துவதை உறுதிசெய்து (உதாரணமாக, நாள் மற்றும் மாதத்திற்கு இடையில்) மற்றும் வழங்கப்பட்ட தரவு மற்றும் நீங்கள் குறிப்பிட்ட வடிவமைப்பு இரண்டிலும் வரிசையை ஒரே மாதிரியாக வைத்திருக்கவும். பின்வரும் அட்டவணை பயனுள்ளதாக இருக்கும்: https://docs.python.org/3/library/time.html#time.strftime பின்வரும் தளமும் பயனுள்ளதாக இருக்கும்: https://www.strfti.me/

source: Using the modulo operator, you are dividing by zero.
ru: Используя оператор modulo, вы делите на ноль.
ta: மட்டு இயக்கியைப் பயன்படுத்தி, நீங்கள் சுழியத்தால் வகுக்கிறீர்கள்.

source: You are dividing by zero.
ru: Вы делите на ноль.
ta: நீங்கள் சுழியத்தால் வகுக்கிறீர்கள்.

source: You are dividing by the following term {expression} which is equal to zero.
ru: Вы делите на следующее выражение {expression} которое равно нулю.
ta: சுழியத்திற்குச் சமமான பின்வரும் பதம் {expression} மூலம் நீங்கள் வகுக்கிறீர்கள்.

source: <'expression not found'>
ru: <'выражение не найдено'>

source: The following mathematical expression includes a division by zero: {expression}
ru: Следующее математическое выражение включает в себя деление на ноль: {expression}
ta: பின்வரும் கணித வெளிப்பாடு சுழியத்தால் வகுத்தல்: {expression}

source: Using the modulo operator, you are dividing by the following term {expression} which is equal to zero.
ru: Используя оператор modulo, вы делите на следующий член {expression} равный нулю.
ta: மட்டு இயக்கியைப் பயன்படுத்தி, சுழியத்திற்குச் சமமான பின்வரும் பதம் {expression} மூலம் வகுக்கிறீர்கள்.

source: The second argument of the `divmod()` function is zero.
ru: Второй аргумент функции `divmod()` равен нулю.
ta: `divmod()` செயல்பாட்டின் இரண்டாவது வாதம் சுழியமாகும்.

source: You are attempting to raise the number 0 to a negative power which is equivalent to dividing by zero.
ru: Вы пытаетесь возвести число 0 в отрицательную степень. что эквивалентно делению на ноль.
ta: நீங்கள் எண் 0 ஐ எதிர்மறை சக்தியாக உயர்த்த முயற்சிக்கிறீர்கள், இது சுழியத்தால் வகுக்கும் சமமானதாகும்.

source: The following mathematical expression includes a division by zero done using the modulo operator: {expression}
ru: Следующее математическое выражение включает деление на ноль выполненное с помощью оператора modulo: {expression}
ta: பின்வரும் கணித வெளிப்பாட்டில் சுழியத்தால் வகுத்தல் மட்டு இயக்கியைப் பயன்படுத்தி செய்யப்படுகிறது: {expression}

source: The second argument of the `divmod()` function is equal to zero.
ru: Второй аргумент функции `divmod()` равен нулю.
ta: `divmod()` செயல்பாட்டின் இரண்டாவது வாதம் சுழியத்திற்குச் சமம்.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/friendly-traceback/friendly-traceback/issues
ru: В настоящее время я не могу предположить вероятную причину этой ошибки. Попробуйте внимательно изучить указанную строку, а также строку расположенную непосредственно над ней, и попробуйте определить,не написано ли какое-нибудь слово или недостающие символы, такие как (, ), [, ], :, и т.д. Если только в вашем коде не используются аннотации типов, которые выходят за рамки нашей темы. Если вы считаете, что это то, что должно быть обработано более корректно, пожалуйста, сообщите об этом случае по адресу https://github.com/friendly-traceback/friendly-traceback/issues

source: Python told us that it expected a colon at the position indicated. However, adding a colon or replacing something else by a colon would not fix the problem.
ru: Python сообщил нам, что ожидает двоеточие в указанном месте. Однако добавление двоеточия или замена чего-то другого на двоеточие не устранит проблему.
ta: சுட்டிக்காட்டப்பட்ட நிலையில் ஒரு முக்காற்புள்ளியை எதிர்பார்ப்பதாக பைதான் எங்களிடம் கூறியது. இருப்பினும், ஒரு முக்காற்புள்ளியைச் சேர்ப்பது அல்லது முக்காற்புள்ளி மூலம் வேறு எதையாவது மாற்றுவது சிக்கலைச் சரிசெய்யாது.

source: Python gave us the following informative message about the possible cause of the error: {message} However, I do not recognize this information and I have to guess what caused the problem, but I might be wrong.
ru: Python выдал нам следующее сообщение о возможной причине ошибки: {message} Однако я не распознал эту информацию, и мне приходится только гадать, что вызвало проблему, и я могу ошибаться.
ta: பிழையின் சாத்தியமான காரணத்தைப் பற்றி பைதான் எங்களுக்கு பின்வரும் தகவலறிந்த செய்தியை வழங்கியது: {message} இருப்பினும், இந்தத் தகவலை என்னால் அடையாளம் காண முடியவில்லை, மேலும் சிக்கலுக்கு என்ன காரணம் என்று நான் நினைக்க வேண்டும், ஆனால் நான் தவறாக இருக்கலாம்.

source: However, making such a change would still not correct all the syntax errors in the code you wrote.
ru: Однако такое изменение все равно не исправит все синтаксические ошибки в вашем коде.
ta: இருப்பினும், அப்படி மாற்றுவது நீங்கள் எழுதிய குறியீட்டில் உள்ள அனைத்து தொடரியல் பிழைகளையும் சரி செய்யாது.

source: The correct syntax is: {async_}def name ( ... ):
ru: Правильный синтаксис следующий: {async_}def name ( ... ):
ta: சரியான தொடரியல்: {async_}def name (... ):

source: A function needs a name.
ru: Функция нуждается в имени.
ta: ஒரு செயல்பாட்டிற்கு ஒரு பெயர் தேவை.

source: You tried to define a function and did not use the correct syntax.
ru: Вы пытались определить функцию и использовали неправильный синтаксис.
ta: நீங்கள் ஒரு செயல்பாட்டை வரையறுக்க முயற்சித்தீர்கள் மற்றும் சரியான தொடரியல் பயன்படுத்தவில்லை.

source: Functions and methods need a name.
ru: Функции и методы нуждаются в именах.
ta: செயல்பாடுகள் மற்றும் முறைகளுக்கு ஒரு பெயர் தேவை.

source: You tried to define a function or method and did not use the correct syntax.
ru: Вы пытались определить функцию или метод и использовали неправильный синтаксис.
ta: நீங்கள் ஒரு செயல்பாடு அல்லது முறையை வரையறுக்க முயற்சித்தீர்கள் மற்றும் சரியான தொடரியல் பயன்படுத்தவில்லை.

source: Did you forget parentheses?
ru: Вы забыли про скобки?
ta: அடைப்புக்குறிகளை மறந்துவிட்டீர்களா?

source: Perhaps you forgot to include parentheses. You might have meant to write {line}
ru: Возможно, вы забыли поставить круглые скобки. Возможно, вы хотели написать {line}
ta: ஒருவேளை நீங்கள் அடைப்புக்குறிக்குள் சேர்க்க மறந்துவிட்டீர்கள். நீங்கள் பின்வருமாறு எழுத நினைத்திருக்கலாம் {line}

source: A function definition statement must end with a colon.
ru: Оператор определения функции должен заканчиваться двоеточием.
ta: ஒரு செயல்பாட்டு வரையறை அறிக்கை முக்காற்புள்ளியுடன் முடிவடைய வேண்டும்.

source: Did you forget to write a colon?
ru: Вы забыли поставить двоеточие?
ta: முக்காற்புள்ளியை எழுத மறந்துவிட்டீர்களா?

source: You wrote `{bad}` instead of a colon.
ru: Вы поставили `{bad}` вместо двоеточия.
ta: முக்காற்புள்ளிக்குப் பதிலாக `{bad}` என்று எழுதியுள்ளீர்கள்.

source: Did you write something by mistake after the colon?
ru: После двоеточия вы написали что-то по ошибке?
ta: முக்காற்புள்ளிக்குப் பிறகு தவறுதலாக ஏதாவது எழுதிவிட்டீர்களா?

source: A block of code must come after the colon.
ru: Блок кода должен идти после двоеточия.
ta: முக்காற்புள்ளியைக்குப் பிறகு ஒரு தொகுதி குறியீடு வர வேண்டும்.

source: Removing `{bad}`, might fix the problem.
ru: Удаление `{bad}` может решить проблему.
ta: `{bad}` அகற்றினால், சிக்கலைச் சரிசெய்யலாம்.

source: You cannot use a Python keyword as a function name.
ru: Вы не можете использовать ключевое слово Python в качестве имени функции.
ta: நீங்கள் பைதான் முக்கிய சொல்லை செயல்பாட்டு பெயராகப் பயன்படுத்த முடியாது.

source: You tried to use the Python keyword `{kwd}` as a function name.
ru: Вы попытались использовать ключевое слово Python `{kwd}` в качестве имени функции.
ta: நீங்கள் பைதான் முக்கிய சொல்லான `{kwd}` ஐ செயல்பாட்டுப் பெயராகப் பயன்படுத்த முயற்சித்தீர்கள்.

source: There are more syntax errors later in your code.
ru: В дальнейшем в вашем коде будет больше синтаксических ошибок.
ta: உங்கள் குறியீட்டில் பின்னர் அதிகமான தொடரியல் பிழைகள் உள்ளன.

source: You wrote an invalid function name.
ru: Это недопустимое имя функции.
ta: நீங்கள் தவறான செயல்பாட்டு பெயரை எழுதியுள்ளீர்கள்.

source: The name of a function must be a valid Python identifier, that is a name that begins with a letter or an underscore character, `_`, and which contains only letters, digits or the underscore character.
ru: Имя функции должно быть допустимым идентификатором Python, то есть именем, которое начинается с буквы или символа подчеркивания, `_`, и которое содержит только буквы, цифры или символ подчеркивания.
ta: ஒரு செயல்பாட்டின் பெயர் செல்லுபடியாகும் பைதான் அடையாளங்காட்டியாக இருக்க வேண்டும், அது ஒரு எழுத்து அல்லது அடிக்கோடிட்ட எழுத்துடன் தொடங்கும் பெயர், `_`, மேலும் இதில் எழுத்துக்கள், இலக்கங்கள் அல்லது அடிக்கோடி எழுத்து மட்டுமே இருக்கும்.

source: You attempted to use a string as a function name.
ru: Вы попытались использовать строку в качестве имени функции.
ta: நீங்கள் ஒரு சரத்தை செயல்பாட்டுப் பெயராகப் பயன்படுத்த முயற்சித்தீர்கள்.

source: You forgot to name your function.
ru: Вы забыли назвать свою функцию.
ta: உங்கள் செயல்பாட்டிற்கு பெயரிட மறந்துவிட்டீர்கள்.

source: However, there are some other syntax errors in your code.
ru: Однако в вашем коде есть и другие синтаксические ошибки.
ta: இருப்பினும், உங்கள் குறியீட்டில் வேறு சில தொடரியல் பிழைகள் உள்ளன.

source: I am guessing that you tried to use the Python keyword `{kwd}` as an argument in the definition of a function where an identifier (variable name) was expected.
ru: Предполагаю, что вы пытались использовать ключевое слово Python `{kwd}` в качестве аргумента в определении функции где ожидался идентификатор (имя переменной).
ta: அடையாளங்காட்டி (மாறி பெயர்) எதிர்பார்க்கப்படும் செயல்பாட்டின் வரையறையில் பைதான் முக்கிய சொல்லான `{kwd}` ஐ வாதமாகப் பயன்படுத்த முயற்சித்தீர்கள் என்று நினைக்கிறேன்.

source: You cannot use dotted names as function arguments.
ru: Нельзя использовать точечные имена в качестве аргументов функций.
ta: நீங்கள் புள்ளியிடப்பட்ட பெயர்களை செயல்பாட்டு வாதங்களாகப் பயன்படுத்த முடியாது.

source: Perhaps you meant to write a comma.
ru: Возможно, вы хотели поставить запятую.
ta: ஒருவேளை நீங்கள் காற்புள்ளியை எழுத நினைத்திருக்கலாம்.

source: Did you mean to write a comma?
ru: Вы хотели поставить запятую?
ta: காற்புள்ளியை எழுத நினைத்தீர்களா?

source: You cannot use dots in function names.
ru: В именах функций нельзя использовать точки.
ta: செயல்பாடு பெயர்களில் புள்ளிகளைப் பயன்படுத்த முடியாது.

source: `/` indicates that the previous arguments in a function definition are positional arguments.
ru: `/` указывает, что предыдущие аргументы в определении функции являются позиционными аргументами.
ta: `/` ஒரு செயல்பாட்டு வரையறையில் முந்தைய வாதங்கள் நிலை வாதங்கள் என்பதைக் குறிக்கிறது.

source: Function definitions cannot include the symbol `/` in this Python version.
ru: Определения функций не могут включать символ `/` в этой версии Python.
ta: இந்த பைதான் பதிப்பில் `/` குறியீட்டை செயல்பாட்டு வரையறைகள் சேர்க்க முடியாது.
