Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: You cannot delete the expression `{expression}`.
ru: Вы не можете удалить выражение `{expression}`.
ta: `{expression}` என்ற வெளிப்பாட்டை நீங்கள் நீக்க முடியாது.

source: You attempted to delete a function call {line} instead of deleting the function's name {correct}
ru: Вы попытались удалить вызов функции {line} вместо того, чтобы удалить имя функции {correct}
ta: செயல்பாட்டு அழைப்பை நீக்க முயற்சித்தீர்கள் {line} செயல்பாட்டின் பெயரை நீக்குவதற்கு பதிலாக {correct}

source: You cannot delete the literal `{literal}`.
ru: Вы не можете удалить литерал `{literal}`.
ta: நீங்கள் நேரடியான `{literal}` ஐ நீக்க முடியாது.

source: You cannot delete the named expression `{expression}`.
ru: Вы не можете удалить именованное выражение `{expression}`.
ta: பெயரிடப்பட்ட வெளிப்பாட்டை நீங்கள் நீக்க முடியாது `{expression}`.

source: The star operator `*` is interpreted to mean that iterable unpacking is to be used to assign a name to each item of an iterable, which does not make sense here.
ru: Оператор 'звезда' `*` интерпретируется как означающий, что распаковка последовательности должна использоваться для присвоения имени каждому элементу последовательности, что в данном случае не имеет смысла.
ta: விண்மீன் இயக்கி `*` என்பது, மறுசெய்யக்கூடிய ஒவ்வொரு பொருளுக்கும் ஒரு பெயரை ஒதுக்குவதற்கு, மறுசெய்யக்கூடிய கட்டவிழ் பயன்படுத்தப்பட வேண்டும் என்று பொருள்படும், இது இங்கே பொருளற்றது.

source: It looks like you surrounded a starred name by parentheses. This was not considered a SyntaxError before Python version 3.9.
ru: Похоже, что вы окружили starred name круглыми скобками. До версии Python 3.9 это не считалось синтаксической ошибкой.
ta: அடைப்புக்குறிக்குள் விண்மீன் பெயரைச் சுற்றியிருப்பது போல் தெரிகிறது. இது பைதான் பதிப்பு 3.9க்கு முன் தொடரியல் பிழையாகக் கருதப்படவில்லை.

source: Did you forget a colon?
ru: Вы забыли про двоеточие?
ta: நீங்கள் ஒரு முக்காற்புள்ளியை மறந்துவிட்டீர்களா?

source: Python expected a colon at the position indicated.
ru: В указанном месте Python ожидал увидеть двоеточие.
ta: பைதான் சுட்டிக்காட்டப்பட்ட நிலையில் ஒரு முக்காற்புள்ளியை எதிர்பார்த்தது.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you wrote a dict key without writing the corresponding value.
ru: Похоже, что ошибка возникла, когда вы добавляли `key` в словарь Python. Возможно, вы записали `key` без соответствующего `value`.
ta: நீங்கள் பைத்தான் அகராதி எழுதும் போது பிழை ஏற்பட்டது போல் தெரிகிறது. ஒருவேளை நீங்கள் தொடர்புடைய மதிப்பை எழுதாமல் அகராதி திரவுகோலை எழுதியிருக்கலாம்.

source: Did you forget to write a dict value?
ru: Вы забыли записать в словарь значение ?
ta: அகராதி மதிப்பை எழுத மறந்துவிட்டீர்களா?

source: The Python keyword `continue` can only be used inside a `for` loop or inside a `while` loop.
ru: Ключевое слово Python `continue` можно использовать только внутри циклов `for` или `while`.
ta: பைதான் முக்கிய சொல்லான `continue` என்பது `for` சுழலில் அல்லது `while` சுழலில் மட்டுமே பயன்படுத்தப்படும்.

source: You have defined a function repeating the argument {name} Each argument should appear only once in a function definition.
ru: Вы определили функцию, в которой дублируется аргумент `{name}`. Каждый аргумент должен появляться только один раз в определении функции.
ta: வாதத்தை மீண்டும் செய்யும் செயல்பாட்டை நீங்கள் வரையறுத்துள்ளீர்கள் {name} ஒவ்வொரு வாதமும் ஒரு செயல்பாடு வரையறையில் ஒரு முறை மட்டுமே தோன்ற வேண்டும்.

source: Did you forget to add `else`?
ru: Вы забыли добавить `else`?
ta: `else` சேர்க்க மறந்துவிட்டீர்களா?

source: An `else some_value` clause was expected after the `if` expression.
ru: После выражения `if` ожидалось появление выражения `else some_value`.
ta: `if` வெளிப்பாட்டிற்குப் பிறகு `else சில_மதிப்பு` பிரிவு எதிர்பார்க்கப்பட்டது.

source: You started writing a triple-quoted string but never wrote the triple quotes needed to end the string.
ru: Вы начали писать строку с тройными кавычками но так и не закрыли их.
ta: நீங்கள் மூன்று மேற்கோள் சரத்தை எழுதத் தொடங்கியுள்ளீர்கள் ஆனால் சரத்தை முடிக்க தேவையான மூன்று மேற்கோள்களை எழுதவில்லை.

source: Did you forget a closing quote?
ru: Вы забыли завершающие кавычки?
ta: இறுதி மேற்கோளை மறந்துவிட்டீர்களா?

source: You started writing a string with a single or double quote but never ended the string with another quote on that line.
ru: Вы начали писать строку с одинарной или двойной кавычки, но так и не закрыли их.
ta: நீங்கள் ஒற்றை அல்லது இரட்டை மேற்கோளுடன் ஒரு சரத்தை எழுதத் தொடங்கியுள்ளீர்கள், ஆனால் அந்த வரியில் மற்றொரு மேற்கோளுடன் சரத்தை முடிக்கவில்லை.

source: Perhaps you meant to write the backslash character, `\` as the last character in the string and forgot that you needed to escape it by writing two `\` in a row.
ru: Возможно, вы хотели написать символ обратной косой черты `\` как последний символ в строке и забыли, что что его нужно экранировать, написав два `\` подряд.
ta: ஒருவேளை நீங்கள் பின்சாய்வு எழுத்தை எழுத நினைத்திருக்கலாம், சரத்தின் கடைசி எழுத்தாக `\` மற்றும் ஒரு வரிசையில் இரண்டு `\` எழுதுவதன் மூலம் அதிலிருந்து தப்பிக்க வேண்டும் என்பதை மறந்துவிட்டீர்கள்.

source: Did you forget to escape a backslash character?
ru: Вы забыли экранировать символ обратной косой черты?
ta: பின்சாய்வுக் எழுத்திலிருந்து தப்பிக்க மறந்துவிட்டீர்களா?

source: Perhaps you forgot to escape a quote character.
ru: Возможно, вы забыли закрыть кавычки.

source: I suspect that you were trying to use a quote character inside a string that was enclosed in quotes of the same kind. Perhaps you should have escaped the inner quote character: {new_line} {mark}
ru: Предполагаю, что вы пытались использовать символ кавычек внутри строки, которая была заключена в кавычки того же типа. Возможно, вам следовало экранировать символ внутренней кавычки: {new_line} {mark}

source: You likely called a function using the Python keyword `{keyword}` as an argument: a_function({keyword}=something) which Python interpreted as trying to assign a value to a Python keyword.
ru: Скорее всего, вы вызвали функцию, используя ключевое слово Python `{keyword}` в качестве аргумента: a_function({keyword}=something) что Python интерпретировал как попытку присвоить значение ключевому слову Python.
ta: நீங்கள் பைதான் முக்கிய சொல்லான `{keyword}` ஐ ஒரு வாதமாகப் பயன்படுத்தி ஒரு செயல்பாட்டை அழைக்கலாம்: ஒரு_செயல்பாடு({keyword}=ஏதாவது) பைதான் முக்கிய சொல்லுக்கு மதிப்பை ஒதுக்க முயற்சிப்பதாக பைதான் விளக்குகிறது.

source: You likely called a function with a named argument: a_function(invalid=something) where `invalid` is not a valid variable name in Python either because it starts with a number, or is a string, or contains a period, etc.
ru: Скорее всего, вы вызвали функцию с именованным аргументом: a_function(invalid=something) где `invalid` не является допустимым именем переменной в Python либо потому, что оно начинается с числа, либо является строкой, или содержит точку и т.д.
ta: பெயரிடப்பட்ட வாதத்துடன் ஒரு செயல்பாட்டை நீங்கள் அழைக்கலாம்: ஒரு_செயல்பாடு(invalid=ஏதோ) இங்கு `invalid` என்பது பைத்தானில் செல்லுபடியாகும் மாறிப் பெயர் அல்ல அது ஒரு எண்ணுடன் தொடங்குவதால், அல்லது ஒரு சரம், அல்லது ஒரு காலகட்டம் போன்றவை உள்ளன.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you forgot to write a value after a colon.
ru: Похоже, что ошибка возникла, когда вы писали в словарь Python. Возможно, вы забыли написать значение после двоеточия.
ta: நீங்கள் பைத்தான் அகராதி எழுதும் போது பிழை ஏற்பட்டது போல் தெரிகிறது. ஒரு முக்காற்புள்ளிக்குப் பிறகு ஒரு மதிப்பை எழுத மறந்துவிட்டீர்கள்.

source: You have written an f-string whose content `{...}` includes a backslash; this is not allowed. Perhaps you can replace the part that contains a backslash by some variable. For example, suppose that you have an f-string like: f"{... 'hello\n' ...}" you could write this as hello = 'hello\n' f"{... hello ...}"
ru: Вы написали f-строку, содержимое которой `{...}` включает обратную косую черту; это недопустимо. Возможно, вы можете заменить часть, содержащую обратную косую черту, некоторой переменной. Например, предположим, что у вас есть f-строка вида: f"{... 'hello\n' ...}" её можно записать как: hello = 'hello\n' f"{...hello ...}"
ta: நீங்கள் ஒரு f-சரத்தை எழுதியுள்ளீர்கள், அதன் உள்ளடக்கம் `{...}` பின்சாய்வு கொண்டதாகும்; இது அனுமதிக்கப்படவில்லை. ஒருவேளை நீங்கள் பின்சாய்வு கொண்ட பகுதியை ஏதேனும் மாறி மூலம் மாற்றலாம். எடுத்துக்காட்டாக, உங்களிடம் இது போன்ற f-சரம் இருப்பதாக வைத்துக்கொள்வோம்: f"{... 'hello\n' ...}" இதை பின்வருமாறு எழுதலாம் hello = 'hello\n' f"{... hello ...}"

source: You have written an f-string which has an unmatched `}`. If you want to print a single `}`, you need to write `}}` in the f-string; otherwise, you need to add an opening `{`.
ru: Вы написали f-строку, в которой есть непарная `}`. Если вы хотите вывести одну `}`, вам нужно написать `}}` в f-строке; в противном случае нужно добавить открывающую `{`.
ta: நீங்கள் ஒரு f-சரம் எழுதியுள்ளீர்கள், அதில் பொருந்தாத `}` உள்ளது. நீங்கள் ஒற்றை `}` ஐ அச்சிட விரும்பினால், f-சரத்தில் `}}` எழுத வேண்டும்; இல்லையெனில், நீங்கள் திறக்கும் `{` ஐச் சேர்க்க வேண்டும்.

source: You have written an f-string which has an unmatched `{`. If you want to print a single `{`, you need to write `{{` in the f-string; otherwise, you need to add a closing `}`.
ru: Вы написали f-строку, в которой есть непарная `}`. Если вы хотите вывести одну `}`, вам нужно написать `}}` в f-строке; в противном случае нужно добавить открывающую `{`.
ta: நீங்கள் ஒரு f-சரம் எழுதியுள்ளீர்கள், அதில் பொருந்தாத `{` உள்ளது. நீங்கள் ஒற்றை `{` ஐ அச்சிட விரும்பினால், f-சரத்தில் `{{` எழுத வேண்டும்; இல்லையெனில், நீங்கள் மூடும் `}` ஐச் சேர்க்க வேண்டும்.

source: I am guessing that you were writing a comprehension or a generator expression and forgot to include parentheses around tuples. As an example, instead of writing [i, i**2 for i in range(10)] you would need to write [(i, i**2) for i in range(10)]
ru: Предполагаю, что вы писали comprehension или генераторное выражение, но забыли поставить круглые скобки вокруг кортежей. В качестве примера, вместо того, чтобы написать [i, i**2 for i in range(10)] вам нужно написать [(i, i**2) for i in range(10)]
ta: நீங்கள் ஒரு புரிதல் அல்லது உருவாக்கி வெளிப்பாடு எழுதுகிறீர்கள் என்று நினைக்கிறேன், மேலும் மடங்குகளைச் சுற்றி அடைப்புக்குறிகளைச் சேர்க்க மறந்துவிட்டீர்கள். எடுத்துக்காட்டாக, [ஐ, ஐ**2 for ஐ in range(10)] எழுதுவதற்குப் பதிலாக, [(ஐ, ஐ**2) for ஐ in range(10)] என்று எழுத வேண்டும்

source: A `from __future__ import` statement changes the way Python interprets the code in a file. It must appear at the beginning of the file.
ru: Оператор `from __future__ import` изменяет способ, которым Python интерпретирует код в файле. Он должен находиться в начале файла.
ta: ஒரு கோப்பில் உள்ள குறியீட்டை பைதான் விளக்கும் விதத்தை `from __future__ import` அறிக்கை மாற்றுகிறது. இது கோப்பின் தொடக்கத்தில் தோன்ற வேண்டும்.

source: The available features are `{names}`.
ru: Доступными вариантами являются: `{names}`.
ta: கிடைக்கக்கூடிய அம்சங்கள் `{names}`.

source: When using a `from __future__ import` statement, you must import specific named features.
ru: При использовании оператора `from __future__ import`, вы должны импортировать элементы с определенными именами.
ta: `from __future__ import` அறிக்கையைப் பயன்படுத்தும் போது, குறிப்பிட்ட பெயரிடப்பட்ட அம்சங்களை நீங்கள் இறக்குமதி செய்ய வேண்டும்.

source: Instead of `{feature}`, perhaps you meant to import `{name}`.
ru: Возможно, вместо `{feature}` вы хотели импортировать `{name}`.
ta: `{feature}` என்பதற்குப் பதிலாக, நீங்கள் `{name}` ஐ இறக்குமதி செய்ய நினைத்திருக்கலாம்.

source: `{feature}` is not a valid feature of module `__future__`.
ru: `{feature}` не является допустимой функцией модуля `__future__`.
ta: `{feature}` என்பது `__future__` தொகுதியின் சரியான அம்சம் அல்ல.

source: You are using a generator expression, something of the form x for x in thing You must add parentheses enclosing that expression.
ru: Вы используете генераторное выражение, что-то типа x for x in thing Вы должны окружить его скобками.
ta: நீங்கள் உருவாக்கி வெளிப்பாட்டை, பின்வரும் வடிவத்தில் உள்ள ஏதாவது ஒன்றை பயன்படுத்துகிறீர்கள் ஐ for ஐ in பொருள் நீங்கள் அந்த வெளிப்பாட்டுடன் அடைப்புக்குறிக்குள் சேர்க்க வேண்டும்.

source: I suspect you wrote `from __future__ import braces` following someone else's suggestion. This will never work. Unlike other programming languages, Python's code block are defined by their indentation level, and not by using some curly braces, like `{...}`.
ru: Предполагаю, что вы написали `from __future__ import braces`, следуя чьему-то совету. Это никогда не сработает. В отличие от других языков программирования, в Python блок кода выделяется уровнем отступа, а не использованием фигурных скобок, например, `{...}`.
ta: வேறொருவரின் ஆலோசனையைப் பின்பற்றி நீங்கள் `from __future__ import braces` என்று எழுதியிருக்கிறீர்கள் என்று சந்தேகிக்கிறேன். இது ஒருபோதும் வேலை செய்யாது. பிற நிரலாக்க மொழிகளைப் போலல்லாமல், பைத்தானின் குறியீட்டுத் தொகுதி அவற்றின் உள்தள்ளல் மட்டத்தால் வரையறுக்கப்படுகிறது, மேலும் `{...}` போன்ற சில சுருள் அடைப்புக்குறிகளைப் பயன்படுத்தி அல்ல.

source: Did you use copy-paste?
ru: Вы использовали copy-paste?
ta: நீங்கள் நகல்-ஒட்டு பயன்படுத்தினீர்களா?

source: Python indicates that you used the unicode character `{bad_character}` which is not allowed.
ru: Python указывает, что вы использовали недопустимый символ юникода `{bad_character}`.
ta: அனுமதியில்லாத `{bad_character}` என்ற ஒருங்குறி எழுத்தைப் பயன்படுத்தியுள்ளீர்கள் என்பதை பைதான் குறிக்கிறது.

source: Python tells us that you have written an invalid number.
ru: Python сообщает, что вы записали недопустимое число.
ta: நீங்கள் தவறான எண்ணை எழுதியுள்ளீர்கள் என்று பைதான் எங்களிடம் கூறுகிறது.

source: However, I think that the problem might be the following.
ru: Однако я думаю, что проблема может заключаться в следующем.
ta: இருப்பினும், சிக்கல் பின்வருவனவாக இருக்கலாம் என்று நான் நினைக்கிறேன்.

source: I have no suggestion to offer to fix this problem.
ru: У меня нет предложений по устранению этой проблемы.
ta: இந்தச் சிக்கலைச் சரிசெய்வதற்கு என்னிடம் எந்த ஆலோசனையும் இல்லை.

source: The double star operator `**` is likely interpreted to mean that dict unpacking is to be used which is not allowed or does not make sense here.
ru: Double star оператор `**`, вероятно, будет интерпретирован как означающий, что используется dict-распаковка, что в данном случае недопустимо или не имеет смысла.
ta: இரட்டை விண்மீன் இயக்கி `**` என்பது அகராதி கட்டவிழ் பயன்படுத்தப்பட வேண்டும் என்று பொருள்படலாம், இது இங்கே அனுமதிக்கப்படாத அல்லது பொருளற்றது.

source: You cannot use the `*` operator to unpack the iteration variable in a comprehension.
ru: Вы не можете использовать оператор `*` для распаковки итерационной переменной в comprehension.
ta: புரிந்துகொள்ளுதலில் மறு செய்கை மாறியைத் திறக்க நீங்கள் `*` இயக்கியைப் பயன்படுத்த முடியாது.

source: The following statement has no syntax error: {statement}
ru: Следующее утверждение не будет содержать синтаксической ошибки: {new_statement}
ta: பின்வரும் அறிக்கையில் தொடரியல் பிழை இல்லை: {statement}

source: You have called a function repeating the same keyword argument (`{arg}`). Each keyword argument should appear only once in a function call.
ru: Вы вызвали функцию, повторяя одно и то же ключевое слово-аргумент (`{arg}`). Каждое ключевое слово-аргумент должно встречаться только один раз в вызове функции.
ta: அதே முக்கியச்சொல் வாதத்தை (`{arg}`) திரும்பத் திரும்பச் செய்யும் செயல்பாட்டை நீங்கள் அழைத்தீர்கள். ஒவ்வொரு முக்கியச்சொல் வாதமும் ஒரு செயல்பாட்டு அழைப்பில் ஒரு முறை மட்டுமே தோன்றும்.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}` on line {lineno}.
ru: Python сообщает нам, что закрывающая `{closing}` в последней показанной строке не совпадает с открывающей `{opening}` в строке {lineno}.
ta: கடைசியாகக் காட்டப்பட்டுள்ள வரியில் உள்ள மூடும் `{closing}`, வரி {lineno} இல் திறக்கும் `{opening}` உடன் பொருந்தவில்லை என்று பைதான் நமக்குச் சொல்கிறது.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}`.
ru: Python сообщает нам, что закрывающая `{closing}` в последней показанной строке не совпадает с открывающей `{opening}`.
ta: கடைசியாகக் காட்டப்பட்டுள்ள வரியில் உள்ள மூடும் `{closing}` திறப்பு `{opening}` உடன் பொருந்தவில்லை என்று பைதான் சொல்கிறது.

source: Did you forget something after `*`?
ru: Вы забыли что-то после `*`?
ta: `*` பிறகு எதையாவது மறந்துவிட்டீர்களா?

source: Assuming you were defining a function, you need to replace `*` by either `*arguments` or by `*, named_argument=value`.
ru: Если предположить, что вы определяете функцию, вам нужно заменить `*` на `*arguments` или на `*, named_argument=value`.
ta: நீங்கள் ஒரு செயல்பாட்டை வரையறுக்கிறீர்கள் என்று வைத்துக் கொண்டால், நீங்கள் `*` ஐ `*வாதங்கள்` அல்லது `*, name_argument=value` மூலம் மாற்ற வேண்டும்.

source: You assigned a value to the variable `{name}` before declaring it as a global variable.
ru: Вы присвоили значение переменной `{name}`, прежде чем объявить ее как глобальную.
ta: உலகளாவிய மாறியாக அறிவிக்கும் முன், `{name}` மாறிக்கு மதிப்பை ஒதுக்கியுள்ளீர்கள்.

source: Did you forget to add `nonlocal`?
ru: Вы забыли добавить `nonlocal`?
ta: `nonlocal` சேர்க்க மறந்துவிட்டீர்களா?

source: You assigned a value to the variable `{name}` before declaring it as a nonlocal variable.
ru: Вы присвоили значение переменной `{name}` прежде чем объявить ее как нелокальную.
ta: நீங்கள் `{name}` மாறிக்கு ஒரு மதிப்பை ஒதுக்கியுள்ளீர்கள், அதை உள்ளூர் அல்லாத மாறியாக அறிவிக்கும் முன்.

source: You are including the statement {newline} indicating that `{name}` is a variable defined outside a function. You are also using the same `{name}` as an argument for that function, thus indicating that it should be variable known only inside that function, which is the contrary of what `global` implied.
ru: Вы включаете утверждение {newline} указывая, что `{name}` является переменной, определенной вне функции. Вы также используете то же самое `{name}` в качестве аргумента для этой функции. тем самым указывая, что это должна быть переменная, которая видна только внутри этой функции, что противоположно тому, что подразумевает `global`.
ta: `{name}` என்பது ஒரு செயல்பாட்டிற்கு வெளியே வரையறுக்கப்பட்ட மாறி என்பதைக் குறிக்கும் {newline} அறிக்கையைச் சேர்த்துள்ளீர்கள். அந்தச் செயல்பாட்டிற்கான வாதமாக அதே `{name}` ஐப் பயன்படுத்துகிறீர்கள், இதனால் அது அந்தச் செயல்பாட்டிற்குள் மட்டுமே அறியப்படும் மாறியாக இருக்க வேண்டும் என்பதைக் குறிக்கிறது, இது `global` என்பதற்கு முரணானது.

source: You used `{name}` as a parameter for a function before declaring it also as a nonlocal variable: `{name}` cannot be both at the same time.
ru: Вы использовали `{name}` в качестве параметра функции прежде чем объявить его также как нелокальную переменную: `{name}` не может быть одновременно и тем, и другим.
ta: ஒரு செயல்பாட்டிற்கான அளவுருவாக `{name}` ஐப் பயன்படுத்தியுள்ளீர்கள், அதை உள்ளூர்அல்லாத மாறியாகவும் அறிவிக்கும் முன்: `{name}` இரண்டும் ஒரே நேரத்தில் இருக்க முடியாது.

source: You used the variable `{name}` before declaring it as a global variable.
ru: Вы использовали переменную `{name}` прежде чем объявить ее глобальной переменной.
ta: உலகளாவிய மாறியாக அறிவிக்கும் முன் `{name}` மாறியைப் பயன்படுத்தியுள்ளீர்கள்.

source: Did you forget to write `nonlocal` first?
ru: Вы забыли сначала написать `nonlocal`?
ta: முதலில் `nonlocal` என்று எழுத மறந்துவிட்டீர்களா?

source: You used the variable `{name}` before declaring it as a nonlocal variable.
ru: Вы использовали переменную `{name}` прежде чем объявить ее как нелокальную переменную.
ta: நீங்கள் `{name}` என்ற மாறியைப் பயன்படுத்தியுள்ளீர்கள், அதை உள்ளூர் அல்லாத மாறியாக அறிவிக்கும் முன்.

source: You declared the variable `{name}` as being a nonlocal variable but it cannot be found.
ru: Вы объявили переменную `{name}` как нелокальную, но она не может быть найдена.
ta: நீங்கள் `{name}` மாறியை உள்ளூர் அல்லாத மாறி என அறிவித்தீர்கள் ஆனால் அதைக் கண்டுபிடிக்க முடியவில்லை.

source: You used the nonlocal keyword at a module level. The nonlocal keyword refers to a variable inside a function given a value outside that function.
ru: Вы использовали ключевое слово nonlocal на уровне модуля. Ключевое слово nonlocal относится к переменной внутри функции, которой присвоено значение вне этой функции.
ta: நீங்கள் தொகுதி அளவில் nonlocal முக்கிய சொல்லைப் பயன்படுத்தியுள்ளீர்கள். nonlocal முக்கிய சொல் என்பது அந்தச் செயல்பாட்டிற்கு வெளியே ஒரு மதிப்பைக் கொடுக்கப்பட்ட ஒரு செயல்பாட்டிற்குள் இருக்கும் மாறியைக் குறிக்கிறது.

source: In Python, you can define functions with only positional arguments def test(a, b, c): ... or only keyword arguments def test(a=1, b=2, c=3): ... or a combination of the two def test(a, b, c=3): ... but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
ru: В Python вы можете определять функции только с позиционными аргументами def test(a, b, c): ... или только ключевыми аргументами def test(a=1, b=2, c=3): ... или их комбинацией def test(a, b, c=3): ... но при этом аргументы с ключевыми словами передаются после всех позиционных аргументов. Python говорит, что вы передали позиционные аргументы после ключевых.
ta: பைத்தானில், நீங்கள் பின்வருமாறு செயல்பாடுகளை வரையறுக்க முடியும், நிலை வாதங்கள் மட்டுமே கொண்டது def test(a, b, c): ... அல்லது முக்கியச்சொல் வாதங்கள் மட்டும் கொண்டது def test(a=1, b=2, c=3): ... அல்லது இந்த இரண்டின் ஒரு கலவையுடன் கொண்டது def test(a, b, c=3): ... ஆனால் அனைத்து நிலைவாதங்களுக்குப் பிறகு தோன்றும் முக்கியச்சொல் வாதங்களுடன். பைத்தானின் கூற்றுப்படி, நீங்கள் முக்கியச்சொல் வாதங்களுக்குப் பிறகு நிலை வாதங்களைப் பயன்படுத்துகிறீர்கள்.

source: I am guessing that you wanted to use an `except` statement with multiple exception types. If that is the case, you must surround them with parentheses.
ru: Предполагаю, что вы хотели использовать оператор `except` с несколькими типами исключений. Если это так, то вы должны окружить их круглыми скобками.
ta: நீங்கள் பல விதிவிலக்கு வகைகளைக் கொண்ட `except` அறிக்கையைப் பயன்படுத்த விரும்புகிறீர்கள் என்று நினைக்கிறேன். அப்படியானால், அடைப்புக்குறிக்குள் அவற்றைச் சுற்றி வர வேண்டும்.

source: In Python, you can call functions with only positional arguments test(1, 2, 3) or only keyword arguments test(a=1, b=2, c=3) or a combination of the two test(1, 2, c=3) but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
ru: В Python вы можете вызывать функции только с позиционными аргументами test(1, 2, 3) или только ключевыми аргументами test(a=1, b=2, c=3) или их комбинацией test(1, 2, c=3) но при этом ключевые аргументы идут после всех позиционных аргументов. Согласно Python, вы передали позиционные аргументы после ключевых.
ta: பைத்தானில், நீங்கள் பின்வருமாறு செயல்பாடுகளை அழைக்க முடியும், நிலை வாதங்கள் மட்டுமே கொண்டது test(1, 2, 3) அல்லது முக்கியச்சொல் வாதங்கள் மட்டும் கொண்டது test(a=1, b=2, c=3) அல்லது இந்த இரண்டின் ஒரு கலவையுடன் கொண்டது test(1, 2, c=3) ஆனால் அனைத்து நிலைவாதங்களுக்குப் பிறகு தோன்றும் முக்கியச்சொல் வாதங்களுடன். பைத்தானின் கூற்றுப்படி, நீங்கள் முக்கியச்சொல் வாதங்களுக்குப் பிறகு நிலை வாதங்களைப் பயன்படுத்துகிறீர்கள்.

source: Perhaps you need to type print({message}) In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
ru: Возможно, вам нужно напечатать print({message}) В старой версии Python `print` был ключевым словом. Теперь `print` -- это функция и для ее вызова нужно использовать круглые скобки.
ta: நீங்கள் பின்வருமாறு தட்டச்சு செய்ய வேண்டியிருக்கலாம் print({message}) பைத்தானின் பழைய பதிப்பில் `print` என்பது ஒரு முக்கிய சொல்லாகும். இப்போது, `print` என்பது ஒரு செயல்பாடு; அதை அழைக்க நீங்கள் அடைப்புக்குறிகளைப் பயன்படுத்த வேண்டும்.
