Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: You wrote the expression {fn_call} = {value} where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
ta: நீங்கள் பின்வரும் சொற்றொடரை எழுதியுள்ளீர்கள் {fn_call} = {value} இங்கு சம அடையாளத்தின் இடது பக்கத்தில் `{fn_call}` என்பது ஒரு செயல்பாட்டு அழைப்பாகும் அல்லது அதில் உள்ளடங்கும் மற்றும் இது ஒரு மாறியின் பெயர் அல்ல.

source: variable_name
ta: மாறி_பெயர்

source: You wrote something like import {function} from {module} instead of from {module} import {function}
ta: பின்வருமாறு ஒன்றை எழுதியுள்ளீர்கள் import {function} from {module} பின்வருவதற்குப் பதிலாக from {module} import {function}

source: Perhaps you misplaced a quote.
ta: ஒருவேளை நீங்கள் ஒரு மேற்கோளை தவறாகப் பயன்படுத்தியிருக்கலாம்.

source: There appears to be a Python identifier (variable name) immediately following a string. I suspect that you were trying to use a quote inside a string that was enclosed in quotes of the same kind.
ta: ஒரு சரத்தைத் தொடர்ந்து உடனடியாக பைதான் அடையாளங்காட்டி (மாறி பெயர்) இருப்பதாகத் தோன்றுகிறது. அதே வகையான மேற்கோள்களில் இணைக்கப்பட்ட ஒரு சரத்திற்குள் நீங்கள் மேற்கோளைப் பயன்படுத்த முயற்சிக்கிறீர்கள் என்று நான் சந்தேகிக்கிறேன்.

source: In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
ta: பைத்தானின் பழைய பதிப்பில், `print` என்பது ஒரு முக்கிய சொல்லாகும். இப்போது, `print` என்பது ஒரு செயல்பாடு; அதை அழைக்க நீங்கள் அடைப்புக்குறிகளைப் பயன்படுத்த வேண்டும்.

source: Did you mean `{new_line}`?
ta: `{new_line}` எனக் குறிப்பிடுகிறீர்களா?

source: You wrote a semi-colon, `;`, where a comma was expected.
ta: காற்புள்ளியை , எதிர்பார்க்கப்படும் இடத்தில் `;` என்ற அரைப்புள்ளியை எழுதியுள்ளீர்கள்.

source: You wrote semi-colons, `;`, where commas were expected.
ta: காற்புள்ளிகள் , எதிர்பார்க்கப்பட்ட இடத்தில் `;` என்ற அரைப்புள்ளிகளை எழுதியுள்ளீர்கள்.

source: It looks like you used an invalid character (`{character}`) in an octal number. Octal numbers are base 8 integers that only use the symbols `0` to `7` to represent values. In Python, hexadecimal numbers start with either `0o` or `0O`, (the digit zero followed by the letter `o`) followed by the characters used to represent the value of that integer.
ta: நீங்கள் எண்ம எண்ணில் தவறான எழுத்தை (`{character}`) பயன்படுத்தியது போல் தெரிகிறது. எண்ம எண்கள் அடிப்படை 8 முழு எண்களாகும், அவை மதிப்புகளைக் குறிக்க `0` முதல் `7` வரையிலான குறியீடுகளை மட்டுமே பயன்படுத்துகின்றன. பைத்தானில், எண்ம எண்கள் `0o` அல்லது `0O`, (இலக்க சுழியத்தைத் தொடர்ந்து `o` என்ற எழுத்து) உடன் தொடங்கும், அதைத் தொடர்ந்து வரும் எழுத்துக்கள் அந்த முழு எண்ணின் மதிப்பைக் குறிக்கப் பயன்படுத்தப்படும்.

source: You cannot have spaces in identifiers (variable names).
ta: அடையாளங்காட்டிகளில் (மாறி பெயர்கள்) நீங்கள் இடைவெளிகளைக் கொண்டிருக்க முடியாது.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, before the position indicated by ^.
ta: ^ஆல் சுட்டிக்காட்டப்பட்ட நிலைக்கு முன், ஒரு மடங்கில் உள்ள உருப்படிகளுக்கு இடையில் அல்லது செயல்பாட்டு வாதங்களுக்கு இடையில் நீங்கள் காற்புள்ளியை மறந்துவிட்டீர்கள்.

source: It is possible that you forgot a comma between items in a list before the position indicated by ^.
ta: ^ ஆல் குறிப்பிடப்பட்ட நிலைக்கு முன் பட்டியலில் உள்ள உருப்படிகளுக்கு இடையே உள்ள காற்புள்ளியை நீங்கள் மறந்துவிட்டீர்கள்.

source: It is possible that you forgot a comma between items in a set or dict before the position indicated by ^.
ta: ^ ஆல் குறிப்பிடப்பட்ட நிலைக்கு முன் ஒரு தொகுப்பு அல்லது அகராதியில் உள்ள உருப்படிகளுக்கு இடையே உள்ள காற்புள்ளியை நீங்கள் மறந்துவிட்டீர்கள்.

source: Perhaps you meant {line}
ta: ஒருவேளை நீங்கள் பின்வருமாறு சொல்கிறீர்கள் {line}

source: Changes the prompt style to be used in the console.
ta: கன்சோலில் பயன்படுத்த வேண்டிய ப்ராம்ட் ஸ்டைலை மாற்றுகிறது.

source: Use True (default) or False to set the debug flag.
ta: பிழைத்திருத்தக் கொடியை அமைக்க True (இயல்புநிலை) அல்லது False என்பதைப் பயன்படுத்தவும்.
