Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: Note that arguments of `print` must be separated by commas.
ru: Обратите внимание, что аргументы функции `print` должны быть разделены запятыми.
ta: `print` வாதங்கள் காற்புள்ளிகளால் பிரிக்கப்பட வேண்டும் என்பதை நினைவில் கொள்ளவும்.

source: Did you mean `print({message})`?
ru: Вы имели в виду `print({message})`?
ta: நீங்கள் `print({message})` எனக் குறிப்பிடுகிறீர்களா?

source: You can only use a `return` statement inside a function or method.
ru: Вы можете использовать оператор `return` только внутри функции или метода.
ta: ஒரு செயல்பாடு அல்லது முறைக்குள் மட்டுமே நீங்கள் `return` அறிக்கையைப் பயன்படுத்த முடியும்.

source: A star assignment must be of the form: ... *name = list_or_tuple
ru: 'Звёздное' присваивание должно быть типа: ... *name = list_or_tuple
ta: ஒரு விண்மீன் ஒதுக்கீடு இந்த வடிவத்தில் இருக்க வேண்டும்: ... *பெயர் = பட்டியல்_அல்லது_மடங்கு

source: It looks like you tried to use a starred expression as a dict value; this is not allowed.
ru: Два оператора, `{first}` и `{second}`, следуют друг за другом. Так нельзя. Похоже, что вы пытались использовать выражение со звездочкой в качестве значения словаря, это недопустимо.
ta: நட்சத்திரமிடப்பட்ட வெளிப்பாட்டை அகராதி மதிப்பாகப் பயன்படுத்த முயற்சித்தது போல் தெரிகிறது; இது அனுமதிக்கப்படவில்லை.

source: Your code is too complex for Python: you need to reduce the number of indented code blocks contained inside other code blocks.
ru: Ваш код слишком сложен для Python: вам нужно уменьшить количество блоков кода с отступами, содержащихся внутри других блоков кода.
ta: உங்கள் குறியீடு பைத்தானுக்கு மிகவும் சிக்கலானது: பிற குறியீடு தொகுதிகளுக்குள் உள்ள உள்தள்ளப்பட்ட குறியீடு தொகுதிகளின் எண்ணிக்கையை நீங்கள் குறைக்க வேண்டும்.

source: Your code is too complex for Python: you need to reduce the number of parentheses contained inside other parentheses.
ru: Ваш код слишком сложен для Python: вам нужно уменьшить количество круглых скобок содержащихся внутри других круглых скобок.
ta: உங்கள் குறியீடு பைத்தானுக்கு மிகவும் சிக்கலானது: பிற அடைப்புக்குறிக்குள் உள்ள அடைப்புக்குறிகளின் எண்ணிக்கையை நீங்கள் குறைக்க வேண்டும்.

source: Python indicates that you need to surround an expression ending with a comma by parentheses.
ru: Python указывает, что вам нужно окружить выражение заканчивающееся запятой, круглыми скобками.
ta: அடைப்புக்குறிக்குள் காற்புள்ளியுடன் முடிவடையும் வெளிப்பாட்டைச் சுற்றி வர வேண்டும் என்பதை பைதான் குறிக்கிறது.

source: Perhaps you meant to write `{new_statement}`
ru: Возможно, вы хотели написать `{new_statement}`
ta: ஒருவேளை நீங்கள் `{new_statement}` என்று எழுத நினைத்திருக்கலாம்

source: However, I suspect that you wrote the keyword `{boolean}` by mistake.
ru: Подозреваю, что ключевое слово `{boolean}` вы написали по ошибке.
ta: இருப்பினும், `{boolean}` என்ற முக்கிய சொல்லை நீங்கள் தவறுதலாக எழுதிவிட்டீர்கள் என்று சந்தேகிக்கிறேன்.

source: The Python keyword `{boolean}` can only be used for boolean expressions.
ru: Ключевое слово Python `{boolean}` можно использовать только для булевых выражений.
ta: பைதான் முக்கியச்சொல் `{boolean}` பூலியன் வெளிப்பாடுகளுக்கு மட்டுமே பயன்படுத்தப்படும்.

source: However, if you remove the last comma, there will be no syntax error.
ru: Если убрать последнюю запятую, синтаксической ошибки не будет.
ta: இருப்பினும், கடைசி காற்புள்ளியை நீக்கினால், தொடரியல் பிழை இருக்காது.

source: I have no additional suggestion to offer. Please feel free to report this case.
ru: У меня нет никаких дополнительных предложений. Пожалуйста, не стесняйтесь сообщить об этом случае.
ta: நான் வழங்குவதற்கு கூடுதல் பரிந்துரை எதுவும் இல்லை. இந்த வழக்கை தயங்காமல் புகாரளிக்கவும்.

source: You are using the continuation character `\` outside of a string, and it is followed by some other character(s).
ru: Вы используете символ продолжения `\` вне строки и за ним следует какой-то другой символ (символы).
ta: நீங்கள் ஒரு சரத்திற்கு வெளியே `\` என்ற தொடர்ச்சி எழுத்தைப் பயன்படுத்துகிறீர்கள், அதைத் தொடர்ந்து வேறு சில எழுத்து(கள்) வருகின்றன.

source: I am guessing that you wanted to divide by the number {number} and wrote \ instead of /.
ru: Предполагаю, что вы хотели разделить на число {number} и написали \ вместо /.
ta: நீங்கள் எண்ணை {number} ஆல் வகுக்க விரும்பி, / என்பதற்குப் பதிலாக \ என்று எழுதியிருக்கிறீர்கள் என்று நினைக்கிறேன்.

source: Did you mean to divide by {number}?
ru: Вы хотели разделить на {number}?
ta: {number} வகுக்க வேண்டுமா?

source: I am guessing that you forgot to enclose some content in a string.
ru: Полагаю, вы забыли закавычить строку.
ta: ஒரு சரத்தில் சில உள்ளடக்கத்தை இணைக்க மறந்துவிட்டீர்கள் என்று நினைக்கிறேன்.

source: Python tells us that it reached the end of the file and expected more content.
ru: Python сообщает нам, что он достиг конца файла и ожидает дальнейшего контента.
ta: பைதான் கோப்பின் முடிவை அடைந்து மேலும் உள்ளடக்கத்தை எதிர்பார்க்கிறது என்று கூறுகிறது.

source: I will attempt to be give a bit more information.
ru: Постараюсь дать более информативное пояснение.
ta: நான் இன்னும் கொஞ்சம் தகவல் கொடுக்க முயற்சிப்பேன்.

source: I suspect that you wrote a string that contains one backslash character, `\` followed by an uppercase `U` and some more characters. Python likely interpreted this as indicating the beginning of what is known as an escape sequence for special unicode characters. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the string, or replace `\U`, by `\\U`.
ru: Предполагаю, что вы написали строку, которая содержит один символ обратной косой черты, `\`, за которым следует заглавная буква `U` и еще несколько символов. Python, скорее всего, интерпретировал это как начало того, что известно как управляющая последовательность для специальных символов Юникода. Чтобы решить эту проблему, напишите так называемую 'необработанную строку', добавив букву `r` в качестве префикса перед строкой, либо замените `\U` на `\\\U`.
ta: ஒரு பின்சாய்வு எழுத்து, `\` அதைத் தொடர்ந்து பெரிய எழுத்து `U` மற்றும் இன்னும் சில எழுத்துகளைக் கொண்ட சரத்தை நீங்கள் எழுதியிருக்கிறீர்கள் என்று நான் சந்தேகிக்கிறேன். சிறப்பு ஒருங்குறி எழுத்துகளுக்கான விடுபடு தொடர் என அழைக்கப்படும் தொடக்கத்தை பைதான் இது குறிக்கிறது. சிக்கலைத் தீர்க்க, சரத்தின் முன் முன்னொட்டாக `r` என்ற எழுத்தைச் சேர்ப்பதன் மூலம் 'மூல சரம்' என்று அழைக்கப்படுவதை எழுதவும் அல்லது `\U` ஐ `\\U` ஆல் மாற்றவும்.

source: The closing {bracket} on line {linenumber} does not match anything.
ru: Закрывающая {bracket} в строке {linenumber} ничему не соответствует.
ta: வரி {linenumber} இல் மூடும் {bracket} எதனுடனும் பொருந்தவில்லை.

source: Perhaps you forgot a closing quote.
ru: Возможно, вы забыли закрыть кавычки.
ta: ஒருவேளை நீங்கள் ஒரு இறுதி மேற்கோளை மறந்துவிட்டீர்கள்.

source: Inside the f-string `{fstring}`, you have another string, which starts with either a single quote (') or double quote ("), without a matching closing one.
ru: Внутри f-строки `{fstring}` у вас есть другая строка, которая начинается либо с одинарной кавычки (') или двойной кавычки ("), без совпадающей закрывающей кавычки.
ta: f-சரம் `{fstring}` இன் உள்ளே, உங்களிடம் மற்றொரு சரம் உள்ளது, இது ஒரு மேற்கோளுடன் (') அல்லது இரட்டை மேற்கோளில் (") தொடங்கும் ஒரு பொருத்தும் மூடுதல் இல்லாமல்.

source: You can only use a `yield` statement inside a function.
ru: Вы можете использовать оператор `yield` только внутри функции.
ta: ஒரு செயல்பாட்டிற்குள் மட்டுமே நீங்கள் `yield` அறிக்கையை பயன்படுத்த முடியும்.

source: This is a message that was added in Python 3.9 to prevent redefining `__peg_parser__`. It should not be present in other versions.
ru: Это сообщение было добавлено в Python 3.9 чтобы предотвратить переопределение `__peg_parser__`. Оно не должно присутствовать в других версиях.
ta: இது `__peg_parser__` என்பதை மறுவரையறை செய்வதைத் தடுக்க பைதான் 3.9 இல் சேர்க்கப்பட்ட செய்தி. இது மற்ற பதிப்புகளில் இருக்கக்கூடாது.

source: The closing {bracket} on line {close_lineno} does not match the opening {open_bracket} on line {open_lineno}.
ru: Закрывающая {bracket} в строке {close_lineno} не совпадает с открывающей {open_bracket} в строке {open_lineno}.
ta: {close_lineno} வரியில் உள்ள மூடும் {bracket}, {open_lineno} வரியில் திறக்கும் {open_bracket} உடன் பொருந்தவில்லை.

source: Did you mean to write `...`?
ru: Вы хотели написать `...`?

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `>>>`, should not be included in your code.
ru: Похоже, что вы скопипастили вывод интерпретатора. Приглашение интерпретатора '>>>', не должно быть включено в ваш код.
ta: ஊடாடும் மொழிபெயர்ப்பாளரிடமிருந்து நீங்கள் குறியீட்டை நகலெடுத்து ஒட்டியது போல் தெரிகிறது. பைதான் உடனுக்குடன், `>>>`, உங்கள் குறியீட்டில் சேர்க்கப்படக்கூடாது.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `...`, should not be included in your code.
ru: Похоже, что вы скопипастили вывод интерпретатора. Вывод интерпретатора '...' не должен быть включен в ваш код.
ta: ஊடாடும் மொழிபெயர்ப்பாளரிடமிருந்து நீங்கள் குறியீட்டை நகலெடுத்து ஒட்டியது போல் தெரிகிறது. பைதான் உடனுக்குடன், `...`, உங்கள் குறியீட்டில் சேர்க்கப்படக்கூடாது.

source: You should not use the backquote character.
ru: Не следует использовать символ обратной кавычки.
ta: பின்மேற்கோள் எழுத்தை நீங்கள் பயன்படுத்தக்கூடாது.

source: You are using the backquote character. Either you meant to write a single quote, ', or copied Python 2 code; in this latter case, use the function `repr(x)`.
ru: Вы используете символ обратной кавычки. Либо вы хотели написать одинарную кавычку, либо скопировали код Python 2. В последнем случае используйте функцию `repr(x)`.
ta: நீங்கள் பின்மேற்கோள் எழுத்தைப் பயன்படுத்துகிறீர்கள். நீங்கள் ஒற்றை மேற்கோளை எழுத வேண்டும், ', அல்லது பைதான் 2 குறியீட்டை நகலெடுத்திருக்க வேண்டும்; இந்த பிந்தைய வழக்கில், `repr(x)` செயல்பாட்டைப் பயன்படுத்தவும்.

source: You forgot to add a condition.
ru: Вы забыли добавить условие.
ta: நிபந்தனையைச் சேர்க்க மறந்துவிட்டீர்கள்.

source: An `if` statement requires a condition: if condition: ...
ru: Оператор `if` требует условия: if condition: ...
ta: `if` அறிக்கைக்கு ஒரு நிபந்தனை தேவை: if நிபந்தனை: ...

source: A `while` loop requires a condition: while condition: ...
ru: Для цикла `while` требуется условие: while condition: ...
ta: ஒரு `while` சுழலுக்கு ஒரு நிபந்தனை தேவை: while நிபந்தனை: ...

source: A `for` loop requires at least 3 more terms.
ru: Для цикла `for` требуются как минимум 3 элемента.
ta: ஒரு `for` சுழலூக்கு குறைந்தது 3 விதிமுறைகள் தேவை.

source: A `for` loop is an iteration over a sequence: for element in sequence: ...
ru: Цикл `for` -- это итерация по последовательности: for element in sequence: ...
ta: ஒரு `for` சுழல் என்பது ஒரு வரிசையின் மீள் மறு செய்கை: for உறுப்பு in வரிசை: ...

source: A class needs a name.
ru: Классу необходимо задать имя.
ta: ஒரு வகுப்பிற்கு ஒரு பெயர் தேவை.

source: A `class` statement requires a name: class SomeName: ...
ru: Утверждение `class` требует указания имени: class SomeName: ...
ta: ஒரு `வகுப்பு` அறிக்கைக்கு ஒரு பெயர் தேவை: class வகுப்புப்பெயர்: ...

source: You cannot use the Python keyword `{word}` as an attribute.
ru: Нельзя использовать ключевое слово Python `{word}` в качестве атрибута.
ta: நீங்கள் பைதான் முக்கிய சொல்லான `{word}` ஐ பண்புக்கூறாகப் பயன்படுத்த முடியாது.

source: `{word}` cannot be used as an attribute.
ru: `{word}` нельзя использовать в качестве атрибута.
ta: `{word}` ஐ பண்புக்கூறாகப் பயன்படுத்த முடியாது.

source: Perhaps you meant to write `elif`.
ru: Возможно, вы хотели написать `elif`.
ta: ஒருவேளை நீங்கள் 'elif' என்று எழுத நினைத்திருக்கலாம்.

source: You likely meant to use Python's `elif` keyword but wrote `{name}` instead.
ru: Скорее всего, вы хотели использовать ключевое слово Python `elif`, но вместо него написали `{name}`.
ta: நீங்கள் பைத்தானின் `elif` முக்கிய சொல்லைப் பயன்படுத்த நினைத்திருக்கலாம், ஆனால் அதற்குப் பதிலாக `{name}` என்று எழுதியிருக்கலாம்.

source: Did you mean `from {module} import {function}`?
ru: Вы имели в виду `from {module} import {function}`?
ta: `from {module} import {function}` என்று நீங்கள் சொன்னீர்களா?

source: You wrote something like import {function} from {module} instead of from {module} import {function}
ru: Вы написали import {function} from {module} вместо from {module} import {function}

source: The augmented assignment operator is not allowed in Python version {version}.
ru: Дополненный оператор присваивания не разрешен в Python версии {version}.
ta: பைதான் பதிப்பில் {version} விரிவாக்கப்பட்ட ஒதுக்கல் இயக்கி அனுமதிக்கப்படவில்லை.

source: You appear to be using the operator `:=`, sometimes called the walrus operator. This operator requires the use of Python 3.8 or newer. You are using version {version}.
ru: Похоже, что вы используете оператор `:=`, иногда называемый моржовым оператором. Этот оператор требует использования Python 3.8 или более новой версии. Вы же используете версию {version}.
ta: நீங்கள் `:=` இயக்கியைப் பயன்படுத்துகிறீர்கள், சில சமயங்களில் கடற்குதிரை இயக்கி என்று அழைக்கப்படுகிறது. இந்த இயக்கிக்கு Python 3.8 அல்லது புதியது தேவை. நீங்கள் பதிப்பு {version} ஐப் பயன்படுத்துகிறீர்கள்.

source: Did you write operators in an incorrect order?
ru: Операторы расположены в правильном порядке?
ta: இயக்கிகளை தவறான வரிசையில் எழுதினீர்களா?

source: It looks like you wrote two operators (`{first}` and `{second}`) in the wrong order: `{wrong}` instead of `{correct}`.
ru: Похоже, что вы написали два оператора (`{first}` и `{second}`). в неправильном порядке: `{wrong}` вместо `{correct}`.
ta: நீங்கள் இரண்டு இயக்கிகளை (`{first}` மற்றும் `{second}`) தவறான வரிசையில் எழுதியது போல் தெரிகிறது: `{correct}` என்பதற்குப் பதிலாக `{wrong}`.

source: You wrote three equal signs in a row which is allowed in some programming languages, but not in Python. To check if two objects are equal, use two equal signs, `==`; to see if two names represent the exact same object, use the operator `is`.
ru: Вы написали три знака равенства подряд, что допускается в некоторых языках программирования, но не в Python. Чтобы проверить, равны ли два объекта, используйте два знака равенства, `==`, а чтобы проверить, представляют ли два имени один и тот же объект, используйте оператор `is`.
ta: நீங்கள் ஒரு வரிசையில் மூன்று சமமான அடையாளங்களை எழுதியுள்ளீர்கள், இது சில நிரலாக்க மொழிகளில் அனுமதிக்கப்படுகிறது, ஆனால் பைத்தானில் இல்லை. இரண்டு பொருள்கள் சமமாக உள்ளதா என்பதைச் சரிபார்க்க, இரண்டு சம அடையாளங்களைப் பயன்படுத்தவும், `==`; இரண்டு பெயர்கள் ஒரே பொருளைக் குறிக்கின்றனவா என்பதைப் பார்க்க, `is` இயக்கியைப் பயன்படுத்தவும்.

source: Did you mean to use `is` instead of `===`?
ru: Вы хотели использовать `is` вместо `===`?
ta: `===` என்பதற்குப் பதிலாக `is` ஐப் பயன்படுத்த விரும்புகிறீர்களா?

source: You cannot have write the same operator, `{op}`, twice in a row. Perhaps you wrote one of them by mistake or forgot to write something between them.
ru: Вы не должны использовать один и тот же оператор `{op}` два раза подряд. Возможно, вы написали один из них по ошибке или забыли поместить что-то между ними.
ta: நீங்கள் ஒரே இயக்கியை, `{op}`, ஒரு வரிசையில் இரண்டு முறை எழுத முடியாது. ஒருவேளை நீங்கள் அவற்றில் ஒன்றை தவறுதலாக எழுதியிருக்கலாம் அல்லது அவற்றுக்கிடையே ஏதாவது எழுத மறந்துவிட்டீர்கள்.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. It looks like you tried to use a starred expression as a dict value; this is not allowed.
ru: Два оператора, `{first}` и `{second}`, следуют друг за другом. Так нельзя. Похоже, что вы пытались использовать выражение со звездочкой в качестве значения словаря, это недопустимо.
ta: நீங்கள் இந்த இரண்டு இயக்கிகள், `{first}` மற்றும் `{second}`, ஒருவரையொருவர் பின்பற்ற முடியாது. நீங்கள் விண்மீனிடப்பட்ட வெளிப்பாட்டை அகராதி மதிப்பாகப் பயன்படுத்த முயற்சித்தது போல் தெரிகிறது; இது அனுமதிக்கப்படவில்லை.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. Perhaps you wrote one of them by mistake or forgot to write something between them.
ru: Так нельзя: два оператора, `{first}` и `{second}` следуют друг за другом. Возможно, вы написали один из них по ошибке или забыли поместить что-то между ними.
ta: நீங்கள் இந்த இரண்டு இயக்கிகள், `{first}` மற்றும் `{second}`, ஒருவரையொருவர் பின்பற்ற முடியாது. ஒருவேளை நீங்கள் அவற்றில் ஒன்றை தவறுதலாக எழுதியிருக்கலாம் அல்லது அவற்றுக்கிடையே ஏதாவது எழுத மறந்துவிட்டீர்கள்.

source: Or perhaps you included a space by mistake between the two operators and meant to write `{oper}` as a single operator.
ru: Или, возможно, вы по ошибке поставили пробел между двумя операторами и хотели написать `{oper}` как один оператор.
ta: அல்லது இரண்டு இயக்கிகளுக்கு இடையே தவறுதலாக இடைவெளியைச் சேர்த்துவிட்டு, `{oper}` என்பதை ஒற்றை ஆபரேட்டராக எழுத நினைத்திருக்கலாம்.

source: Did you mean to use `=`?
ru: Вы хотели использовать `=`?
ta: `=` ஐப் பயன்படுத்த விரும்புகிறீர்களா?

source: You use the augmented assignment operator `:=` where the normal assignment operator `=` was required.
ru: Вы используете дополненный оператор присваивания `:=` там, где требуется обычный оператор присваивания `=`.
ta: சாதாரண ஒதுக்கல் இயக்கி `=` தேவைப்படும் இடத்தில் `:=` அதிகரிக்கப்பட்ட ஒதுக்கல் இயக்கியைப் பயன்படுத்துகிறீர்கள்.

source: The following statement would not contain a syntax error: {new_statement}
ru: Следующее утверждение не содержит синтаксической ошибки: {new_statement}
ta: பின்வரும் அறிக்கையில் தொடரியல் பிழை இருக்காது: {new_statement}

source: Perhaps you needed `==` or `:=` instead of `=`.
ru: Возможно, правильнее использовать `==` или `:=` вместо `=`.
ta: ஒருவேளை உங்களுக்கு `=` என்பதற்குப் பதிலாக `==` அல்லது `:=` தேவைப்படலாம்.

source: You used an assignment operator `=`; perhaps you meant to use an equality operator, `==`, or the walrus operator `:=`.
ru: Вы использовали оператор присваивания `=`; но, возможно, хотели использовать оператор равенства `==` или моржовый оператор `:=`.
ta: நீங்கள் ஒரு ஒதுக்கல் இயக்கியைப் பயன்படுத்தியுள்ளீர்கள் `=`; ஒருவேளை நீங்கள் சமத்துவ இயக்கி, `==` அல்லது கடற்குதிரை இயக்கி `:=` ஐப் பயன்படுத்த நினைத்திருக்கலாம்.

source: It looks as if you are attempting to use pip to install a module. `pip` is a command that needs to run in a terminal, not from a Python interpreter.
ru: Похоже, что вы пытаетесь использовать pip для установки модуля. `pip` - это команда, которую нужно запускать в терминале, а не из консоли интерпретатора Python.
ta: நீங்கள் ஒரு தொகுதியை நிறுவ பிப்பைப் பயன்படுத்த முயற்சிப்பது போல் தெரிகிறது. `pip` என்பது முனையத்தில் இயங்க வேண்டிய கட்டளை, பைதான் மொழிபெயர்ப்பாளரிடமிருந்து அல்ல.

source: Pip cannot be used in a Python interpreter.
ru: Pip нельзя использовать в консоли интерпретатора Python.
ta: பைதான் மொழிபெயர்ப்பாளரில் பிப்பைப் பயன்படுத்த முடியாது.

source: I am guessing that you are attempting to use Python to run a program. You must do so from a terminal and not from a Python interpreter.
ru: Предполагаю, что вы пытаетесь использовать Python для запуска программы. Вы должны делать это из терминала, а не из интерпретатора Python.
ta: நீங்கள் ஒரு நிரலை இயக்க பைத்தானைப் பயன்படுத்த முயற்சிக்கிறீர்கள் என்று நினைக்கிறேன். நீங்கள் ஒரு முனையத்திலிருந்து அவ்வாறு செய்ய வேண்டும், பைதான் மொழிபெயர்ப்பாளரிடமிருந்து அல்ல.

source: You cannot have a dot `.` followed by `{bracket}`.
ru: За точкой `.` не может следовать `{bracket}`.
ta: உங்களிடம் `.` புள்ளியை தொடர்ந்து `{bracket}` இருக்க முடியாது.

source: Perhaps you need to replace the dot by a comma.
ru: Возможно, вам следует заменить точку запятой.
ta: ஒருவேளை நீங்கள் புள்ளியை காற்புள்ளியால் மாற்ற வேண்டும்.

source: It looks like you are trying to raise an exception using Python 2 syntax.
ru: Похоже, что вы пытаетесь вызвать исключение, используя синтаксис Python 2.
ta: நீங்கள் Python 2 தொடரியல் பயன்படுத்தி விதிவிலக்கை உருவாக்க முயற்சிப்பது போல் தெரிகிறது.

source: Did you forget a colon `:`?
ru: Вы забыли двоеточие `:`?
ta: `:` என்ற முக்காற்புள்ளியை மறந்துவிட்டீர்களா?

source: You wrote a `{for_while}` loop but forgot to add a colon `:` at the end
ru: Вы написали цикл `{for_while}`, но забыли добавить двоеточие `:` в конце
ta: நீங்கள் `{for_while}` வளையத்தை எழுதினீர்கள் ஆனால் இறுதியில் `:` என்ற முக்காற்புள்ளியைச் சேர்க்க மறந்துவிட்டீர்கள்

source: You wrote a statement beginning with `{name}` but forgot to add a colon `:` at the end.
ru: Вы написали утверждение, начинающееся с `{name}`, но забыли добавить двоеточие `:` в конце.
ta: நீங்கள் `{name}` என்று தொடங்கும் அறிக்கையை எழுதியுள்ளீர்கள் ஆனால் இறுதியில் `:` என்ற முக்காற்புள்ளியைச் சேர்க்க மறந்துவிட்டீர்கள்.

source: You wrote a semicolon, `;`, where a comma was expected.
ru: Вы поставили точку с запятой `;` там, где должна быть только запятая.

source: You wrote semicolons, `;`, where commas were expected.
ru: Вы написали точки с запятой `;` там, где должны быть только запятые.

source: Did you mean to write commas?
ru: Вы хотели поставить запятые?
ta: காற்புள்ளிகளை எழுத வேண்டும் என்று சொன்னீர்களா?

source: You wrote a semicolon, `;`, where a colon was expected.
ru: Вы поставили точку с запятой `;` там, где должна быть только запятая.

source: Did you mean to write a colon?
ru: Вы забыли поставить двоеточие?

source: Did you made a mistake in writing an hexadecimal integer?
ru: Допустили ошибку при записи шестнадцатеричного числа?
ta: பதின்ம முழு எண்ணை எழுதுவதில் தவறிழைத்தீர்களா?

source: It looks like you used an invalid character (`{character}`) in an hexadecimal number. Hexadecimal numbers are base 16 integers that use the symbols `0` to `9` to represent values 0 to 9, and the letters `a` to `f` (or `A` to `F`) to represent values 10 to 15. In Python, hexadecimal numbers start with either `0x` or `0X`, followed by the characters used to represent the value of that integer.
ru: Похоже, что вы использовали недопустимый символ (`{character}`) в шестнадцатеричном числе. Шестнадцатеричные числа - это целые числа с основанием 16, в которых используются символы от `0` до `9` для обозначения значений от 0 до 9, и буквы от `a` до `f` (или от `A` до `F`) для представления значений от 10 до 15. В Python шестнадцатеричные числа начинаются с `0x` или `0X`, за которым следуют символы, используемые для представления значения этого целого числа.
ta: நீங்கள் பதின்ம எண்ணில் தவறான எழுத்தை (`{character}`) பயன்படுத்தியிருப்பது போல் தெரிகிறது. பதின்ம எண்கள் அடிப்படை 16 முழு எண்களாகும், 0 முதல் 9 வரை மதிப்பை குறிக்க `0` முதல் `9` , மற்றும் 10 முதல் 15 வரை மதிப்புகளைக் குறிக்க `a` முதல் `f` (அல்லது `A` முதல் `F`) வரையிலான குறியீடுகளை பயன்படுத்துகின்றன. பைத்தானில், பதின்ம எண்கள் `0x` அல்லது `0X` உடன் தொடங்கும், அதைத் தொடர்ந்து வரும் எழுத்துக்கள் அந்த முழு எண்ணின் மதிப்பைக் குறிக்கப் பயன்படுத்தப்படும்.

source: Did you made a mistake in writing an octal integer?
ru: Не допустили ли вы ошибки при записи восьмеричного числа?
ta: எண் முழு எண்ணை எழுதுவதில் தவறு செய்துவிட்டீர்களா?

source: Valid names cannot begin with a number.
ru: Корректные имена не могут начинаться с цифры.
ta: சரியான பெயர்கள் எண்ணுடன் தொடங்க முடியாது.

source: Did you mean `{number}j`?
ru: Вы имели в виду `{number}j`?
ta: நீங்கள் `{number}j` என்று கூறுகிறீர்களா?

source: Perhaps you thought that `i` could be used to represent the square root of `-1`. In Python, the symbol used for this is `j` and the complex part is written as `some_number` immediately followed by `j`, with no spaces in between. Perhaps you meant to write `{number}j`.
ru: Возможно, вы подумали, что `i` можно использовать для представления квадратного корня из `-1`. В Python для этого используется символ `j`, а комплексная часть записывается как `some_number`, сразу же за которым следует `j`, без пробелов между ними. Возможно, вы хотели написать `{number}j`.
ta: `-1` இன் வர்க்க மூலத்தைக் குறிக்க `i` பயன்படுத்தப்படலாம் என்று நீங்கள் நினைத்திருக்கலாம். பைத்தானில், இதற்குப் பயன்படுத்தப்படும் குறியீடு `j` மற்றும் சிக்கலான பகுதி `சில_எண்` என எழுதப்பட்ட உடனே `j`, இடையில் இடைவெளிகள் இல்லாமல். ஒருவேளை நீங்கள் `{number}j` என்று எழுத நினைத்திருக்கலாம்.
