Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: A `TypeError` is usually caused by trying to combine two incompatible types of objects, by calling a function with the wrong type of object, or by trying to do an operation not allowed on a given type of object.
ru: `TypeError` обычно возникает при попытке объединить два несовместимых типа объектов, вызовом функции с объектом неправильного типа, или при попытке выполнить операцию, недопустимую для данного типа объекта.
ta: ஒரு வகைப்பிழை `TypeError` என்பது பொதுவாக பொருந்தாத இரண்டு வகையான பொருள்களை இணைக்க முயற்சிப்பதாலோ, ஒரு செயல்பாட்டை தவறான வகைப் பொருளுடன் அழைப்பதாலோ அல்லது கொடுக்கப்பட்ட வகைப் பொருளில் அனுமதிக்கப்படாத செயலைச் செய்ய முயற்சிப்பதாலோ ஏற்படுகிறது.

source: A `ValueError` indicates that a function or an operation received an argument of the right type, but an inappropriate value.
ru: `ValueError` указывает на то, что функция или операция получила аргумент правильного типа, но несоответствующего значения.
ta: ஒரு மதிப்புப்பிழை `ValueError` என்பது ஒரு செயல்பாடு அல்லது செயல்பாடு சரியான வகையின் வாதத்தைப் பெற்றது, ஆனால் ஒரு பொருத்தமற்ற மதிப்பைக் குறிக்கிறது.

source: In Python, variables that are used inside a function are known as local variables. Before they are used, they must be assigned a value. A variable that is used before it is assigned a value is assumed to be defined outside that function; it is known as a `global` (or sometimes `nonlocal`) variable. You cannot assign a value to such a global variable inside a function without first indicating to Python that this is a global variable, otherwise you will see an `UnboundLocalError`.
ru: В Python переменные, которые используются внутри функции, называются локальными переменными. Перед использованием им должно быть присвоено значение. Переменная, которая используется до присвоения ей значения, считается определена вне этой функции; она известна как `global` (или иногда `nonlocal`) переменной. Вы не можете присвоить значение такой глобальной переменной внутри функции, не указав предварительно Python, что это глобальная переменная, иначе вы словите `UnboundLocalError`.
ta: பைத்தானில், ஒரு செயல்பாட்டிற்குள் பயன்படுத்தப்படும் மாறிகள் உள்ளூர் மாறிகள் எனப்படும். அவற்றைப் பயன்படுத்துவதற்கு முன், அவற்றிற்கு ஒரு மதிப்பு ஒதுக்கப்பட வேண்டும். ஒரு மதிப்பு ஒதுக்கப்படுவதற்கு முன் பயன்படுத்தப்படும் ஒரு மாறி கருதப்படுகிறது அந்த செயல்பாட்டிற்கு வெளியே வரையறுக்கப்பட வேண்டும்; இது ஒரு உலகளாவிய `global` (அல்லது சில நேரங்களில் உள்ளூர்அல்லாத `nonlocal`) மாறி என அறியப்படுகிறது. இது ஒரு உலகளாவிய மாறி என்பதை பைத்தானுக்கு முதலில் குறிப்பிடாமல் ஒரு செயல்பாட்டிற்குள் அத்தகைய உலகளாவிய மாறிக்கு நீங்கள் மதிப்பை ஒதுக்க முடியாது, இல்லையெனில் நீங்கள் பார்ப்பீர்கள் ஒரு வரம்பற்றஉள்ளூர்பிழை `UnboundLocalError`.

source: A `ZeroDivisionError` occurs when you are attempting to divide a value by zero either directly or by using some other mathematical operation.
ru: `ZeroDivisionError` возникает, когда вы пытаетесь разделить значение на ноль либо напрямую, либо с помощью другой математической операции.
ta: ஒரு மதிப்பை சுழியத்தால் நேரடியாகவோ அல்லது வேறு சில கணிதச் செயல்பாட்டைப் பயன்படுத்தியோ வகுக்க முயற்சிக்கும்போது சுழியவகுத்தல்பிழை `ZeroDivisionError` ஏற்படுகிறது.

source: a complex number
ru: комплексное число
ta: ஒரு சிக்கலான எண்

source: a dictionary (`dict`)
ru: словарь (`dict`)
ta: ஒரு அகராதி (`dict`)

source: a number (`float`)
ru: число с плавающей точкой (`float`)
ta: ஒரு மிதவைப்புள்ளிஎண் (`float`)

source: a `frozenset`
ru: множество `frozenset`
ta: ஒரு `உறைந்ததொகுப்பு`

source: an integer (`int`)
ru: целое число (`int`)
ta: ஒரு முழுஎண் (`int`)

source: a `list`
ru: список `list`
ta: ஒரு `பட்டியல்`

source: a variable equal to `None` (`NoneType`)
ru: переменная, равная `None` (`NoneType`)
ta: இல்லை`None` (`NoneType`) க்கு சமமான மாறி

source: a `set`
ru: множество `set`
ta: ஒரு `தொகுப்பு`

source: a string (`str`)
ru: строка (`str`)
ta: ஒரு சரம் (`str`)

source: a `tuple`
ru: кортеж `tuple`
ta: ஒரு `மடங்கு`

source: Object too large to be processed by Python.
ru: Объект слишком велик для обработки Python.

source: Unable to compute.
ru: Невозможно вычислить.

source: A type hint found for `{name}` in the {scope} scope. Perhaps you had used a colon instead of an equal sign and wrote {name} : {hint} instead of {name} = {hint}
ru: Найдена подсказка типа для `{name}` в области видимости {scope}. Возможно, вы использовали двоеточие вместо знака равенства и написали {name} : {hint} вместо {name} = {hint}
ta: {scope} வாய்ப்பில் `{name}` க்கான வகை குறிப்பு உள்ளது. ஒருவேளை நீங்கள் சமமான அடையாளத்திற்குப் பதிலாக முக்காற்புள்ளிப் பயன்படுத்தி எழுதியிருக்கலாம் {name} : {hint} அதற்கு பதிலாக {name} = {hint}

source: The default directory is {dirname}.
ru: По умолчанию используется каталог {dirname}.
ta: இயல்பு கோப்பகம் {dirname}.

source: Did you give your program the same name as a Python module?
ru: Давали ли вы своей программе то же имя, что и модулю Python?
ta: உங்கள் நிரலுக்கு பைதான் தொகுதிக்கு அதே பெயரைக் கொடுத்தீர்களா?

source: I suspect that you used the name `{module}.py` for your program and that you also wanted to import a module with the same name from Python's standard library. If so, you should use a different name for your program.
ru: Предположение: вы использовали имя `{module}.py` для своей программы и что вы также хотели импортировать модуль с тем же именем из стандартной библиотеки Python. Если это так, то вы должны использовать другое имя для своей программы.
ta: உங்கள் நிரலுக்கு `{module}.py` என்ற பெயரைப் பயன்படுத்தியுள்ளீர்கள் என்றும், அதே பெயரில் பைத்தானின் நிலையான நூலகத்திலிருந்து ஒரு தொகுதியை இறக்குமதி செய்ய விரும்புவதாகவும் சந்தேகிக்கிறேன். அப்படியானால், உங்கள் நிரலுக்கு வேறு பெயரைப் பயன்படுத்த வேண்டும்.

source: You have a circular import.
ru: У вас кольцевой импорт.
ta: உங்களிடம் ஒரு வட்ட இறக்குமதி உள்ளது.

source: You likely have a circular import.
ru: Скорее всего, у вас кольцевой импорт.
ta: உங்களிடம் வட்ட இறக்குமதி இருக்கலாம்.

source: Python indicated that the module `{module}` was not fully imported.
ru: Python указал, что модуль `{module}` был импортирован не полностью.
ta: `{module}` தொகுதி முழுமையாக இறக்குமதி செய்யப்படவில்லை என்று பைதான் சுட்டிக்காட்டியது.

source: This can occur if, during the execution of the code in module `{module}` an attempt is made to import the same module again.
ru: Это может произойти, если во время выполнения кода в модуле `{module}` будет сделана попытка импортировать тот же модуль еще раз.
ta: தொகுதி `{module}` இல் குறியீட்டை செயல்படுத்தும் போது, அதே தொகுதியை மீண்டும் இறக்குமதி செய்ய முயற்சித்தால் இது நிகழலாம்.

source: This should not happen: Python tells us that module `{module}` does not have an attribute named `{attribute}`. However, it does not appear that module `{module}` was imported.
ru: Такого не должно быть. Python сообщает нам, что модуль `{module}` не имеет атрибута с именем `{attribute}`. Однако не похоже, чтобы модуль `{module}` был импортирован.
ta: இது நடக்கக்கூடாது: `{module}` தொகுதிக்கு `{attribute}` என்ற பண்புக்கூறு இல்லை என்று பைதான் நமக்குச் சொல்கிறது. இருப்பினும், தொகுதி `{module}` இறக்குமதி செய்யப்பட்டதாகத் தெரியவில்லை.

source: Did you mean `{name}`?
ru: Вы имели в виду `{name}`?
ta: `{name}` எனக் குறிப்பிடுகிறீர்களா?

source: Perhaps you meant to write `{module}.{correct}` instead of `{module}.{typo}`
ru: Возможно, вы хотели написать `{module}.{correct}` вместо `{module}.{typo}`
ta: `{module}.{typo}` என்பதற்குப் பதிலாக `{module}.{correct}` என்று எழுத நினைத்திருக்கலாம்

source: Instead of writing `{module}.{typo}`, perhaps you meant to write one of the following names which are attributes of module `{module}`: `{names}`
ru: Вместо того, чтобы написать `{module}.{typo}`, возможно, вы хотели написать одно из следующих имен, которые являются атрибутами модуля `{module}`: `{names}`
ta: `{module}.{typo}` என்று எழுதுவதற்குப் பதிலாக, அதில் ஒன்றை எழுத நினைத்திருக்கலாம் பின்வரும் பெயர்கள் தொகுதியின் பண்புக்கூறுகள் `{module}`: `{names}`

source: You imported a module named `{module}` from `{mod_path}`. There is also a module named `{module}` in Python's standard library. Perhaps you need to rename your module.
ru: Вы импортировали модуль с именем `{module}` из `{mod_path}`. В стандартной библиотеке Python также есть модуль с именем `{module}`. Возможно, вам нужно переименовать ваш модуль.
ta: `{mod_path}` இலிருந்து `{module}` என்ற தொகுதியை இறக்குமதி செய்துள்ளீர்கள். பைத்தானின் நிலையான நூலகத்தில் `{module}` என்ற பெயருடைய ஒரு தொகுதியும் உள்ளது. ஒருவேளை நீங்கள் உங்கள் தொகுதிக்கு மறுபெயரிட வேண்டும்.

source: Perhaps you meant to use the attribute `{attribute}` of module `{mod_name}` instead of module `{module}`.
ru: Возможно, вы хотели использовать атрибут `{attribute}` из модуля `{mod_name}` вместо модуля `{module}`.
ta: ஒருவேளை நீங்கள் `{attribute}` என்ற பண்புக்கூறைப் பயன்படுத்த நினைத்திருக்கலாம் தொகுதி `{module}` என்பதற்குப் பதிலாக `{mod_name}` தொகுதி.

source: Did you mean one of the following modules: `{names}`?
ru: Вы имели в виду один из следующих модулей: `{names}`?
ta: பின்வரும் தொகுதிக்கூறுகளில் ஒன்றைக் குறிப்பிடுகிறீர்களா: `{names}`?

source: Instead of the module `{module}`, perhaps you wanted to use the attribute `{attribute}` of one of the following modules: `{names}`.
ru: Возможно, вместо модуля `{module}`, следует использовать атрибут `{attribute}` одного из следующих модулей: `{names}`.
ta: தொகுதிக்கு பதிலாக `{module}`, ஒருவேளை நீங்கள் பயன்படுத்த வேண்டும் பின்வரும் தொகுதிகளில் ஒன்றின் பண்பு `{attribute}`: `{names}`.

source: Python tells us that no object with name `{attribute}` is found in module `{module}`.
ru: Python сообщает, что ни один объект с именем `{attribute}` не найден в модуле `{module}`.
ta: `{attribute}` என்ற பெயரில் எந்தப் பொருளும் `{module}` தொகுதியில் காணப்படவில்லை என்று பைதான் நமக்குச் சொல்கிறது.

source: You are attempting to access the attribute `{attr}` for a variable whose value is `None`.
ru: Вы пытаетесь получить доступ к атрибуту `{attr}` для переменной, значение которой `None`.
ta: நீங்கள் `{attr}` என்ற பண்புக்கூறை அணுக முயற்சிக்கிறீர்கள், அதன் மதிப்பு `None`.

source: The value of attribute `{attribute}` of objects of type `{obj_type}` cannot be changed. I have no further information.
ru: Значение атрибута `{attribute}` объектов типа `{obj_type}` не может быть изменено. Дополнительной информации нет.
ta: `{obj_type}` வகையின் பொருள்களின் `{attribute}` பண்புக்கூறின் மதிப்பை மாற்ற முடியாது. எனக்கு மேலும் எந்த தகவலும் இல்லை.

source: Object `{name}` uses an empty `__slots__` to prevent the modification of any of its attributes.
ru: Объект `{name}` использует пустые `__slots__`, чтобы предотвратить изменение какого-либо из его атрибутов.
ta: பொருள் `{name}` அதன் பண்புக்கூறுகளில் ஏதேனும் மாற்றத்தைத் தடுக்க வெற்று `__slots__` ஐப் பயன்படுத்துகிறது.

source: Object `{name}` uses `__slots__` to specify which attributes can be changed. The value of attribute `{name}.{attribute}` cannot be changed.
ru: Объект `{name}` использует `__slots__` чтобы указать, какие атрибуты могут быть изменены. Значение атрибута `{name}.{attribute}` не может быть изменено.
ta: எந்தப் பண்புக்கூறுகளை மாற்றலாம் என்பதைக் குறிப்பிட `{name}` பொருள் `__slots__` ஐப் பயன்படுத்துகிறது. பண்புக்கூறின் மதிப்பை `{name}.{attribute}` மாற்ற முடியாது.

source: `{obj_name}` is a function. Perhaps you meant to write `{obj_name}({attribute})`
ru: `{obj_name}` является функцией. Возможно, вы хотели написать `{obj_name}({attribute})`.
ta: `{obj_name}` என்பது ஒரு செயல்பாடு. ஒருவேளை நீங்கள் `{obj_name}({attribute})` என்று எழுத நினைத்திருக்கலாம்

source: Did you mean `{obj_name}({attribute})`?
ru: Вы имели в виду `{obj_name}({attribute})`?
ta: `{obj_name}({attribute})` எனக் குறிப்பிடுகிறீர்களா?

source: `{obj_name}` is a Python built-in function or method which does not have an attribute named `{attribute}.`
ru: `{obj_name}` является встроенной функцией или методом Python, не имеющего атрибута с именем `{attribute}`.
ta: `{obj_name}` என்பது பைதான் உள்ளமைக்கப்பட்ட செயல்பாடு அல்லது முறையானது `{attribute}' என்ற பண்புக்கூறைக் கொண்டிருக்கவில்லை.

source: An object of type `{obj_type}` has no attribute named `{attr}`. Unfortunately I cannot find such an object on the line where the problem occurs.
ru: Объект типа `{obj_type}` не имеет атрибута с именем `{attr}`. К сожалению, я не могу найти такой объект в строке где возникает проблема.
ta: `{obj_type}` வகைப் பொருளில் `{attr}` என்ற பண்புக்கூறு இல்லை. எதிர்பாராதவிதமாக, சிக்கல் ஏற்படும் இடத்தில் இதுபோன்ற ஒரு பொருளை என்னால் கண்டுபிடிக்க முடியவில்லை.

source: An object of type `{obj_type}` has no attribute named `{attr}`. I cannot give additional information: I found one object of this type in the current scope but it does not appear to be the object causing the problem.
ru: Объект типа `{obj_type}` не имеет атрибута с именем `{attr}`. Я не могу предоставить дополнительную информацию. Есть один объект этого типа в текущей области видимости но, похоже, это не тот объект, который вызывает проблему.
ta: `{obj_type}` வகைப் பொருளில் `{attr}` என்ற பண்புக்கூறு இல்லை. கூடுதல் தகவல்களை என்னால் கொடுக்க முடியாது: தற்போதைய நோக்கத்தில் இந்த வகைப் பொருளைக் கண்டேன் ஆனால் அது சிக்கலை ஏற்படுத்தும் பொருளாகத் தெரியவில்லை.

source: An object of type `{obj_type}` has no attribute named `{attr}`. The following objects might be the cause of the problem: {names}.
ru: Объект типа `{obj_type}` не имеет атрибута с именем `{attr}`. Причиной проблемы могут быть следующие объекты: {names}.
ta: `{obj_type}` வகைப் பொருளில் `{attr}` என்ற பண்புக்கூறு இல்லை. பின்வரும் பொருள்கள் சிக்கலுக்கு காரணமாக இருக்கலாம்: {names}.

source: The object `{obj}` has no attribute named `{attr}`.
ru: У объекта `{obj}` нет атрибута с именем `{attr}`.
ta: `{obj}` பொருளில் `{attr}` என்ற பண்புக்கூறு இல்லை.

source: Note that object `{obj}` uses `__slots__` which prevents the creation of new attributes.
ru: Обратите внимание, что объект `{obj}` использует `__slots__`, что предотвращает создание новых атрибутов.
ta: `{obj}` பொருள் `__slots__` ஐப் பயன்படுத்துகிறது, இது புதிய பண்புக்கூறுகளை உருவாக்குவதைத் தடுக்கிறது.

source: The following are some of its known attributes: `{names}`.
ru: Ниже перечислены некоторые из его известных атрибутов: `{names}`.
ta: அதன் அறியப்பட்ட சில பண்புக்கூறுகள் பின்வருமாறு: `{names}`.

source: The object `{obj_name}` has no attribute named `{attribute}`.
ru: У объекта `{obj_name}` нет атрибута с именем `{attribute}`.
ta: `{obj_name}` என்ற பொருளுக்கு `{attribute}` என்ற பண்புக்கூறு இல்லை.

source: Perhaps you meant to write `{obj}.{correct}` instead of `{obj}.{typo}`
ru: Возможно, вы хотели написать `{obj}.{correct}` вместо `{obj}.{typo}`.
ta: நீங்கள் `{obj}.{typo}` என்பதற்குப் பதிலாக `{obj}.{correct}` என்று எழுத நினைத்திருக்கலாம்

source: Did you mean one of the following: `{names}`?
ru: Вы имели в виду одно из следующих: `{names}`?
ta: பின்வருவனவற்றில் ஒன்றைக் குறிப்பிடுகிறீர்களா: `{names}`?

source: Instead of writing `{obj}.{typo}`, perhaps you meant to write one of the following names which are attributes of object `{obj}`: `{names}`
ru: Вместо того чтобы написать `{obj}.{typo}`,возможно вы хотели написать одно из следующих имен, которые являются атрибутами объекта `{obj}`: `{names}`.
ta: `{obj}.{typo}` என்று எழுதுவதற்குப் பதிலாக, `{obj}`: `{names}` என்ற பொருளின் பண்புக்கூறுகளான பின்வரும் பெயர்களில் ஒன்றை எழுத நினைத்திருக்கலாம்

source: Did you write a comma by mistake?
ru: Вы поставили запятую по ошибке?
ta: தவறுதலாக காற்புள்ளியை எழுதினீர்களா?

source: `{obj_name}` is a tuple that contains a single item which does have `'{attribute}'` as an attribute. Perhaps you added a trailing comma by mistake at the end of the line where you defined `{obj_name}`.
ru: `{obj_name}` -- это кортеж, который содержит единственный элемент, имеющий `'{attribute}` в качестве атрибута. Возможно, вы по ошибке добавили запятую в конце строки в которой вы определили `{obj_name}`.
ta: `{obj_name}` என்பது `'{attribute}'` பண்புக்கூறாகக் கொண்ட ஒற்றை உருப்படியைக் கொண்ட மடங்கு ஆகும். நீங்கள் `{obj_name}` வரையறுத்த வரியின் முடிவில் தவறுதலாக பின்னிணைந்த காற்புள்ளியைச் சேர்த்திருக்கலாம்.

source: Did you mean `{str_content}.join({obj_name})`?
ru: Вы имели в виду `{str_content}.join({obj_name})`?
ta: `{str_content}.join({obj_name})` எனக் குறிப்பிடுகிறீர்களா?

source: The object `{obj_name}` has no attribute named `join`. Perhaps you wanted something like `{str_content}.join({obj_name})`.
ru: У объекта `{obj_name}` нет атрибута с именем `join`. Возможно, вы хотели получить что-то вроде `{str_content}.join({obj_name})`.
ta: `{obj_name}` பொருளில் `join` என்ற பண்புக்கூறு இல்லை. `{str_content}.join({obj_name})` போன்ற ஏதாவது ஒன்றை நீங்கள் விரும்பலாம்.

source: Did you mean `{known_builtin}({obj_name})`?
ru: Вы имели в виду `{known_builtin}({obj_name})`?
ta: `{known_builtin}({obj_name})` எனக் குறிப்பிடுகிறீர்களா?

source: The object `{obj_name}` has no attribute named `{attribute}`. Perhaps you can use the Python builtin function `{known_builtin}` instead: `{known_builtin}({obj_name})`.
ru: У объекта `{obj_name}` нет атрибута с именем `{attribute}`. Возможно, вместо этого следует использовать встроенную функцию Python `{known_builtin}`: `{known_builtin}({obj_name})`.
ta: `{obj_name}` என்ற பொருளுக்கு `{attribute}` என்ற பண்புக்கூறு இல்லை. அதற்குப் பதிலாக `{known_builtin}` என்ற பைதான் உள்ளமைக்கப்பட்ட செயல்பாட்டைப் பயன்படுத்தலாம்: `{known_builtin}({obj_name})`.

source: Did you mean `{attr}`?
ru: Вы имели в виду `{attr}`?
ta: `{attr}` எனக் குறிப்பிடுகிறீர்களா?

source: The object `{name}` has no attribute named `{attribute}`.
ru: У объекта `{name}` нет атрибута с именем `{attribute}`.
ta: `{name}` என்ற பொருளுக்கு `{attribute}` என்ற பண்புக்கூறு இல்லை.

source: However, `{attr}` is an attribute of `{name}` with a similar meaning.
ru: Тем не менее, `{attr}` является атрибутом `{name}` с аналогичным значением.
ta: இருப்பினும், `{attr}` என்பது ஒத்த பொருளைக் கொண்ட `{name}` இன் பண்புக்கூறு ஆகும்.

source: However, `{name}` has the following attributes with similar meanings: `{attributes}`.
ru: Однако `{name}` имеет следующие атрибуты с аналогичными значениями: `{attributes}`.
ta: இருப்பினும், `{name}` பின்வரும் பண்புக்கூறுகளை ஒத்த பொருள்களைக் கொண்டுள்ளது: `{attributes}`.

source: Did you mean to separate object names by a comma?
ru: Вы хотели разделить имена объектов запятой?
ta: பொருளின் பெயர்களை காற்புள்ளியால் பிரிக்க வேண்டுமா?

source: `{second}` is not an attribute of `{first}`. However, both `{first}` and `{second}` are known objects. Perhaps you wrote a period to separate these two objects, instead of using a comma.
ru: `{second}` не является атрибутом `{first}`. Однако и `{first}`, и `{second}` являются известными объектами. Возможно, вы написали точку, чтобы разделить эти два объекта, вместо запятой.
ta: `{second}` என்பது `{first}` இன் பண்புக்கூறு அல்ல. இருப்பினும், `{first}` மற்றும் `{second}` இரண்டும் அறியப்பட்ட பொருள்கள். காற்புள்ளியைப் பயன்படுத்துவதற்குப் பதிலாக, இந்த இரண்டு பொருட்களையும் பிரிக்க நீங்கள் ஒரு நிறுத்தற்குறியை எழுதியிருக்கலாம்.

source: In your program, the name of the file that cannot be found is `{filename}`.
ru: В вашей программе имя файла, который не может быть найден, будет `{filename}`.
ta: உங்கள் நிரலில், கண்டறிய முடியாத கோப்பின் பெயர் `{filename}`.

source: {directory} is not a valid directory.
ru: {directory} не является допустимой.
ta: {directory} செல்லுபடியாகும் கோப்பகம் அல்ல.

source: It was expected to be found in the `{directory}` directory.
ru: Ожидалось, что он будет найден в директории `{directory}`.
ta: இது `{directory}` கோப்பகத்தில் காணப்படும் என்று எதிர்பார்க்கப்பட்டது.

source: Did you mean `{similar}`?
ru: Вы имели в виду `{similar}`?
ta: `{similar}` என்று நீங்கள் கூறுகிறீர்களா?

source: The file `{similar}` has a similar name.
ru: Файл `{similar}` имеет похожее имя.
ta: கோப்பு `{similar}` இதே பெயரைக் கொண்டுள்ளது.

source: Perhaps you meant one of the following files with similar names:
ru: Возможно, вы имели в виду один из следующих файлов с похожими именами:
ta: இதே பெயர்களைக் கொண்ட பின்வரும் கோப்புகளில் ஒன்றை நீங்கள் குறிப்பிடலாம்:

source: I have no additional information for you.
ru: Дополнительной информации нет.
ta: உங்களுக்கான கூடுதல் தகவல் எதுவும் என்னிடம் இல்லை.

source: The object that could not be imported is `{name}`. The module or package where it was expected to be found is `{module}`.
ru: Объект `{name}` не удалось импортировать. Модуль или пакет, в котором его предполагалось найти: `{module}`
ta: இறக்குமதி செய்ய முடியாத பொருள் `{name}`. அது கண்டறியப்படும் என எதிர்பார்க்கப்படும் தொகுதி அல்லது தொகுப்பு `{module}` ஆகும்.

source: Python indicated that you have a circular import. This can occur if executing the code in module 'A' results in executing the code in module 'B' where an attempt to import a name from module 'A' is made before the execution of the code in module 'A' had been completed.
ru: Python указал, что у вас имеется кольцевой импорт. Это может произойти, если выполнение кода в модуле 'A' приводит к выполнению кода в модуле 'B', где попытка импортировать имя из модуля 'A' была предпринята до того, как было завершено выполнение кода в модуле 'A'.
ta: நீங்கள் ஒரு வட்ட இறக்குமதியைக் கொண்டிருப்பதை பைதான் சுட்டிக்காட்டியது. தொகுதி 'A' இல் குறியீட்டை இயக்குவது 'B' தொகுதியில் குறியீட்டை இயக்கும் போது இது நிகழலாம், அங்கு தொகுதி 'A' இல் உள்ள குறியீட்டை செயல்படுத்துவதற்கு முன்பு தொகுதி 'A' இலிருந்து ஒரு பெயரை இறக்குமதி செய்யும் முயற்சி மேற்கொள்ளப்படுகிறது.

source: Inconsistent state: `'{module}'` was apparently not imported. As a result, no further analysis can be done.
ru: Несоответствующее состояние: `'{module}'`, очевидно, не был импортирован. В результате дальнейший анализ не может быть выполнен.
ta: சீரற்ற நிலை: `'{module}'` வெளிப்படையாக இறக்குமதி செய்யப்படவில்லை. இதன் விளைவாக, மேலும் பகுப்பாய்வு செய்ய முடியாது.

source: Perhaps you meant to import `{correct}` (from `{module}`) instead of `{typo}`
ru: Возможно, вместо `{typo}` вы хотели импортировать `{correct}` из `{module}`
ta: ஒருவேளை நீங்கள் `{typo}` என்பதற்குப் பதிலாக `{correct}` (from `{module}`) இறக்குமதி செய்ய நினைத்திருக்கலாம்

source: Instead of trying to import `{typo}` from `{module}`, perhaps you meant to import one of the following names which are found in module `{module}`: `{candidates}`
ru: Вместо того чтобы пытаться импортировать `{typo}` из `{module}`, возможно, стоит импортировать одно из следующих имен, которые находятся в модуле `{module}`: `{candidates}`
ta: `{module}` இலிருந்து `{typo}` ஐ இறக்குமதி செய்ய முயற்சிப்பதற்குப் பதிலாக, `{module}` தொகுதியில் காணப்படும் பின்வரும் பெயர்களில் ஒன்றை நீங்கள் இறக்குமதி செய்ய நினைத்திருக்கலாம்: `{candidates}`

source: The object that could not be imported is `{name}`.
ru: Объект `{name}` не удалось импортировать.
ta: இறக்குமதி செய்ய முடியாத பொருள் `{name}`.
