Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: [Note: `{first} * {second}` would also be valid since `{first}` is a complex number.]
ru: [Примечание: выражение`{first} * {second}` также будет верным, поскольку `{first}` - комплексное число].
ta: [குறிப்பு: `{first}` ஒரு கலப்பு எண் என்பதால் `{first} * {second}` என்பதும் செல்லுபடியாகும்.]

source: Perhaps you forgot a multiplication operator, `{first} * {second}`.
ru: Возможно, вы пропустили оператор умножения, `{first} * {second}`.
ta: ஒருவேளை நீங்கள் பெருக்கல் இயக்கியை மறந்துவிட்டீர்கள், `{first} * {second}`.

source: Your Python version does not support this f-string feature.
ru: Ваша версия Python не поддерживает f-строки.
ta: உங்கள் பைதான் பதிப்பு இந்த f-சரம் அம்சத்தை ஆதரிக்கவில்லை.

source: You are likely using a 'debug' syntax of f-strings introduced in Python version 3.8. You are using version {version}.
ru: Скорее всего, вы используете 'отладочный' синтаксис f-строк, введенный в Python версии 3.8. Вы же используете версию {version}.
ta: பைதான் பதிப்பு 3.8 இல் அறிமுகப்படுத்தப்பட்ட f-சரத்தின் 'பிழைத்திருத்த' தொடரியலை நீங்கள் பயன்படுத்துகிறீர்கள். நீங்கள் பதிப்பு {version} ஐப் பயன்படுத்துகிறீர்கள்.

source: You are likely trying to assign a value within an f-string. This is not allowed.
ru: Скорее всего, вы пытаетесь присвоить значение внутри f-строки. Это недопустимо.
ta: நீங்கள் ஒரு f-சரத்தில் மதிப்பை ஒதுக்க முயற்சிக்கிறீர்கள். இதற்கு அனுமதி இல்லை.

source: The content of your f-string is invalid. Please consult the documentation: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
ru: Содержимое вашей f-строки недопустимо. Пожалуйста, обратитесь к документации: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
ta: உங்கள் f-சர உள்ளடக்கம் தவறானது. ஆவணங்களைப் பார்க்கவும்: https://docs.python.org/3/reference/lexical_analysis.html#f-strings

source: Python keywords cannot be used as identifiers (variable names).
ru: Ключевые слова Python нельзя использовать в качестве идентификаторов (имен переменных).
ta: பைதான் முக்கியச்சொற்களை அடையாளங்காட்டிகளாகப் பயன்படுத்த முடியாது (மாறி பெயர்கள்).

source: `lambda` does not allow parentheses around its arguments. This was allowed in Python 2 but it not allowed in Python 3.
ru: `lambda` не позволяет использовать круглые скобки вокруг своих аргументов. Это было разрешено в Python 2, но не в Python 3.
ta: `lambda` அதன் வாதங்களைச் சுற்றி அடைப்புக்குறிகளை அனுமதிக்காது. இது பைதான் 2 இல் அனுமதிக்கப்பட்டது ஆனால் பைதான் 3 இல் அனுமதிக்கப்படவில்லை.

source: You cannot have explicit tuples as arguments. Assign any tuple to a parameter and unpack it within the body of the function.
ru: Вы не можете передавать явные кортежи в качестве аргументов. Присвойте любой кортеж параметру и распакуйте его в теле функции.
ta: நீங்கள் வெளிப்படையான மடங்குகளை வாதங்களாக வைத்திருக்க முடியாது. எந்த மடங்கையும் ஒரு அளவுருவுக்கு ஒதுக்கி, செயல்பாட்டின் உடலில் அதைத் திறக்கவும்.

source: If you remove `{type_decl}`, you will have a valid Python statement.
ru: Если вы удалите `{type_decl}`, то оператор станет корректен.
ta: நீங்கள் `{type_decl}` ஐ அகற்றினால், உங்களிடம் சரியான பைதான் அறிக்கை இருக்கும்.

source: However, even if you remove `{type_decl}`, there would still be some some syntax errors.
ru: Даже если вы удалите `{type_decl}`, все равно будут возникать синтаксические ошибки.
ta: இருப்பினும், நீங்கள் `{type_decl}` ஐ அகற்றினாலும், சில தொடரியல் பிழைகள் இருக்கும்.

source: You do not need to declare variables in Python.
ru: В Python не нужно объявлять переменные.
ta: நீங்கள் பைத்தானில் மாறிகளை அறிவிக்க வேண்டியதில்லை.

source: It looks like you were trying to declare that `{var}` was a variable using the word `{type_decl}`.
ru: Похоже, что вы пытались сказать, что `{var}` является переменной, используя слово `{type_decl}`.
ta: `{var}` என்பது `{type_decl}` என்ற வார்த்தையைப் பயன்படுத்தி ஒரு மாறி என்று நீங்கள் அறிவிக்க முயற்சிப்பது போல் தெரிகிறது.

source: I am guessing that you forgot a comma between two strings when defining a dict.
ru: Полагаю, что вы забыли поставить запятую между двумя строками при определении словаря.
ta: ஒரு அகராதியை வரையறுக்கும்போது இரண்டு சரங்களுக்கு இடையே உள்ள காற்புள்ளியை நீங்கள் மறந்துவிட்டீர்கள் என்று நினைக்கிறேன்.

source: Did you forget to write `in`?
ru: Вы забыли про `in`?
ta: `in` எழுத மறந்துவிட்டீர்களா?

source: It looks as though you forgot to use the keyword `in` as part of a `for` statement. Perhaps you meant: {new_statement}
ru: Похоже, что вы забыли использовать ключевое слово `in` как часть оператора `for`. Возможно, вы имели в виду: {new_statement}
ta: `for` அறிக்கையின் ஒரு பகுதியாக `in` என்ற முக்கிய சொல்லைப் பயன்படுத்த மறந்துவிட்டது போல் தெரிகிறது. ஒருவேளை நீங்கள் இவ்வாறு குறிப்பிட்டிருக்கலாம்: {new_statement}

source: Did you forget to write parenthesis?
ru: Вы забыли про скобки?
ta: அடைப்புக்குறி எழுத மறந்துவிட்டீர்களா?

source: It looks as though you forgot to use to use parenthesis with `range`. Perhaps you meant: {new_statement}
ru: Похоже, что вы забыли использовать скобки с `range`. Возможно, вы имели в виду: {new_statement}
ta: `range` உடன் அடைப்புக்குறியைப் பயன்படுத்த மறந்துவிட்டது போல் தெரிகிறது. ஒருவேளை நீங்கள் இவ்வாறு குறிப்பிட்டிருக்கலாம்: {new_statement}

source: Perhaps you meant to write `{keyword}` and made a typo. The correct line might be `{line}`
ru: Возможно, вы хотели написать `{keyword}` и допустили опечатку. Корректной строкой может быть: `{line}`.
ta: ஒருவேளை நீங்கள் `{keyword}` என்று எழுத நினைத்திருக்கலாம் மற்றும் எழுத்துப் பிழை செய்திருக்கலாம். சரியான வரி `{line}` ஆக இருக்கலாம்

source: I am guessing that you were writing a comprehension or a generator expression and use the wrong order for a condition. The correct order depends if there is an `else` clause or not. For example, the correct order for a list comprehensions with condition can be either [f(x) if condition else other for x in sequence] # 'if' before 'for' or, if there is no `else` [f(x) for x in sequence if condition] # 'if' after 'for'
ru: Предполагаю, что вы писали comprehension или генераторное выражение и использовали неправильный порядок для условия. Правильный порядок зависит от наличия или отсутствия условия `else`. Например, правильным порядком для представления списков с условием может быть либо: [f(x) if condition else other for x in sequence] # 'if' перед 'for' либо, если нет `else`: [f(x) for x in sequence if condition] # 'if' после 'for'.
ta: நீங்கள் ஒரு புரிதல் அல்லது உருவாக்கி வெளிப்பாடு எழுதுகிறீர்கள் என்று நான் நினைக்கிறேன் மற்றும் ஒரு நிபந்தனைக்கு தவறான வரிசையைப் பயன்படுத்துகிறீர்கள். சரியான வரிசையானது `else` பிரிவு இருக்கிறதா இல்லையா என்பதைப் பொறுத்தது. எடுத்துக்காட்டாக, நிபந்தனையுடன் கூடிய பட்டியலைப் புரிந்துகொள்வதற்கான சரியான வரிசையானது [f(x) if நிபந்தனை else மற்றது for ஐ in வரிசை] # 'for'க்கு முன் 'if' அல்லது, `else` இல்லை என்றால் [f(x) for ஐ in வரிசை if நிபந்தனை] # 'for'க்கு பிறகு 'if'

source: You cannot have spaces in identifiers (variable names). Perhaps you meant `{name}`?
ru: В идентификаторах (именах переменных) пробелы недопустимы. Возможно, вы имели в виду `{name}`?

source: `bf` is an illegal string prefix.
ru: `bf` -- недопустимый префикс.
ta: `bf` என்பது ஒரு சட்டவிரோத சரம் முன்னொட்டு.

source: I am guessing that you wanted a binary f-string; this is not allowed.
ru: Предполагаю, что вы хотели получить binary f-строку, это недопустимо.
ta: உங்களுக்கு ஒரு பைனரி f-சரம் வேண்டும் என்று நான் நினைக்கிறேன்; இது அனுமதிக்கப்படவில்லை.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, at the position indicated by ^.
ru: Возможно, вы забыли поставить запятую между элементами кортежа, или между аргументами функции, место отмечено ^.

source: It is possible that you forgot a comma between items in a list at the position indicated by ^.
ru: Возможно, вы забыли поставить запятую между элементами списка, место отмечено ^.

source: It is possible that you forgot a comma between items in a set or dict at the position indicated by ^.
ru: Возможно, что вы забыли поставить запятую между элементами множества или или словаря, место отмечено ^.

source: Python indicates that the error is caused by `{second}` written immediately after `{first}`.
ru: Python указывает, что ошибка вызвана `{second}`, написанным сразу после `{first}`.
ta: `{first}` க்குப் பிறகு உடனடியாக எழுதப்பட்ட `{second}` மூலம் பிழை ஏற்பட்டது என்பதை பைதான் குறிக்கிறது.

source: Perhaps you meant{line}
ru: Возможно, вы имели в виду `{line}`

source: Did you forget something between `{first}` and `{second}`?
ru: Вы что-то пропустили между `{first}` и `{second}`
ta: `{first}` மற்றும் `{second}` இடையே ஏதாவது மறந்துவிட்டீர்களா?

source: Perhaps you meant to insert an operator like `{operators}` between `{first}` and `{second}`. The following lines of code would not cause any `SyntaxError`:
ru: Возможно, вы хотели вставить оператор типа `{operators}` между `{first}` и `{second}`. Следующие строки кода не вызовут `SyntaxError`:
ta: `{first}` மற்றும் `{second}` இடையே `{operators}` போன்ற இயக்கியைச் செருக நினைத்திருக்கலாம். பின்வரும் குறியீடு வரிகள் எந்த `தொடரியல்பிழை` யையும் ஏற்படுத்தாது:

source: Note: these are just some of the possible choices and that some of them might raise other types of exceptions.
ru: Примечание: это только некоторые из возможных вариантов и некоторые из них могут вызывать другие типы исключений.
ta: குறிப்பு: இவை சாத்தியமான சில தேர்வுகள் மற்றும் அவற்றில் சில வேறு வகையான விதிவிலக்குகளை எழுப்பலாம்.

source: There is an additional possibility.
ru: Существует и другая возможность.
ta: கூடுதல் வாய்ப்பு உள்ளது.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict before or at the position indicated by ^.
ru: Возможно, что вы использовали знак равенства `=` вместо двоеточия `:` для присвоения значений ключам в словаре, до или в позиции, обозначенной ^.
ta: ^ ஆல் சுட்டிக்காட்டப்பட்ட நிலையில் உள்ள ஒரு அகராதியில் உள்ள விசைகளுக்கு மதிப்புகளை ஒதுக்க, முக்காற்புள்ளி `:` என்பதற்குப் பதிலாக `=` என்ற சம அடையாளத்தைப் பயன்படுத்தியிருக்கலாம்.

source: The Python keyword `{boolean}` can only be used for boolean expressions. Perhaps you meant to write `{new_statement}`
ru: Ключевое слово Python '{boolean}' можно использовать только для булевых выражений. Возможно, вы хотели написать `{new_statement}`
ta: பைதான் முக்கியச்சொல் `{boolean}` பூலியன் வெளிப்பாடுகளுக்கு மட்டுமே பயன்படுத்தப்படும். ஒருவேளை நீங்கள் பின்வருமாறு எழுத நினைத்திருக்கலாம் `{new_statement}`

source: I am guessing that you are trying to import at least one object from module `{module}` and rename it using the Python keyword `as`; this keyword can only be used to rename one object at a time using a well defined syntax. I suggest that you split up any such import statement with each object renamed on a separate line as follows: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # if needed
ru: Предполагаю, что вы пытаетесь импортировать по крайней мере один объект из модуля `{module}` и переименовать его с помощью ключевого слова Python `as`; Это ключевое слово может быть использовано только для переименования одного объекта за раз и только используя четко определенный синтаксис. Каждый обьект переименовывается в отдельной строке следующим образом: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # если необходимо
ta: நீங்கள் தொகுதி `{module}` இலிருந்து குறைந்தபட்சம் ஒரு பொருளை இறக்குமதி செய்து, பைதான் முக்கிய சொல்லான `as` ஐப் பயன்படுத்தி மறுபெயரிட முயற்சிக்கிறீர்கள் என்று நினைக்கிறேன்; நன்கு வரையறுக்கப்பட்ட தொடரியல் மூலம் ஒரே நேரத்தில் ஒரு பொருளை மறுபெயரிட மட்டுமே இந்த முக்கிய சொல்லைப் பயன்படுத்த முடியும். ஒவ்வொரு பொருளுக்கும் தனித்தனி வரியில் மறுபெயரிடப்பட்ட அத்தகைய இறக்குமதி அறிக்கையைப் பின்வருமாறு பிரிக்குமாறு நான் பரிந்துரைக்கிறேன்: from {module} import பொருள்_1 as பெயர்_1 from {module} import பொருள்_2 as பெயர்_2 # ஆக தேவைப்பட்டால்

source: I am guessing that you wrote {bad_token} twice in a row by mistake. If that is the case, you need to remove the second one.
ru: Предполагаю, что вы по ошибке написали {bad_token} два раза подряд. Если это так, вам нужно удалить второй.
ta: நீங்கள் தவறுதலாக இரண்டு முறை {bad_token} என்று எழுதிவிட்டீர்கள் என்று நினைக்கிறேன். அப்படியானால், நீங்கள் இரண்டாவதாக அகற்ற வேண்டும்.

source: Did you write {bad_token} twice by mistake?
ru: Вы по ошибке написали {bad_token} дважды?
ta: தவறுதலாக இரண்டு முறை {bad_token} என்று எழுதிவிட்டீர்களா?

source: I am guessing that you wrote {bad_token} by mistake. Removing it and writing `{line}` seems to fix the error.
ru: Предполагаю, что вы по ошибке написали {bad_token}. Удалите его и напишите `{line}`, это поможет устранить ошибку.
ta: நீங்கள் தவறுதலாக {bad_token} எழுதிவிட்டீர்கள் என்று நினைக்கிறேன். அதை நீக்கிவிட்டு `{line}` எழுதுவது பிழையை சரிசெய்வதாகத் தெரிகிறது.

source: Did you write {bad_token} by mistake?
ru: Вы написали {bad_token} по ошибке?
ta: தவறுதலாக {bad_token} என்று எழுதிவிட்டீர்களா?

source: It looks like the error occurred as you were writing a Python dict. Perhaps wrote a dict key without writing the corresponding value.
ru: Возможно, вы записали ключ словаря без записи соответствующего значения.
ta: நீங்கள் பைதான் அகராதியை எழுதும் போது பிழை ஏற்பட்டது போல் தெரிகிறது. தொடர்புடைய மதிப்பை எழுதாமல் ஒரு அகராதி திறவுகோலை எழுதியிருக்கலாம்.

source: The `else` keyword does not begin a code block that matches a valid code block, possibly because `else` is not indented correctly.
ru: Ключевое слово `else` не начинает соответствующий блок кода. Возможно, потому что `else` имеет неправильный отступ.
ta: `else` முக்கிய சொல் சரியான குறியீடு தொகுதியுடன் பொருந்தக்கூடிய குறியீடு தொகுதியைத் தொடங்காது, ஒருவேளை `else` சரியாக உள்தள்ளப்படாததால் இருக்கலாம்.

source: The `elif` keyword does not begin a code block that matches an `if` block, possibly because `elif` is not indented correctly.
ru: Ключевое слово `elif` не начинает блок кода, который соответствует блоку `if`. Возможно, потому что `elif` имеет неправильный отступ.
ta: `elif` முக்கிய சொல்லானது, `if` தொகுதியுடன் பொருந்தக்கூடிய குறியீடுத் தொகுதியைத் தொடங்கவில்லை, ஒருவேளை `elif` சரியாக உள்தள்ளப்படாததால் இருக்கலாம்.

source: You used square brackets, `[...]` instead of parentheses.
ru: Вы использовали квадратные скобки `[...]` вместо круглых.
ta: அடைப்புக்குறிகளுக்குப் பதிலாக சதுர அடைப்புக்குறிகளைப் பயன்படுத்தியுள்ளீர்கள், `[...]`.

source: Write the following instead: {new_statement}
ru: Возможно, вы хотели написать: {new_statement}
ta: அதற்கு பதிலாக பின்வருவனவற்றை எழுதவும்: {new_statement}

source: The opening {bracket} on line {linenumber} is not closed.
ru: Открывающая {bracket} в строке {linenumber} не закрыта.
ta: வரி {linenumber} இல் திறப்பு {bracket} மூடப்படவில்லை.

source: If this is incorrect, please report this case.
ru: Если это неверно, пожалуйста, сообщите об этом случае.
ta: இது தவறாக இருந்தால், இந்த வழக்கைப் புகாரளிக்கவும்.

source: Perhaps you wrote a statement beginning a code block intended to be part of a generator expression. You cannot have separate code blocks inside generator expressions.
ru: Возможно, вы написали утверждение, начинающее блок кода который должен быть частью генераторного выражения. Внутри генераторного выражения нельзя располагать отдельные блоки кода.
ta: உருவாக்கி வெளிப்பாட்டின் ஒரு பகுதியாக இருக்க வேண்டும் என்பதற்காக, குறியீடு தொகுதியைத் தொடங்கி அறிக்கையை நீங்கள் எழுதியிருக்கலாம். உருவாக்கி வெளிப்பாடுகளுக்குள் தனி குறியீடு தொகுதிகள் இருக்க முடியாது.

source: Perhaps you wrote a statement beginning a code block intended to be part of a list comprehension. You cannot have separate code blocks inside list comprehensions.
ru: Возможно, вы написали утверждение, начинающее блок кода который должен быть частью list comprehension. Внутри представления списка нельзя располагать отдельные блоки кода.
ta: பட்டியல் புரிந்துகொள்ளுதலின் ஒரு பகுதியாக இருக்க வேண்டும் என்பதற்காக, குறியீடு தொகுதியைத் தொடங்கி அறிக்கையை நீங்கள் எழுதியிருக்கலாம். பட்டியல் புரிதல்களுக்குள் தனி குறியீடு தொகுதிகள் இருக்க முடியாது.

source: Perhaps you wrote a statement beginning a code block intended to be part of a dict or set comprehension. You cannot have separate code blocks inside dict or set comprehensions.
ru: Возможно, вы написали утверждение, начинающее блок кода предназначенного для части dict или set comprehension. Нельзя располагать отдельные блоки кода внутри dict или set comprehensions.
ta: ஒரு அகராதியின் அல்லது தொகுப்பின் புரிதலின் ஒரு பகுதியாக இருக்க வேண்டும் என்பதற்காக, குறியீடு தொகுதியைத் தொடங்கி அறிக்கையை நீங்கள் எழுதியிருக்கலாம். அகராதி அல்லது தொகுப்பு புரிதல்களுக்குள் நீங்கள் தனி குறியீடு தொகுதிகளை வைத்திருக்க முடியாது.

source: If this explanation is incorrect, please report this case.
ru: Если это неверно, пожалуйста, сообщите об этом случае.
ta: இந்த விளக்கம் தவறாக இருந்தால், இந்த வழக்கைப் புகாரளிக்கவும்.

source: parenthesis `(`
ru: круглая скобка `(`
ta: அடைப்புக்குறி `(`

source: parenthesis `)`
ru: круглая скобка `)`
ta: அடைப்புக்குறி `)`

source: square bracket `[`
ru: квадратная скобка `[`
ta: சதுர அடைப்புக்குறி `[`

source: square bracket `]`
ru: квадратная скобка `]`
ta: சதுர அடைப்புக்குறி `]`

source: curly bracket `{`
ru: фигурная скобка `{`
ta: சுருள் அடைப்புக்குறி `{`

source: curly bracket `}`
ru: фигурная скобка `}`
ta: சுருள் அடைப்புக்குறி `}`

source: Did you mean to use a normal quote character, `'` or `"`?
ru: Вы хотели использовать одинарные кавычки `'`, или двойные `"`?
ta: சாதாரண மேற்கோள் எழுத்தான `'` அல்லது `"` ஐப் பயன்படுத்த விரும்புகிறீர்களா?

source: I suspect that you used a fancy unicode quotation mark whose name is {name} instead of a normal single or double quote for a string.
ru: Предполагаю, что вы использовали причудливую юникодную кавычку имя которой {name}, вместо обычной одинарной или двойной кавычки для строки.
ta: ஒரு சரத்திற்கான சாதாரண ஒற்றை அல்லது இரட்டை மேற்கோளுக்கு பதிலாக {name} என்ற ஆடம்பரமான ஒருங்குறி மேற்கோள் குறியைப் பயன்படுத்தியுள்ளீர்கள் என்று நான் சந்தேகிக்கிறேன்.

source: Or perhaps, you meant to write a less than sign, `<`.
ru: Или, возможно, вы хотели поставить знак "меньше чем", `<`.
ta: அல்லது ஒருவேளை, `<` என்ற விட குறைவாக அடையாளத்தை எழுத வேண்டும் என்று நீங்கள் நினைத்திருக்கலாம்.

source: Or perhaps, you meant to write a greater than sign, `>`.
ru: Или, возможно, вы хотели поставить знак "больше чем", `>`.
ta: அல்லது ஒருவேளை, நீங்கள் பெரியது `>` அடையாளத்தை எழுத நினைத்திருக்கலாம்.

source: Or perhaps, you meant to write a comma.
ru: Или, возможно, вы хотели поставить запятую.
ta: அல்லது ஒருவேளை, நீங்கள் காற்புள்ளியை எழுத நினைத்திருக்கலாம்.

source: I suspect that you used a fancy unicode quotation mark whose name is {name}.
ru: Предполагаю, что вы использовали причудливую кавычку юникода, имя которой {name}.
ta: நீங்கள் {name} என்ற ஆடம்பரமான ஒருங்குறி மேற்கோள் குறிகளைப் பயன்படுத்தியுள்ளீர்கள் என்று சந்தேகிக்கிறேன்.

source: Perhaps, you meant to write a less than sign, `<`.
ru: Возможно, вы хотели поставить знак "меньше чем", `<`.
ta: ஒருவேளை, நீங்கள் ஒரு சிறியது `<` அடையாளத்தை எழுத வேண்டும்.

source: Did you mean to write a less than sign, `<`?
ru: Вы хотели поставить знак "меньше чем", `<`?
ta: சிறியது `<` என்ற அடையாளத்தை எழுத நினைத்தீர்களா?

source: Perhaps, you meant to write a greater than sign, `>`.
ru: Возможно, вы хотели поставить знак "больше чем", `>`.
ta: ஒருவேளை, நீங்கள் ஒரு பெரியது `>` அடையாளத்தை எழுத வேண்டும்.

source: Did you mean to write a greater than sign, `>`?
ru: Вы хотели поставить знак "больше чем", `>`?
ta: பெரியது `>` என்ற அடையாளத்தை எழுத நினைத்தீர்களா?

source: Perhaps, you meant to write a comma.
ru: Возможно, вы хотели поставить запятую.
ta: ஒருவேளை, நீங்கள் காற்புள்ளியை எழுத நினைத்திருக்கலாம்.

source: I suspect that you used the unicode character known as 'FRACTION SLASH', which looks similar to but is different from the division operator `/`.
ru: Предполагаю, что вы использовали символ юникода, известный как 'FRACTION SLASH', который похож, но отличается от оператора деления `/`.
ta: 'FRACTION SLASH' எனப்படும் ஒருங்குறி எழுத்தை நீங்கள் பயன்படுத்தியுள்ளீர்கள் என்று சந்தேகிக்கிறேன், இது போல் தோற்றமளிக்கும் ஆனால் பிரிவு இயக்கி `/` இலிருந்து வேறுபட்டது.

source: Did you use a unicode fraction?
ru: Вы использовали дробь в юникоде?
ta: ஒருங்குறி பின்னத்தைப் பயன்படுத்துகிறீர்களா?

source: I suspect that you used the unicode character `{char}`meant to represent a fraction. The name of this unicode character is {name}.
ru: Предполагаю, что вы использовали символ юникода `{char}`, предназначенный для представления дроби. Название этого символа юникода: {name}.
ta: நீங்கள் ஒருங்குறி எழுத்தான `{char}`ஐப் பயன்படுத்தியிருப்பதை நான் சந்தேகிக்கிறேன். இந்த ஒருங்குறி எழுத்தின் பெயர் {name}.

source: Did you mean `{num}/{denom}`?
ru: Вы имели в виду `{num}/{denom}`?
ta: `{num}/{denom}` எனக் குறிப்பிடுகிறீர்களா?

source: You used the unicode character {char} which is known as {name} I suspect that you meant to write the fraction `{num}/{denom}` instead.
ru: Вы использовали символ юникода {char}, известный как {name} Предполагаю, что вместо этого вы хотели написать дробь `{num}/{denom}`.
ta: நீங்கள் ஒருங்குறி எழுத்தை {char} பயன்படுத்தியுள்ளீர்கள் {name} அதற்குப் பதிலாக `{num}/{denom}` என்ற பின்னத்தை எழுத நினைத்தீர்கள் என்று சந்தேகிக்கிறேன்.

source: You have {container_type} followed by square brackets, `[...]`. What is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
ru: В выражении `{container_type}` то, что включено между квадратными скобками, `[...]`, должно быть либо целым числом, либо фрагментом (`start:stop` или `start:stop:step`) а вы вместо этого использовали {obj_type}.

source: Exception raised on line {linenumber} of code block {filename}.
ta: குறியீட்டுப் பகுதி {filename} இன் {linenumber} வரியில் விதிவிலக்கு எழுப்பப்பட்டது.

source: Exception raised on line {linenumber} of file {filename}.
ta: {filename} கோப்பின் {linenumber} ஆம் வரியில் விதிவிலக்கு எழுப்பப்பட்டது.

source: Execution stopped on line {linenumber} of code block {filename}.
ta: குறியீட்டுப் பகுதி {filename} இன் {linenumber} ஆம் வரியில் செயல்படுத்தல் நிறுத்தப்பட்டது.

source: Execution stopped on line {linenumber} of file {filename}.
ta: {filename} கோப்பின் {linenumber} ஆம் வரியில் செயல்படுத்தல் நிறுத்தப்பட்டது.

source: at the location indicated by ^.
ta: ^ ஆல் சுட்டிக்காட்டப்பட்ட இடத்தில்.

source: No information is available about this warning.
ta: இந்த முன்னறிவிப்பு குறித்து எந்த தகவலும் இல்லை.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/aroberge/friendly/issues
ta: தற்போது, இந்த பிழைக்கான காரணத்தை என்னால் நினைக்க முடியவில்லை. (, ), [, ], :, போன்ற எழுத்துப்பிழைகள் அல்லது விடுபட்ட சின்னங்களை உங்களால் அடையாளம் காண முடியுமா என்பதைப் பார்க்க, சுட்டிக்காட்டப்பட்ட வரியையும் உடனடியாக மேலே உள்ள வரியையும் கவனமாக ஆராய முயற்சிக்கவும். உங்கள் குறியீடு வகை சிறுகுறிப்புகளைப் பயன்படுத்தாவிட்டால், எங்கள் எல்லைக்கு அப்பாற்பட்டது, இது நட்புடன் கையாளப்பட வேண்டிய ஒன்று என்று நீங்கள் நினைத்தால், இந்த வழக்கை https://github.com/aroberge/friendly/issues க்கு புகாரளிக்கவும்

source: some value
ta: சில மதிப்பு

source: You wrote an expression like {fn_call} = {value} where `{fn_call}`, on the left-hand side of the equal sign, is a function call and not the name of a variable.
ta: நீங்கள் இது போன்ற ஒரு வெளிப்பாட்டை எழுதியுள்ளீர்கள், {fn_call} = {value} அங்கு சம அடையாளத்தின் இடது பக்கத்தில் `{fn_call}` என்பது ஒரு செயல்பாட்டு அழைப்பாகும், அது மாறியின் பெயர் அல்ல.
