Repository: Dmitry-Baz/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: ru, ta

source: This symbol can only be used with Python versions 3.8.0 or newer. You are using Python version {version}.
ru: Этот символ можно использовать только с Python версии 3.8.0 или новее. Вы же используете Python версии {version}.
ta: இந்த சின்னத்தை பைதான் பதிப்புகள் 3.8.0 அல்லது புதியவற்றில் மட்டுமே பயன்படுத்த முடியும். நீங்கள் பைத்தான் பதிப்பு {version} ஐப் பயன்படுத்துகிறீர்கள்.

source: You have unspecified keyword arguments that appear before the symbol `/`.
ru: У вас есть неопределенные аргументы в виде ключевых слов, которые идут перед символом `/`.
ta: `/` சின்னத்திற்கு முன் தோன்றும் குறிப்பிடப்படாத முக்கியச்சொல் வாதங்கள் உங்களிடம் உள்ளன.

source: Keyword arguments must appear after the `/` symbol.
ru: Ключевые аргументы должны идти после символа `/`.
ta: முக்கியச்சொல் வாதங்கள் `/` சின்னத்திற்குப் பிறகு தோன்ற வேண்டும்.

source: However, `*` indicates that the arguments that follow must be keyword arguments. When they are used together, `/` must appear before `*`.
ru: `*` указывает, что аргументы, которые следуют за ним, должны быть ключевыми. Когда они используются вместе, `/` должно идти перед `*`.
ta: இருப்பினும், பின் வரும் வாதங்கள் முக்கியச்சொல் வாதங்களாக இருக்க வேண்டும் என்பதை `*` குறிக்கிறது. அவற்றை ஒன்றாகப் பயன்படுத்தும்போது, `*` க்கு முன் `/` தோன்ற வேண்டும்.

source: `*` must appear after `/` in a function definition.
ru: `*` должен идти после `/` в определении функции.
ta: `*` ஒரு செயல்பாட்டு வரையறையில் `/` க்குப் பிறகு தோன்ற வேண்டும்.

source: `*{name}` must appear after `/` in a function definition.
ru: `*{name}` должно идти после `/` в определении функции.
ta: `*{name}` ஒரு செயல்பாட்டு வரையறையில் `/` க்குப் பிறகு தோன்ற வேண்டும்.

source: You can only use `/` once in a function definition.
ru: Вы можете использовать `/` только один раз в определении функции.
ta: செயல்பாட்டு வரையறையில் நீங்கள் ஒரு முறை மட்டுமே `/` பயன்படுத்த முடியும்.

source: You can only use `*` once in a function definition.
ru: Вы можете использовать `*` только один раз в определении функции.
ta: செயல்பாட்டு வரையறையில் நீங்கள் ஒரு முறை மட்டுமே `*` பயன்படுத்த முடியும்.

source: You have used it twice, with `*{first}` and `*{second}`.
ru: Вы использовали его дважды, с `*{first}` и `*{second}`.
ta: `*{first}` மற்றும் `*{second}` உடன் இருமுறை பயன்படுத்தியுள்ளீர்கள்.

source: It must either be used by itself, `*`, or in the form `*{args}`, but not both.
ru: Он должен использоваться либо сам по себе, `*`, либо в виде `*{args}`, но не в обоих случаях.
ta: இது தானாகவே பயன்படுத்தப்பட வேண்டும், `*` அல்லது `*{args}` வடிவத்தில், ஆனால் இரண்டும் அல்ல.

source: `*{args}` must appear before `**{kwargs}`.
ru: `*{args}` должен идти перед `**{kwargs}`.
ta: `**{kwargs}` க்கு முன் `*{args}` தோன்ற வேண்டும்.

source: `**{kwargs}` must appear after the `*` operator.
ru: `**{kwargs}` должны идти после оператора `*`.
ta: `** இயக்கிக்குப் பிறகு `**{kwargs}` தோன்ற வேண்டும்.

source: You cannot use numbers as function arguments.
ru: Вы не можете использовать числа в качестве аргументов функций.
ta: நீங்கள் எண்களை செயல்பாட்டு வாதங்களாகப் பயன்படுத்த முடியாது.

source: You used a number as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
ru: Вы использовали число в качестве аргумента при определении функции. В качестве аргументов функции можно использовать только идентификаторы (имена переменных).
ta: ஒரு செயல்பாட்டை வரையறுக்கும்போது எண்ணை வாதமாகப் பயன்படுத்தியுள்ளீர்கள். நீங்கள் அடையாளங்காட்டிகளை (மாறி பெயர்கள்) செயல்பாட்டு வாதங்களாக மட்டுமே பயன்படுத்த முடியும்.

source: You cannot use strings as function arguments.
ru: Вы не можете использовать строки в качестве аргументов функций.
ta: நீங்கள் சரங்களை செயல்பாட்டு வாதங்களாகப் பயன்படுத்த முடியாது.

source: You used a string as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
ru: Вы использовали строку в качестве аргумента при определении функции. В качестве аргументов функции можно использовать только идентификаторы (имена переменных).
ta: ஒரு செயல்பாட்டை வரையறுக்கும்போது ஒரு சரத்தை வாதமாகப் பயன்படுத்தியுள்ளீர்கள். நீங்கள் அடையாளங்காட்டிகளை (மாறி பெயர்கள்) செயல்பாட்டு வாதங்களாக மட்டுமே பயன்படுத்த முடியும்.

source: You cannot have explicit tuples as function arguments.
ru: Вы не можете иметь явные кортежи в качестве аргументов функции.
ta: செயல்பாட்டு வாதங்களாக வெளிப்படையான மடங்குகளை நீங்கள் கொண்டிருக்க முடியாது.

source: You can only use identifiers (variable names) as function arguments. Assign any tuple to a parameter and unpack it within the body of the function.
ru: В качестве аргументов функции можно использовать только идентификаторы (имена переменных). Присвойте любой кортеж параметру и распакуйте его в теле функции.
ta: நீங்கள் அடையாளங்காட்டிகளை (மாறி பெயர்கள்) செயல்பாட்டு வாதங்களாக மட்டுமே பயன்படுத்த முடியும். எந்த மடங்கையும் ஒரு அளவுருவுக்கு ஒதுக்கி, செயல்பாட்டின் உடலில் அதைத் திறக்கவும்.

source: You cannot have explicit lists as function arguments.
ru: Вы не можете иcпользовать явные списки в качестве аргументов функции.
ta: செயல்பாட்டு வாதங்களாக வெளிப்படையான பட்டியல்களை நீங்கள் வைத்திருக்க முடியாது.

source: You can only use identifiers (variable names) as function arguments.
ru: В качестве аргументов функций можно использовать только идентификаторы (имена переменных).
ta: நீங்கள் அடையாளங்காட்டிகளை (மாறி பெயர்கள்) செயல்பாட்டு வாதங்களாக மட்டுமே பயன்படுத்த முடியும்.

source: You cannot have any explicit dict or set as function arguments.
ru: В качестве аргументов функции нельзя использовать явные словари или множества.
ta: உங்களிடம் வெளிப்படையான அகராதி அல்லது தொகுப்பு செயல்பாட்டு வாதங்களாக ஏற்க முடியாது.

source: You cannot have operators as function arguments.
ru: Вы не можете использовать операторы в качестве аргументов функции.
ta: நீங்கள் இயக்கிகளை செயல்பாட்டு வாதங்களாக வைத்திருக்க முடியாது.

source: I suspect you made a typo and wrote `{op}` instead of a comma. The following statement contains no syntax error: {new_statement}
ru: Предполагаю, что вы допустили опечатку и написали `{op}` вместо запятой. Следующее утверждение не содержит синтаксической ошибки: {new_statement}
ta: நீங்கள் எழுத்துப்பிழை செய்து காற்புள்ளிக்கு பதிலாக `{op}` என்று எழுதியிருக்கிறீர்கள் என்று சந்தேகிக்கிறேன். பின்வரும் அறிக்கையில் தொடரியல் பிழை இல்லை: {new_statement}

source: Did you mean to write an equal sign?
ru: Вы хотели поставить знак равенства?
ta: நீங்கள் சமமான அடையாளத்தை எழுத விரும்புகிறீர்களா?

source: I suspect you made a typo and wrote `{op}` instead of an equal sign. The following statement contains no syntax error: {new_statement}
ru: Предполагаю, что вы допустили опечатку и написали `{op}` вместо знака равенства. Следующее утверждение не содержит синтаксической ошибки: {new_statement}
ta: நீங்கள் எழுத்துப் பிழை செய்து, சம அடையாளத்திற்குப் பதிலாக `{op}` என்று எழுதியிருக்கிறீர்கள் என்று சந்தேகிக்கிறேன். பின்வரும் அறிக்கையில் தொடரியல் பிழை இல்லை: {new_statement}

source: Did you mean to write `{op}`?
ru: Вы хотели написать `{op}`?
ta: `{op}` என்று எழுத வேண்டுமா?

source: I suspect you made a typo and added `{op}` by mistake. The following statement contains no syntax error: {new_statement}
ru: Предполагаю, что вы допустили опечатку и добавили `{op}` по ошибке. Следующий оператор не содержит синтаксических ошибок: {new_statement}
ta: நீங்கள் எழுத்துப்பிழை செய்து, தவறுதலாக `{op}` சேர்த்திருக்கிறீர்கள் என்று சந்தேகிக்கிறேன். பின்வரும் அறிக்கையில் தொடரியல் பிழை இல்லை: {new_statement}

source: You cannot use `{op}` as an argument.
ru: Вы не можете использовать `{op}` в качестве аргумента.
ta: நீங்கள் `{op}` வாதமாகப் பயன்படுத்த முடியாது.

source: I suspect you made a typo and wrote `{op}` by mistake. If you replace it by a unique variable name, the result will contain no syntax error.
ru: Предполагаю, что вы допустили опечатку и по ошибке написали `{op}`. Если вы замените его на уникальное имя переменной, результат не будет содержать синтаксической ошибки.
ta: நீங்கள் எழுத்துப்பிழை செய்து, தவறுதலாக `{op}` என்று எழுதிவிட்டீர்கள் என்று சந்தேகிக்கிறேன். நீங்கள் அதை ஒரு தனித்துவமான மாறி பெயரால் மாற்றினால், முடிவில் தொடரியல் பிழை இருக்காது.

source: I suspect you made a typo and wrote `{op}` by mistake, perhaps instead of writing an identifier (variable name).
ru: Предполагаю, что вы допустили опечатку и по ошибке написали `{op}`, вместо идентификатора (имени переменной).
ta: நீங்கள் தட்டச்சுப் பிழையைச் செய்துவிட்டு தவறுதலாக `{op}` என்று எழுதியிருக்கலாம், ஒருவேளை அடையாளங்காட்டியை (மாறி பெயர்) எழுதுவதற்குப் பதிலாக இருக்கலாம்.

source: The `**` operator needs to be followed by an identifier (variable name).
ru: За оператором `**` должен следовать идентификатор (имя переменной).
ta: `**` ஆபரேட்டரை ஒரு அடையாளங்காட்டி (மாறி பெயர்) பின்பற்ற வேண்டும்.

source: Positional arguments must come before keyword arguments.
ru: Позиционные аргументы должны идти перед ключевыми аргументами.
ta: முக்கியச்சொல் வாதங்களுக்கு முன் நிலை வாதங்கள் வர வேண்டும்.

source: `{arg}` is a positional argument that appears after one or more keyword arguments in your function definition.
ru: `{arg}` -- это позиционный аргумент, который находится после одного или нескольких ключевых аргументов в определении вашей функции.
ta: `{arg}` என்பது உங்கள் செயல்பாட்டு வரையறையில் ஒன்று அல்லது அதற்கு மேற்பட்ட முக்கியச்சொல் வாதங்களுக்குப் பிறகு தோன்றும் நிலை வாதமாகும்.

source: Line `{number}` identified above is more indented than expected.
ru: Строка `{number}`, определенная выше, имеет больший отступ, чем требуется.
ta: மேலே அடையாளம் காணப்பட்ட வரி `{number}` எதிர்பார்த்ததை விட அதிகமாக உள்தள்ளப்பட்டுள்ளது.

source: Line `{number}` identified above was expected to begin a new indented block.
ru: Ожидалось, что строка `{number}`, указанная выше, начнет новый блок с отступом.
ta: மேலே அடையாளம் காணப்பட்ட வரி `{number}` புதிய உள்தள்ளப்பட்ட தொகுதியைத் தொடங்கும் என எதிர்பார்க்கப்பட்டது.

source: Line `{number}` identified above is less indented than expected.
ru: Строка `{number}`, определенная выше, имеет меньший отступ, чем требуется..
ta: மேலே அடையாளம் காணப்பட்ட வரி `{number}` எதிர்பார்த்ததை விட குறைவாக உள்தள்ளப்பட்டுள்ளது.

source: However, line {number}, which is identified as having a problem, consists of a single string which is also the case for the preceding line. Perhaps you meant to include a continuation character, `\`, at the end of line {preceding}.
ru: Строка {number}, которая идентифицируется как имеющая проблему, состоит из одной строки, что также характерно и для для предыдущей строки. Возможно, вы хотели включить символ продолжения `\`, в конце строки {preceding}.
ta: இருப்பினும், சிக்கல் இருப்பதாக அடையாளம் காணப்பட்ட வரி {number}, முந்தைய வரியிலும் உள்ள ஒற்றை சரத்தைக் கொண்டுள்ளது. வரியின் {preceding} முடிவில், `\` என்ற தொடர்ச்சியை நீங்கள் சேர்க்க நினைத்திருக்கலாம்.

source: You can only assign objects to identifiers (variable names).
ru: Вы можете присваивать объекты только идентификаторам (именам переменных)
ta: அடையாளங்காட்டிகளுக்கு (மாறி பெயர்கள்) மட்டுமே நீங்கள் பொருட்களை ஒதுக்க முடியும்.

source: You can only delete names of objects, or items in mutable containers such as `list`, `set`, or `dict`.
ru: Вы можете удалять только имена объектов или элементы в изменяемых контейнерах, таких как `list`, `set` или `dict`.
ta: நீங்கள் பொருள்களின் பெயர்கள் அல்லது `பட்டியல்`, `தொகுப்பு` அல்லது `அகராதி` போன்ற மாறக்கூடிய கொள்கலன்களில் உள்ள உருப்படிகளை மட்டுமே நீக்க முடியும்.

source: of type `int`
ru: типа `int`
ta: `முழுஎண்` வகை

source: of type `complex`
ru: типа `complex`
ta: `சிக்கலான` வகை

source: of type `float`
ru: типа `float`
ta: `மிதவைப்புள்ளி` வகை

source: of type `str`
ru: типа `str`
ta: `சரம்` வகை

source: of type `dict`
ru: типа `dict`
ta: `அகராதி` வகை

source: of type `list`
ru: типа `list`
ta: `பட்டியல்` வகை

source: of type `set`
ru: типа `set`
ta: `தொகுப்பு` வகை

source: of type `tuple`
ru: типа `tuple`
ta: `மடங்கு` வகை

source: Did you mean `{num}`?
ru: Вы имели в виду `{num}`?
ta: `{num}` எனக் குறிப்பிடுகிறீர்களா?

source: Perhaps you meant to write the octal number `{num}` and forgot the letter 'o', or perhaps you meant to write a decimal integer and did not know that it could not start with zeros.
ru: Возможно, вы хотели написать восьмеричное число `{num}`. и забыли букву 'о', или, возможно, вы хотели написать десятичное целое число и не знали, что оно не может начинаться с нулей.
ta: ஒருவேளை நீங்கள் `{num}` என்ற எண்ம எண்ணை எழுத எண்ணி, 'o' என்ற எழுத்தை மறந்துவிட்டீர்கள், அல்லது ஒரு தசம முழு எண்ணை எழுத நினைத்திருக்கலாம், அது சுழியங்களுடன் தொடங்க முடியாது என்று தெரியவில்லை.

source: Perhaps you meant to write the integer `{num}` and did not know that it could not start with zeros.
ru: Возможно, вы хотели написать целое число `{num}` и не знали, что оно не может начинаться с нулей.
ta: ஒருவேளை நீங்கள் முழு எண்ணை `{num}` எழுத நினைத்திருக்கலாம், மேலும் அது சுழியங்களுடன் தொடங்க முடியாது என்று தெரியவில்லை.

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. A conditional expression has the following form: variable = object if condition else other_object
ru: Вместо имени переменной слева от знака равенства находится условное выражение. Оно имеет следующий вид: variable = object if условие else other_object
ta: சம அடையாளத்தின் இடது புறத்தில், மாறியின் பெயருக்குப் பதிலாக நிபந்தனை வெளிப்பாடு உள்ளது. நிபந்தனை வெளிப்பாடு பின்வரும் வடிவத்தைக் கொண்டுள்ளது: மாறி = பொருள் if நிபந்தனை else மற்ற_பொருள்

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. {expression} = ... {mark}
ru: С левой стороны от знака равенства находится условное выражение вместо имени переменной. {expression} = ... {mark}

source: On the left-hand side of an equal sign, you have an expression instead of the name of a variable.
ru: Слева от знака равенства выражение вместо имени переменной.
ta: சம அடையாளத்தின் இடது புறத்தில், மாறியின் பெயருக்குப் பதிலாக ஒரு வெளிப்பாடு உள்ளது.

source: You wrote the expression {fn_call} = ... where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
ru: Вы написали выражение {fn_call} = ... где `{fn_call}`, слева от знака равенства, либо является либо включает вызов функции и не является просто именем переменной.

source: You wrote the expression {fn_call} = ... {mark} where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
ru: Вы написали выражение {fn_call} = ... {mark} где `{fn_call}`, слева от знака равенства, либо является либо включает вызов функции и не является просто именем переменной.

source: On the left-hand side of an equal sign, you have a generator expression instead of the name of a variable.
ru: Слева от знака равенства генераторное выражение вместо имени переменной.
ta: சம அடையாளத்தின் இடது புறத்தில், மாறியின் பெயருக்குப் பதிலாக உருவாக்கி வெளிப்பாடு உள்ளது.

source: You wrote an expression that has the f-string `{fstring}` on the left-hand side of the equal sign. An f-string should only appear on the right-hand side of an equal sign.
ru: Вы написали выражение, в котором f-строка `{fstring}` находится слева от знака равенства. f-строка должна находиться только справа от знака равенства.
ta: சம அடையாளத்தின் இடது புறத்தில் f-சரம் `{fstring}` கொண்ட ஒரு வெளிப்பாட்டை நீங்கள் எழுதியுள்ளீர்கள். ஒரு f-சரம் ஒரு சம அடையாளத்தின் வலது பக்கத்தில் மட்டுமே தோன்றும்.

source: You cannot assign a value to `{keyword}`.
ru: Вы не можете присвоить значение `{keyword}`.
ta: `{keyword}`க்கு மதிப்பை ஒதுக்க முடியாது.

source: You cannot assign a value to the ellipsis symbol [`...`].
ru: Многоточию (ellipsis) [`...`] нельзя присвоить значение.
ta: நீள்வட்டச் சின்னத்திற்கு [`...`] மதிப்பை நீங்கள் ஒதுக்க முடியாது.

source: The ellipsis symbol `...` is a constant in Python;you cannot assign it a different value.
ru: Многоточие (ellipsis) `...` является константой в Python; вы не можете присвоить ему другое значение.
ta: நீள்வட்டச் சின்னம் `...` என்பது பைத்தானில் ஒரு மாறிலி; அதற்கு வேறு மதிப்பை நீங்கள் ஒதுக்க முடியாது.

source: `{keyword}` is a constant in Python; you cannot assign it a different value.
ru: `{keyword}` является константой в Python; вы не можете присвоить ему другое значение.
ta: `{keyword}` என்பது பைத்தானில் ஒரு மாறிலி; நீங்கள் வேறு மதிப்பை ஒதுக்க முடியாது.

source: You were trying to assign a value to the Python keyword `{keyword}`. This is not allowed.
ru: Вы пытались присвоить значение `{keyword}`, ключевому слову Python. Это недопустимо.
ta: பைதான் முக்கியச்சொல்லான `{keyword}` க்கு மதிப்பை ஒதுக்க முயற்சிக்கிறீர்கள். இதற்கு அனுமதி இல்லை.

source: A for loop must have the form: for ... in sequence: where `...` must contain only identifiers (variable names) and not literals like `{bad_token}`.
ru: Цикл for должен иметь вид: for ... in sequence: где `...` должен содержать только идентификаторы (имена переменных) а не литералы типа `{bad_token}`.
ta: ஒரு சுழல் இந்த படிவத்தைக் கொண்டிருக்க வேண்டும்: for ... in sequence: இங்கு `...` என்பதில் அடையாளங்காட்டிகள் மட்டுமே இருக்க வேண்டும் (மாறி பெயர்கள்) மற்றும் `{bad_token}` போன்ற எழுத்துக்கள் இருக்கக்கூடாது.

source: Perhaps you meant to write: {name} = {literal}
ru: Возможно, вы хотели написать: {name} = {literal}
ta: ஒருவேளை நீங்கள் எழுத நினைத்திருக்கலாம்: {name} = {literal}

source: Perhaps you meant to write `{name} = {literal}`
ru: Возможно, вы хотели написать `{name} = {literal}`
ta: ஒருவேளை நீங்கள் `{name} = {literal}` என்று எழுத நினைத்திருக்கலாம்

source: You wrote an expression like {literal} = {name} where `{literal}`, on the left-hand side of the equal sign, is or includes an actual object {of_type} and is not simply the name of a variable.
ru: Вы написали выражение типа {literal} = {name} где `{literal}`, слева от знака равенства, является или включает в себя реальный объект {of_type} а не просто имя переменной.
ta: நீங்கள் இது போன்ற ஒரு வெளிப்பாட்டை எழுதியுள்ளீர்கள், {literal} = {name} இங்கு சம அடையாளத்தின் இடது புறத்தில் `{literal}` என்பது ஒரு உண்மையான பொருள் {of_type} அல்லது உள்ளடக்கியது மற்றும் வெறுமனே ஒரு மாறியின் பெயர் அல்ல.

source: You wrote an expression that includes some mathematical operations on the left-hand side of the equal sign which should be only used to assign a value to a variable.
ru: Вы написали выражение, включающее некоторые математические операции слева от знака равенства, который следует использовать только для присвоения значения переменной.
ta: சம அடையாளத்தின் இடது புறத்தில் சில கணித செயல்பாடுகளை உள்ளடக்கிய ஒரு வெளிப்பாட்டை நீங்கள் எழுதியுள்ளீர்கள், இது மாறிக்கு மதிப்பை ஒதுக்க மட்டுமே பயன்படுத்தப்பட வேண்டும்.

source: Perhaps you meant to write `{name}` instead of `{original}`
ru: Возможно вы хотели написать `{name}` вместо `{original}`.
ta: ஒருவேளை நீங்கள் `{original}` என்பதற்குப் பதிலாக `{name}` என்று எழுத நினைத்திருக்கலாம்

source: Perhaps you needed `==` instead of `=`.
ru: Возможно, вам нужно `==` вместо `=`.
ta: `=` என்பதற்குப் பதிலாக `==` தேவைப்படலாம்.

source: You wrote an expression that includes the `yield` keyword on the left-hand side of the equal sign. You cannot assign a value to such an expression. Note that, like the keyword `return`, `yield` can only be used inside a function.
ru: Вы написали выражение, которое содержит ключевое слово `yield` слева от знака равенства. Такому выражению нельзя присвоить значение. Обратите внимание, что, как и ключевое слово `return`, `yield` можно использовать только внутри функции.
ta: சம அடையாளத்தின் இடது புறத்தில் `yield` முக்கிய சொல்லை உள்ளடக்கிய ஒரு வெளிப்பாட்டை எழுதியுள்ளீர்கள். அத்தகைய வெளிப்பாட்டிற்கு நீங்கள் மதிப்பை ஒதுக்க முடியாது. முக்கியச்சொல்லான return`, `yield` என்பது ஒரு செயல்பாட்டிற்குள் மட்டுமே பயன்படுத்தப்படும் என்பதை நினைவில் கொள்ளவும்.

source: You are using the augmented assignment operator `:=` inside a comprehension to assign a value to the iteration variable `{var}`. This variable is meant to be used only inside the comprehension. The augmented assignment operator is normally used to assign a value to a variable so that the variable can be reused later. This is not possible for variable `{var}`.
ru: Вы используете дополненный (моржовый) оператор присваивания `:=` внутри comprehension для присвоения значения итерационной переменной `{var}`. Эта переменная предназначена для использования только внутри comprehension. Дополненный оператор присваивания обычно используется для присвоения значения переменной, чтобы ее можно было использовать повторно. Это невозможно для переменной `{var}`.
ta: மறுசெய்கை மாறி `{var}`க்கு மதிப்பை ஒதுக்க, புரிந்துகொள்ளுதலுக்குள் `:=` பெரிதாக்கப்பட்ட ஒதுக்கும் இயக்கியைப் பயன்படுத்துகிறீர்கள். இந்த மாறியானது புரிதலின் உள்ளே மட்டுமே பயன்படுத்தப்பட வேண்டும். பெரிதாக்கப்பட்ட ஒதுக்கும் இயக்கி பொதுவாக ஒரு மாறிக்கு மதிப்பை ஒதுக்கப் பயன்படுகிறது, இதனால் மாறி பின்னர் மீண்டும் பயன்படுத்தப்படலாம். `{var}` மாறிக்கு இது சாத்தியமில்லை.

source: The object named `{name}` is defined with type annotation as a local variable. It cannot be declared to be a global variable.
ru: Объект с именем `{name}` определен с аннотацией типа как локальная переменная. Он не может быть объявлен как глобальная переменная.
ta: `{name}` என்ற பெயரிடப்பட்ட பொருள், உள்ளூர் மாறியாக வகை சிறுகுறிப்பு மூலம் வரையறுக்கப்படுகிறது. இது உலகளாவிய மாறி என்று அறிவிக்க முடியாது.

source: You cannot use the augmented assignment operator `:=`, sometimes called the walrus operator, with literals like `{bad_token}`. You can only assign objects to identifiers (variable names).
ru: Вы не можете использовать дополненный оператор присваивания `:=`, иногда называемый моржовым оператором, с литералами типа `{bad_token}`. Вы можете присваивать объекты только идентификаторам (именам переменных).
ta: பெரிதாக்கப்பட்ட ஒதுக்கும் இயக்கியான `:=`, சில சமயங்களில் கடற்குதிரை இயக்கி என அழைக்கப்படும், `{bad_token}` போன்ற எழுத்துக்களுடன் நீங்கள் பயன்படுத்த முடியாது. அடையாளங்காட்டிகளுக்கு (மாறி பெயர்கள்) மட்டுமே நீங்கள் பொருட்களை ஒதுக்க முடியும்.

source: You declared `{name}` as being both a global and nonlocal variable. A variable can be global, or nonlocal, but not both at the same time.
ru: Вы объявили `{name}` как global и nonlocal переменную одновременно. Переменная может быть global или nonlocal, но не обеими одновременно.
ta: நீங்கள் `{name}` ஆனது உலகளாவிய மற்றும் உள்ளூர் அல்லாத மாறி என அறிவித்தீர்கள். ஒரு மாறி உலகளாவியதாகவோ அல்லது உள்ளூர் அல்லாததாகவோ இருக்கலாம், ஆனால் இரண்டும் ஒரே நேரத்தில் அல்ல.

source: Python tells us that the {bracket} was never closed.
ru: Python сообщает нам, что отсутствует закрывающая {bracket}.
ta: {bracket} ஒருபோதும் மூடப்படவில்லை என்று பைதான் சொல்கிறது.

source: The {bracket} was never closed.
ru: Отсутствует закрывающая {bracket}.
ta: {bracket} ஒருபோதும் மூடப்படவில்லை.

source: The Python keyword `break` can only be used inside a `for` loop or inside a `while` loop.
ru: Ключевое слово Python `break` можно использовать только внутри циклов `for` или `while`.
ta: பைதான் முக்கிய சொல்லான `break` என்பது `for` சுழலில் அல்லது `while` சுழலில் மட்டுமே பயன்படுத்தப்படும்.

source: You likely used an assignment operator `=` instead of an equality operator `==`.
ru: Скорее всего, вы использовали оператор присваивания `=` вместо оператора равенства `==`.
ta: சமத்துவ இயக்கிக்குப் பதிலாக `=` ஒதுக்கீட்டு இயக்கிகளைப் பயன்படுத்தியிருக்கலாம்.

source: The following statement would not contain a syntax error: {new_statement}
ru: Следующее утверждение не будет содержать синтаксической ошибки: {new_statement}
ta: பின்வரும் அறிக்கையில் தொடரியல் பிழை இருக்காது: {new_statement}

source: You cannot delete the constant `{constant}`.
ru: Вы не можете удалить константу `{constant}`.
ta: நீங்கள் நிலையான `{constant}` ஐ நீக்க முடியாது.

source: You cannot delete a Python expression.
ru: Вы не можете удалить выражение Python.
ta: நீங்கள் ஒரு பைதான் வெளிப்பாட்டை நீக்க முடியாது.
